/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"status.400": "Requête incorrecte. Impossible de traiter la requête, car sa syntaxe est incorrecte.",
	"status.401": "Non autorisé. Le serveur refuse de répondre.",
	"status.403": "Interdit. Le serveur refuse de répondre.",
	"status.404": "Introuvable. L'emplacement demandé est introuvable.",
	"status.405": "Méthode non autorisée. Une requête a été effectuée à l'aide d'une méthode de requête qui n'est pas prise en charge par cet emplacement.",
	"status.406": "Inacceptable. Le serveur peut uniquement générer une réponse qui n'est pas acceptée par le client.",
	"status.407": "Authentification proxy exigée. Le client doit d'abord s'authentifier auprès du proxy.",
	"status.408": "Délai d'expiration de la requête dépassé. Le serveur a dépassé le délai imparti pour la requête.",
	"status.409": "Conflit. Impossible de traiter la requête, car celle-ci présente un conflit.",
	"status.410": "Non disponible. La page demandée n'est plus disponible.",
	"status.411": "Longueur exigée. \"Content-Length\" n'est pas défini.",
	"status.412": "Échec de la condition préalable. Celle donnée dans la requête a été évaluée comme false par le serveur.",
	"status.413": "Entité de la requête trop grande. Le serveur n'accepte pas la requête, car l'entité de requête est trop longue.",
	"status.414": "URI de requête trop long. Le serveur n'accepte pas la demande, car l'URL est trop longue.",
	"status.415": "Type de média non pris en charge. Le serveur n'accepte pas la requête, car le type de média n'est pas pris en charge.",
	"status.416": "Code d'état HTTP {0}",
	"status.500": "Erreur du serveur interne.",
	"status.501": "Non implémenté. Soit le serveur ne reconnaît pas la méthode de la requête, soit il ne peut pas traiter la requête.",
	"status.503": "Service non disponible. Le serveur est actuellement indisponible (surchargé ou arrêté)."
}