// ATTENTION - THIS DIRECTORY CONTAINS THIRD PARTY OPEN SOURCE MATERIALS:
[
{
	"name": "chriskempson/tomorrow-theme",
	"version": "0.0.0",
	"license": "MIT",
	"isProd": true,
	"repositoryURL": "https://github.com/chriskempson/tomorrow-theme",
	"licenseDetail": [
		"Copyright (C) 2013 Chris Kempson",
		"",
		"Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense,", "and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:",
		"",
		"The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.",
		"",
		"THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER", "LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
	]
},
{
	"name": "markdown-it/markdown-it",
	"version": "0.0.0",
	"license": "MIT",
	"isProd": true,
	"repositoryURL": "https://github.com/markdown-it/markdown-it"
},
{
	"name": "isagalaev/highlight.js",
	"version": "0.0.0",
	"license": "BSD",
	"isProd": true,
	"repositoryURL": "https://github.com/isagalaev/highlight.js",
	"licenseDetail": [
		"Copyright (c) 2006, Ivan Sagalaev",
		"All rights reserved.",
		"Redistribution and use in source and binary forms, with or without",
		"modification, are permitted provided that the following conditions are met:",
		"",
		"    * Redistributions of source code must retain the above copyright",
		"      notice, this list of conditions and the following disclaimer.",
		"    * Redistributions in binary form must reproduce the above copyright",
		"      notice, this list of conditions and the following disclaimer in the",
		"      documentation and/or other materials provided with the distribution.",
		"    * Neither the name of highlight.js nor the names of its contributors",
		"      may be used to endorse or promote products derived from this software",
		"      without specific prior written permission.",
		"",
		"THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND ANY",
		"EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED",
		"WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE",
		"DISCLAIMED. IN NO EVENT SHALL THE REGENTS AND CONTRIBUTORS BE LIABLE FOR ANY",
		"DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES",
		"(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;",
		"LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND",
		"ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT",
		"(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS",
		"SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
	]
},
{
	"name": "leff/markdown-it-named-headers",
	"version": "0.0.0",
	"license": "UNLICENSE",
	"isProd": true,
	"repositoryURL": "https://github.com/leff/markdown-it-named-headers",
	"licenseDetail": [
		"Copyright (c) markdown-it-named-headers authors",
		"",
		"This is free and unencumbered software released into the public domain.",
		"",
		"Anyone is free to copy, modify, publish, use, compile, sell, or",
		"distribute this software, either in source code form or as a compiled",
		"binary, for any purpose, commercial or non-commercial, and by any",
		"means.",
		"",
		"In jurisdictions that recognize copyright laws, the author or authors",
		"of this software dedicate any and all copyright interest in the",
		"software to the public domain. We make this dedication for the benefit",
		"of the public at large and to the detriment of our heirs and",
		"successors. We intend this dedication to be an overt act of",
		"relinquishment in perpetuity of all present and future rights to this",
		"software under copyright law.",
		"",
		"THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,",
		"EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF",
		"MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.",
		"IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR",
		"OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,",
		"ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR",
		"OTHER DEALINGS IN THE SOFTWARE.",
		"",
		"For more information, please refer to <http://unlicense.org/>"
	]
},
{
	"name": "textmate/markdown.tmbundle",
	"version": "0.0.0",
	"license": "TextMate Bundle License",
	"isProd": true,
	"repositoryURL": "https://github.com/textmate/markdown.tmbundle",
	"licenseDetail": [
		"Copyright (c) markdown.tmbundle authors",
		"",
		"If not otherwise specified (see below), files in this repository fall under the following license:",
		"",
		"Permission to copy, use, modify, sell and distribute this",
		"software is granted. This software is provided \"as is\" without",
		"express or implied warranty, and with no claim as to its",
		"suitability for any purpose.",
		"",
		"An exception is made for files in readable text which contain their own license information,",
		"or files where an accompanying file exists (in the same directory) with a \"-license\" suffix added",
		"to the base-name name of the original file, and an extension of txt, html, or similar. For example",
		"\"tidy\" is accompanied by \"tidy-license.txt\"."
	]
}
]
