/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"ShowAccessibilityHelpAction": "Показать справку по специальным возможностям",
	"experimentalScreenReaderOptsOn": "Поддержка экспериментального средства чтения с экрана включена в соответствии с параметром editor.experimentalScreenReader.",
	"experimentalScreenReaderSessionOff": "Поддержка экспериментального средства чтения с экрана отключена. Чтобы включить ее для этого сеанса, нажмите клавишу {0}. Чтобы включить ее для всех сеансов, задайте для параметра editor.experimentalScreenReader значение true.",
	"experimentalScreenReaderSessionOffNoKb": "Поддержка экспериментального средства чтения с экрана отключена. Команду {0} в настоящее время нельзя выполнить с помощью настраиваемого сочетания клавиш. Чтобы включить поддержку для всех сеансов, задайте для параметра editor.experimentalScreenReader значение true.",
	"experimentalScreenReaderSessionOn": "Поддержка экспериментального средства чтения с экрана включена для этого сеанса. Чтобы отключить или снова включить ее, нажмите клавишу {0}.",
	"experimentalScreenReaderSessionOnNoKb": "Поддержка экспериментального средства чтения с экрана включена для этого сеанса. Команду {0} в настоящее время нельзя выполнить с помощью настраиваемого сочетания клавиш.",
	"introMsg": "Благодарим за ознакомление с экспериментальными специальными возможностями VS Code.",
	"outroMsg": "Вы можете закрыть эту подсказку и вернуться в редактор, нажав клавишу ESCAPE.",
	"status": "Состояние:",
	"tabFocusModeOffMsg": "При нажатии клавиши TAB в этом редакторе будет вставлен символ табуляции. Чтобы изменить это поведение, нажмите клавишу {0}.",
	"tabFocusModeOffMsgNoKb": "При нажатии клавиши TAB в этом редакторе фокус ввода переместится на следующий элемент, допускающий получение фокуса ввода. Команду {0} в настоящее время нельзя выполнить с помощью настраиваемого сочетания клавиш.",
	"tabFocusModeOnMsg": "При нажатии клавиши TAB в этом редакторе фокус ввода переместится на следующий элемент, допускающий получение фокуса ввода. Чтобы изменить это поведение, нажмите клавишу {0}.",
	"tabFocusModeOnMsgNoKb": "При нажатии клавиши TAB в этом редакторе фокус ввода переместится на следующий элемент, допускающий получение фокуса ввода. Команду {0} в настоящее время нельзя выполнить с помощью настраиваемого сочетания клавиш."
}