/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"lineHighlight": "Colore di sfondo per l'evidenziazione della riga alla posizione del cursore.",
	"lineHighlightBorderBox": "Colore di sfondo per il bordo intorno alla riga alla posizione del cursore.",
	"rangeHighlight": "Colore di sfondo degli intervalli evidenziati, ad esempio dalle funzionalità Quick Open e Trova.",
	"caret": "Colore del cursore dell'editor.",
	"editorCursorBackground": "Colore di sfondo del cursore editor. Permette di personalizzare il colore di un carattere quando sovrapposto da un blocco cursore.",
	"editorWhitespaces": "Colore dei caratteri di spazio vuoto nell'editor.",
	"editorIndentGuides": "Colore delle guide per i rientri dell'editor.",
	"editorLineNumbers": "Colore dei numeri di riga dell'editor.",
	"editorRuler": "Colore dei righelli dell'editor.",
	"editorCodeLensForeground": "Colore primo piano delle finestre di CodeLens dell'editor",
	"editorBracketMatchBackground": "Colore di sfondo delle parentesi corrispondenti",
	"editorBracketMatchBorder": "Colore delle caselle di parentesi corrispondenti",
	"editorOverviewRulerBorder": "Colore del bordo del righello delle annotazioni.",
	"editorGutter": "Colore di sfondo della barra di navigazione dell'editor. La barra contiene i margini di glifo e i numeri di riga.",
	"errorForeground": "Colore primo piano degli squiggle di errore nell'editor.",
	"errorBorder": "Colore del bordo degli squiggle di errore nell'editor.",
	"warningForeground": "Colore primo piano degli squiggle di avviso nell'editor",
	"warningBorder": "Colore del bordo degli squggle di avviso nell'editor.",
	"overviewRulerRangeHighlight": "Colore del marcatore del righello delle annotazioni per le evidenziazioni degli intervalli.",
	"overviewRuleError": "Colore del marcatore del righello delle annotazioni per gli errori.",
	"overviewRuleWarning": "Colore del marcatore del righello delle annotazioni per gli avvisi.",
	"overviewRuleInfo": "Colore del marcatore del righello delle annotazioni per i messaggi di tipo informativo."
}