/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"LegacyProblemMatcherSchema.watchedBegin": "Expression régulière signalant qu'une tâche faisant l'objet d'un suivi commence à s'exécuter via le suivi d'un fichier.",
	"LegacyProblemMatcherSchema.watchedBegin.deprecated": "Cette propriété est déconseillée. Utilisez la propriété espion à la place.",
	"LegacyProblemMatcherSchema.watchedEnd": "Expression régulière signalant qu'une tâche faisant l'objet d'un suivi a fini de s'exécuter.",
	"LegacyProblemMatcherSchema.watchedEnd.deprecated": "Cette propriété est déconseillée. Utilisez la propriété espion à la place.",
	"NamedMultiLineProblemPatternSchema.name": "Nom du modèle de problème multiligne.",
	"NamedMultiLineProblemPatternSchema.patterns": "Modèles réels.",
	"NamedProblemMatcherSchema.name": "Nom du détecteur de problèmes de correspondance.",
	"NamedProblemPatternSchema.name": "Nom du modèle de problème.",
	"PatternTypeSchema.description": "Modèle de problème ou bien nom d'un modèle de problème faisant l'objet d'une contribution ou prédéfini. Peut être omis si base est spécifié.",
	"PatternTypeSchema.name": "Nom d'un modèle faisant l'objet d'une contribution ou prédéfini",
	"ProblemMatcherExtPoint": "Contribue aux détecteurs de problèmes de correspondance",
	"ProblemMatcherParser.invalidRegexp": "Erreur : la chaîne {0} est une expression régulière non valide.\n",
	"ProblemMatcherParser.noDefinedPatter": "Erreur : le modèle ayant pour identificateur {0} n'existe pas.",
	"ProblemMatcherParser.noFileLocation": "Erreur : la description ne définit pas un emplacement de fichier :\n{0}\n",
	"ProblemMatcherParser.noIdentifier": "Erreur : la propriété du modèle référence un identificateur vide.",
	"ProblemMatcherParser.noOwner": "Erreur : la description ne définit pas un propriétaire :\n{0}\n",
	"ProblemMatcherParser.noProblemMatcher": "Erreur : impossible de convertir la description en détecteur de problèmes de correspondance :\n{0}\n",
	"ProblemMatcherParser.noProblemPattern": "Erreur : la description ne définit pas un modèle de problème valide :\n{0}\n",
	"ProblemMatcherParser.noValidIdentifier": "Erreur : la propriété de modèle {0} n'est pas un nom de variable de modèle valide.",
	"ProblemMatcherParser.problemPattern.watchingMatcher": "Un détecteur de problèmes de correspondance doit définir un modèle de début et un modèle de fin à observer.",
	"ProblemMatcherParser.unknownSeverity": "Information : gravité inconnue {0}. Les valeurs valides sont erreur, avertissement et information.\n",
	"ProblemMatcherSchema.applyTo": "Contrôle si un problème signalé pour un document texte s'applique uniquement aux documents ouverts ou fermés, ou bien à l'ensemble des documents.",
	"ProblemMatcherSchema.base": "Nom d'un détecteur de problèmes de correspondance de base à utiliser.",
	"ProblemMatcherSchema.fileLocation": "Définit la façon dont les noms de fichiers signalés dans un modèle de problème doivent être interprétés.",
	"ProblemMatcherSchema.owner": "Propriétaire du problème dans Code. Peut être omis si base est spécifié. Prend la valeur 'external' par défaut en cas d'omission et si base n'est pas spécifié.",
	"ProblemMatcherSchema.severity": "Gravité par défaut des problèmes de capture. Est utilisé si le modèle ne définit aucun groupe de correspondance pour la gravité.",
	"ProblemMatcherSchema.watching": "Modèles de suivi du début et de la fin d'un modèle espion.",
	"ProblemMatcherSchema.watching.activeOnStart": "Si la valeur est true, le mode espion est actif au démarrage de la tâche. Cela revient à émettre une ligne qui correspond à beginPattern",
	"ProblemMatcherSchema.watching.beginsPattern": "En cas de correspondance dans la sortie, le début d'une tâche de suivi est signalé.",
	"ProblemMatcherSchema.watching.endsPattern": "En cas de correspondance dans la sortie, la fin d'une tâche de suivi est signalée.",
	"ProblemPatternExtPoint": "Contribue aux modèles de problèmes",
	"ProblemPatternParser.invalidRegexp": "Erreur : la chaîne {0} est une expression régulière non valide.\n",
	"ProblemPatternParser.loopProperty.notLast": "La propriété loop est uniquement prise en charge dans le détecteur de problèmes de correspondance de dernière ligne.",
	"ProblemPatternParser.problemPattern.missingProperty": "Le modèle de problème est non valide. Il doit contenir au moins un groupe de correspondance pour un fichier, un message et une ligne ou un emplacement.",
	"ProblemPatternParser.problemPattern.missingRegExp": "Il manque une expression régulière dans le modèle de problème.",
	"ProblemPatternRegistry.error": "Modèle de problème non valide. Le modèle va être ignoré.",
	"ProblemPatternSchema.code": "Index de groupe de correspondance du code du problème. La valeur par défaut est non définie",
	"ProblemPatternSchema.column": "Index de groupe de correspondance du caractère de ligne du problème. La valeur par défaut est 3",
	"ProblemPatternSchema.endColumn": "Index de groupe de correspondance du caractère de ligne de fin du problème. La valeur par défaut est non définie",
	"ProblemPatternSchema.endLine": "Index de groupe de correspondance de la ligne de fin du problème. La valeur par défaut est non définie",
	"ProblemPatternSchema.file": "Index de groupe de correspondance du nom de fichier. En cas d'omission, 1 est utilisé.",
	"ProblemPatternSchema.line": "Index de groupe de correspondance de la ligne du problème. La valeur par défaut est 2",
	"ProblemPatternSchema.location": "Index de groupe de correspondance de l'emplacement du problème. Les modèles d'emplacement valides sont : (line), (line,column) et (startLine,startColumn,endLine,endColumn). En cas d'omission, (line,column) est choisi par défaut.",
	"ProblemPatternSchema.loop": "Dans une boucle de détecteur de problèmes de correspondance multiligne, indique si le modèle est exécuté en boucle tant qu'il correspond. Peut uniquement être spécifié dans le dernier modèle d'un modèle multiligne.",
	"ProblemPatternSchema.message": "Index de groupe de correspondance du message. En cas d'omission, la valeur par défaut est 4 si l'emplacement est spécifié. Sinon, la valeur par défaut est 5.",
	"ProblemPatternSchema.regexp": "Expression régulière permettant de trouver une erreur, un avertissement ou une information dans la sortie.",
	"ProblemPatternSchema.severity": "Index de groupe de correspondance de la gravité du problème. La valeur par défaut est non définie",
	"WatchingPatternSchema.file": "Index de groupe de correspondance du nom de fichier. Peut être omis.",
	"WatchingPatternSchema.regexp": "Expression régulière permettant de détecter le début ou la fin d'une tâche de suivi."
}