/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"ShowAccessibilityHelpAction": "Afficher l'aide sur l'accessibilité",
	"experimentalScreenReaderOptsOn": "La prise en charge du lecteur d'écran expérimental est activée en raison de la clé de paramètres editor.experimentalScreenReader.",
	"experimentalScreenReaderSessionOff": "La prise en charge du lecteur d'écran expérimental est désactivée. Activez-la pour cette session en appuyant sur {0}, ou activez-la pour toutes les sessions en affectant au paramètre editor.experimentalScreenReader la valeur true.",
	"experimentalScreenReaderSessionOffNoKb": "La prise en charge du lecteur d'écran expérimental est désactivée. Actuellement, la commande {0} ne peut pas être déclenchée par une combinaison de touches. Activez-la pour toutes les sessions en affectant au paramètre editor.experimentalScreenReader la valeur true.",
	"experimentalScreenReaderSessionOn": "La prise en charge du lecteur d'écran expérimental est activée pour cette session. Activez ou désactivez ce comportement en appuyant sur {0}.",
	"experimentalScreenReaderSessionOnNoKb": "La prise en charge du lecteur d'écran expérimental est activée pour cette session. Actuellement, la commande {0} ne peut pas être déclenchée par une combinaison de touches.",
	"introMsg": "Merci de tester les options d'accessibilité expérimentales de VS Code.",
	"outroMsg": "Vous pouvez masquer cette info-bulle et revenir à l'éditeur en appuyant sur Échap.",
	"status": "État :",
	"tabFocusModeOffMsg": "Appuyez sur Tab dans cet éditeur pour insérer le caractère de tabulation. Activez ou désactivez ce comportement en appuyant sur {0}.",
	"tabFocusModeOffMsgNoKb": "Appuyez sur Tab dans cet éditeur pour déplacer le focus vers le prochain élément pouvant être désigné comme élément actif. Actuellement, la commande {0} ne peut pas être déclenchée par une combinaison de touches.",
	"tabFocusModeOnMsg": "Appuyez sur Tab dans cet éditeur pour déplacer le focus vers le prochain élément pouvant être désigné comme élément actif. Activez ou désactivez ce comportement en appuyant sur {0}.",
	"tabFocusModeOnMsgNoKb": "Appuyez sur Tab dans cet éditeur pour déplacer le focus vers le prochain élément pouvant être désigné comme élément actif. Actuellement, la commande {0} ne peut pas être déclenchée par une combinaison de touches."
}