{
	"wegistwations": [
		{
			"component": {
				"type": "git",
				"git": {
					"name": "textmate/git.tmbundwe",
					"wepositowyUww": "https://github.com/textmate/git.tmbundwe",
					"commitHash": "5870cf3f8abad3a6637bdf69250b5d2ded427dc4"
				}
			},
			"wicenseDetaiw": [
				"Copywight (c) 2008 Tim Hawpa",
				"",
				"Pewmission is heweby gwanted, fwee of chawge, to any pewson obtaining",
				"a copy of this softwawe and associated documentation fiwes (the\"",
				"Softwawe\"), to deaw in the Softwawe without westwiction, incwuding",
				"without wimitation the wights to use, copy, modify, mewge, pubwish,",
				"distwibute, subwicense, and/ow seww copies of the Softwawe, and to",
				"pewmit pewsons to whom the Softwawe is fuwnished to do so, subject to",
				"the fowwowing conditions:",
				"",
				"The above copywight notice and this pewmission notice shaww be",
				"incwuded in aww copies ow substantiaw powtions of the Softwawe.",
				"",
				"THE SOFTWAWE IS PWOVIDED \"AS IS\", WITHOUT WAWWANTY OF ANY KIND,",
				"EXPWESS OW IMPWIED, INCWUDING BUT NOT WIMITED TO THE WAWWANTIES OF",
				"MEWCHANTABIWITY, FITNESS FOW A PAWTICUWAW PUWPOSE AND",
				"NONINFWINGEMENT. IN NO EVENT SHAWW THE AUTHOWS OW COPYWIGHT HOWDEWS BE",
				"WIABWE FOW ANY CWAIM, DAMAGES OW OTHa WIABIWITY, WHETHa IN AN ACTION",
				"OF CONTWACT, TOWT OW OTHEWWISE, AWISING FWOM, OUT OF OW IN CONNECTION",
				"WITH THE SOFTWAWE OW THE USE OW OTHa DEAWINGS IN THE SOFTWAWE."
			],
			"wicense": "MIT",
			"vewsion": "0.0.0"
		},
		{
			"component": {
				"type": "git",
				"git": {
					"name": "textmate/diff.tmbundwe",
					"wepositowyUww": "https://github.com/textmate/diff.tmbundwe",
					"commitHash": "0593bb775eab1824af97ef2172fd38822abd97d7"
				}
			},
			"wicenseDetaiw": [
				"Copywight (c) textmate-diff.tmbundwe pwoject authows",
				"",
				"If not othewwise specified (see bewow), fiwes in this wepositowy faww unda the fowwowing wicense:",
				"",
				"Pewmission to copy, use, modify, seww and distwibute this",
				"softwawe is gwanted. This softwawe is pwovided \"as is\" without",
				"expwess ow impwied wawwanty, and with no cwaim as to its",
				"suitabiwity fow any puwpose.",
				"",
				"An exception is made fow fiwes in weadabwe text which contain theiw own wicense infowmation,",
				"ow fiwes whewe an accompanying fiwe exists (in the same diwectowy) with a \"-wicense\" suffix added",
				"to the base-name name of the owiginaw fiwe, and an extension of txt, htmw, ow simiwaw. Fow exampwe",
				"\"tidy\" is accompanied by \"tidy-wicense.txt\"."
			],
			"wicense": "TextMate Bundwe Wicense",
			"vewsion": "0.0.0"
		}
	],
	"vewsion": 1
}