/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"status.400": "Solicitud incorrecta. La solicitud no se puede rellenar porque la sintaxis es incorrecta.",
	"status.401": "No autorizado. El servidor rechaza responder.",
	"status.403": "Prohibido. El servidor rechaza responder.",
	"status.404": "No encontrado. La ubicación solicitada no se encontró.",
	"status.405": "Método no permitido. Se realizó una solicitud mediante un método no admitido en esa ubicación.",
	"status.406": "No aceptable. El servidor solo puede generar una respuesta que el cliente no acepta.",
	"status.407": "Se requiere autenticación del proxy. El cliente debe autenticarse primero en el servidor proxy.",
	"status.408": "Tiempo de espera de la solicitud. El servidor ha agotado el tiempo de espera para la solicitud.",
	"status.409": "Conflicto. La solicitud no se pudo completar porque presenta un conflicto.",
	"status.410": "Desaparecido. La página solicitada ya no está disponible.",
	"status.411": "Longitud requerida. La longitud del contenido no se ha definido.",
	"status.412": "Error de condición previa. El servidor evaluó como \"false\" la precondición dada en la solicitud.",
	"status.413": "Entidad de solicitud demasiado grande. El servidor no acepta la solicitud porque la entidad correspondiente es demasiado grande.",
	"status.414": "URI de solicitud demasiado grande. El servidor no acepta la solicitud porque la dirección URL es demasiado grande.",
	"status.415": "Tipo de medio no compatible. El servidor no acepta la solicitud porque el tipo de medio no es compatible.",
	"status.416": "Código de estado HTTP {0}",
	"status.500": "Error interno del servidor.",
	"status.501": "Sin implementar. El servidor no reconoce el método de solicitud o no tiene la capacidad de completar la solicitud.",
	"status.503": "Servicio no disponible. El servidor no está disponible en este momento (está sobrecargado o fuera de servicio)."
}