{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"previewOnGitHub": "Visualizar en GitHub",
	"loadingData": "Cargando datos...",
	"similarIssues": "Problemas similares",
	"open": "Abrir",
	"closed": "Cerrado",
	"noResults": "No se encontraron resultados",
	"settingsSearchIssue": "Problema de búsqueda de configuración",
	"bugReporter": "Informe de errores",
	"featureRequest": "Solicitud de característica",
	"performanceIssue": "Problema de rendimiento",
	"stepsToReproduce": "Pasos para reproducir",
	"bugDescription": "Indique los pasos necesarios para reproducir el problema. Debe incluir el resultado real y el resultado esperado. Admitimos Markdown al estilo de GitHub. Podrá editar el problema y agregar capturas de pantalla cuando veamos una vista previa en GitHub.",
	"performanceIssueDesciption": "¿Cuándo ocurrió este problema de rendimiento? ¿Se produce al inicio o después de realizar una serie específica de acciones? Admitimos Markdown al estilo de GitHub. Podrá editar el problema y agregar capturas de pantalla cuando veamos una vista previa en GitHub.",
	"description": "Descripción",
	"featureRequestDescription": "Describa la característica que le gustaría ver. Admitimos Markdown al estilo de GitHub. Podrá editar esta información y agregar capturas de pantalla cuando veamos una vista previa en GitHub.",
	"expectedResults": "Resultados esperados",
	"settingsSearchResultsDescription": "Indique los resultados que esperaba encontrar cuando usó esta consulta para la búsqueda. Admitimos Markdown al estilo de GitHub. Podrá editar el problema y agregar capturas de pantalla cuando veamos una vista previa en GitHub.",
	"pasteData": "Hemos escrito los datos necesarios en su Portapapeles porque eran demasiado grandes para enviarlos. Ahora debe pegarlos.",
	"disabledExtensions": "Las extensiones están deshabilitadas"
}