// Listing in here platform dependencies that come in at build time

[{
	"name": "atom-brightray",
	"repositoryURL": "https://github.com/atom/brightray",
	"license": "MIT",
	"isProd": true
},
{
	"name": "chromium",
	"version": "45.0.2454.85",
	"repositoryURL": "http://www.chromium.org/Home",
	"licenseDetail": [
		"BSD License",
		"",
		"Copyright 2014 The Chromium Authors. All rights reserved.",
		"",
		"Redistribution and use in source and binary forms, with or without modification,",
		"are permitted provided that the following conditions are met:",
		"",
		" * Redistributions of source code must retain the above copyright notice, this",
		"   list of conditions and the following disclaimer.",
		"",
		" * Redistributions in binary form must reproduce the above copyright notice,",
		"   this list of conditions and the following disclaimer in the documentation",
		"   and/or other materials provided with the distribution.",
		"",
		" * Neither the name Google Inc. nor the names of its contributors may be used to",
		"   endorse or promote products derived from this software without specific",
		"   prior written permission.",
		"",
		"THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND",
		"ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED",
		"WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE",
		"DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR",
		"ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES",
		"(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;",
		"LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON",
		"ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT",
		"(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS",
		"SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
	],
	"isProd": true
},
{
	"name": "libchromiumcontent",
	"version": "45.0.2454.85 ",
	"license": "MIT",
	"repositoryURL": "https://github.com/atom/libchromiumcontent",
	"isProd": true
},
{
	"name": "nodejs",
	"version": "4.1.1",
	"repositoryURL": "https://github.com/nodejs/node",
	"isProd": true
},
{
	"name": "electron",
	"version": "0.35.6",
	"license": "MIT",
	"repositoryURL": "https://github.com/atom/electron",
	"isProd": true
},
{
	"name": "inno setup",
	"version": "5.5.6",
	"repositoryURL": "https://github.com/jrsoftware/issrc",
	"isProd": true
},


// ----------------------------------------------------------
// The following definitions are here for the sole purpose of
// defining licenses for dependencies where licensing cannot
// be inferred by tooling:

{
	// Reason: LICENSE file missing in repo
	// SOURCE: https://github.com/isaacs/core-util-is/blob/master/lib/util.js
	"name":"core-util-is",
	"isLicense": true,
	"licenseDetail": [
		"Copyright Joyent, Inc. and other Node contributors.",
		"",
		"Permission is hereby granted, free of charge, to any person obtaining a",
		"copy of this software and associated documentation files (the",
		"\"Software\"), to deal in the Software without restriction, including",
		"without limitation the rights to use, copy, modify, merge, publish,",
		"distribute, sublicense, and/or sell copies of the Software, and to permit",
		"persons to whom the Software is furnished to do so, subject to the",
		"following conditions:",
		"",
		"The above copyright notice and this permission notice shall be included",
		"in all copies or substantial portions of the Software.",
		"",
		"THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS",
		"OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF",
		"MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN",
		"NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,",
		"DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR",
		"OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE",
		"USE OR OTHER DEALINGS IN THE SOFTWARE."
	]
},
{
	// Reason: windows-mutex is not public yet
	// TODO: Remove once windows-mutex visibility is made public
	"name": "windows-mutex",
	"isLicense": true,
	"licenseDetail": [
		"The MIT License (MIT)",
		"",
		"Copyright (c) Microsoft Corporation",
		"",
		"Permission is hereby granted, free of charge, to any person obtaining a copy",
		"of this software and associated documentation files (the \"Software\"), to deal",
		"in the Software without restriction, including without limitation the rights",
		"to use, copy, modify, merge, publish, distribute, sublicense, and/or sell",
		"copies of the Software, and to permit persons to whom the Software is",
		"furnished to do so, subject to the following conditions:",
		"",
		"The above copyright notice and this permission notice shall be included in all",
		"copies or substantial portions of the Software.",
		"",
		"THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR",
		"IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,",
		"FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE",
		"AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER",
		"LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,",
		"OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE",
		"SOFTWARE."
	]
},
{
	// Reason: LICENSE file missing in repo
	"name": "winreg",
	"isLicense": true,
	"licenseDetail": [
		"Copyright (c) Paul Bottin",
		"",
		"The BSD License",
		"",
		"Redistribution and use in source and binary forms, with or without",
		"modification, are permitted provided that the following conditions",
		"are met:",
		"",
		"1. Redistributions of source code must retain the above copyright",
		"   notice, this list of conditions and the following disclaimer.",
		"",
		"2. Redistributions in binary form must reproduce the above copyright",
		"   notice, this list of conditions and the following disclaimer in the",
		"   documentation and/or other materials provided with the distribution.",
		"",
		"THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND",
		"ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE",
		"IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR",
		"PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS",
		"BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR",
		"CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF",
		"SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR",
		"BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,",
		"WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE",
		"OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN",
		"IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
	]
},
{
	// Reason: LICENSE file doesn't have Copyright statement
	"name": "readdirp",
	"isLicense": true,
	"licenseDetail": [
		"This software is released under the MIT license:",
		"",
		"Copyright (c) Thorsten Lorenz",
		"",
		"Permission is hereby granted, free of charge, to any person obtaining a copy of",
		"this software and associated documentation files (the \"Software\"), to deal in",
		"the Software without restriction, including without limitation the rights to",
		"use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of",
		"the Software, and to permit persons to whom the Software is furnished to do so,",
		"subject to the following conditions:",
		"",
		"The above copyright notice and this permission notice shall be included in all",
		"copies or substantial portions of the Software.",
		"",
		"THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR",
		"IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS",
		"FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR",
		"COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER",
		"IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN",
		"CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
	]
}]
