/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"vscode.extension.engines.vscode": "Eklentinin uyumlu olduğu VS Code sürümünü belirten VS Code eklentileri için. * olamaz. Örneğin: ^0.10.5 uyumlu olduğu minimum VS Code sürümünün 0.10.5 olduğunu gösterir.",
	"vscode.extension.publisher": "VS Code eklentisinin yayıncısı.",
	"vscode.extension.displayName": "VS Code galerisinde kullanılan eklentinin görünen adı.",
	"vscode.extension.categories": "Bu eklentiyi kategorize etmek için VS Code galerisi tarafından kullanılan kategoriler.",
	"vscode.extension.galleryBanner": "VS Code markette kullanılan afiş.",
	"vscode.extension.galleryBanner.color": "VS Code marketteki sayfa başlığındaki afiş rengi.",
	"vscode.extension.galleryBanner.theme": "Afişte kullanılan yazı tipi için renk teması.",
	"vscode.extension.contributes": "Bu paketin temsil ettiği VS Code eklentisinin tüm katkıları.",
	"vscode.extension.preview": "Markette eklentinin Önizleme olarak işaretlenmesini sağlar.",
	"vscode.extension.activationEvents": "VS Code eklentisi için etkinleştirme olayları.",
	"vscode.extension.activationEvents.onLanguage": "Belirtilen dilde çözümlenen bir dosya her açıldığında bir etkinleştirme olayı yayınlanır.",
	"vscode.extension.activationEvents.onCommand": "Belirtilen komut her çağrıldığında bir etkinleştirme olayı yayınlanır.",
	"vscode.extension.activationEvents.onDebug": "Belirtilen türde bir hata ayıklama oturumu her başladığında bir etkinleştirme olayı yayınlanır.",
	"vscode.extension.activationEvents.workspaceContains": "Belirtilen glob deseni ile eşleşen en az bir dosya içeren bir klasör her açıldığında bir etkinleştirme olayı yayınlanır.",
	"vscode.extension.activationEvents.onView": "Belirtilen görünüm her genişletildiğinde bir etkinleştirme olayı yayınlanır.",
	"vscode.extension.activationEvents.star": "VS Code başlatıldığında yayılan etkinleştirme olayı. Mükemmel bir son kullanıcı deneyimi sağlandığından emin olmak için, lütfen bu etkinleştirme olayını eklentinizde sadece kullanım durumunuzda başka hiçbir aktivasyon olayı kombinasyonu çalışmıyorsa kullanın.",
	"vscode.extension.badges": "Marketin eklenti sayfasının kenar çubuğunda görüntülenecek göstergeler dizisi.",
	"vscode.extension.badges.url": "Gösterge resmi URL'si.",
	"vscode.extension.badges.href": "Gösterge bağlantısı.",
	"vscode.extension.badges.description": "Gösterge açıklaması.",
	"vscode.extension.extensionDependencies": "Diğer uzantılara bağımlılıklar. Bir uzantının tanımlayıcısı her zaman ${publisher}.${name} biçimindedir. Örneğin: vscode.csharp.",
	"vscode.extension.scripts.prepublish": "Paket, bir VS Code eklentisi olarak yayımlamadan önce çalıştırılacak betik.",
	"vscode.extension.icon": "128x128 piksellik bir simgenin yolu."
}