/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"markdown.preview.breaks.desc": "Configura como quebras de linha são processadas na visualização de markdown. Configurando como 'true' cria um <br> para cada nova linha.",
	"markdown.preview.linkify": "Habilitar ou desabilitar a conversão de texto URL para links na visualização markdown.",
	"markdown.preview.doubleClickToSwitchToEditor.desc": "Duplo clique na pré-visualização markdown para alternar para o editor.",
	"markdown.preview.fontFamily.desc": "Controla a família de fonte usada na pré-visualização de markdown.",
	"markdown.preview.fontSize.desc": "Controla o tamanho da fonte em pixels usado na pré-visualização de markdown.",
	"markdown.preview.lineHeight.desc": "Controla a altura de linha usada na pré-visualização de markdown. Este número é relativo ao tamanho de fonte.",
	"markdown.preview.markEditorSelection.desc": "Marca a seleção atual do editor na pré-visualização de markdown.",
	"markdown.preview.scrollEditorWithPreview.desc": "Quando a pré-visualização de markdown é rolada, atualiza a exibição do editor.",
	"markdown.preview.scrollPreviewWithEditorSelection.desc": "Rola a pré-visualização do markdown para revelar a linha atualmente selecionada do editor.",
	"markdown.preview.title": "Abrir a visualização",
	"markdown.previewFrontMatter.dec": "Configura como o frontispicio YAML frente questão devem ser processado na pré-visualização de markdown. 'hide' remove o frontispicio. Caso contrário, o frontispicio é tratado como conteúdo de markdown.",
	"markdown.previewSide.title": "Abre pré-visualização ao lado",
	"markdown.showSource.title": "Exibir Código-Fonte",
	"markdown.styles.dec": "Uma lista de URLs ou caminhos locais para folhas de estilo CSS para usar na pré-visualização do markdown. Caminhos relativos são interpretados em relação à pasta aberta no explorer. Se não houver nenhuma pasta aberta, eles são interpretados em relação ao local do arquivo markdown. Todos os ' \\' precisam ser escritos como ' \\ \\ '.",
	"markdown.showPreviewSecuritySelector.title": "Alterar as configurações de segurança de visualização",
	"markdown.trace.desc": "Habilitar log de depuração para a extensão do markdown.",
	"markdown.refreshPreview.title": "Atualizar a visualização"
}