/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"status.400": "Ungültige Anforderung. Die Anforderung kann aufgrund falscher Syntax nicht erfüllt werden.",
	"status.401": "Nicht autorisiert. Der Server verweigert die Antwort.",
	"status.403": "Unzulässig. Der Server verweigert die Antwort.",
	"status.404": "Nicht gefunden. Der angeforderte Speicherort wurde nicht gefunden.",
	"status.405": "Die Methode ist unzulässig. Eine Anforderung wurde mithilfe einer Anforderungsmethode ausgeführt, die von diesem Speicherort nicht unterstützt wird.",
	"status.406": "Nicht annehmbar. Der Server kann nur eine Antwort generieren, die nicht vom Client angenommen wird.",
	"status.407": "Proxyauthentifizierung ist erforderlich. Der Client muss zuerst die Authentifizierung mit dem Proxy ausführen.",
	"status.408": "Anforderungstimeout. Timeout des Servers beim Warten auf die Anforderung.",
	"status.409": "Konflikt. Die Anforderung konnte aufgrund eines Konflikts in der Anforderung nicht abgeschlossen werden.",
	"status.410": "Nicht mehr verfügbar. Die angeforderte Seite steht nicht mehr zur Verfügung.",
	"status.411": "Die Länge ist erforderlich. \"Content-Length\" ist nicht definiert.",
	"status.412": "Fehler bei der Vorbedingung. Die in der Anforderung angegebene Vorbedingung wurde vom Server in \"false\" ausgewertet.",
	"status.413": "Anforderungsentität zu groß. Der Server nimmt die Anforderung nicht an, weil die Anforderungsentität zu groß ist.",
	"status.414": "Anforderungs-URI zu lang. Der Server nimmt die Anforderung nicht an, weil die URL zu lang ist.",
	"status.415": "Nicht unterstützter Medientyp. Der Server nimmt die Anforderung nicht an, weil der Medientyp nicht unterstützt wird.",
	"status.416": "HTTP-Statuscode {0}",
	"status.500": "Interner Serverfehler.",
	"status.501": "Nicht implementiert. Der Server erkennt die Anforderungsmethode nicht, oder er kann die Anforderung nicht erfüllen.",
	"status.503": "Dienst nicht verfügbar. Der Server ist zurzeit nicht verfügbar (überlastet oder nicht verfügbar)."
}