/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"html.format.enable.desc": "Standard-HTML-Formatierer aktivieren/deaktivieren (Neustart erforderlich)",
	"html.format.endWithNewline.desc": "Endet mit einer neuen Zeile.",
	"html.format.extraLiners.desc": "Die Liste der Tags (durch Kommas getrennt), vor denen eine zusätzliche neue Zeile eingefügt werden soll. \"null\" verwendet standardmäßig \"head, body, /HTML\".",
	"html.format.indentHandlebars.desc": "Formatiert {{#foo}} und {{/foo}} und nimmt einen Einzug vor.",
	"html.format.indentInnerHtml.desc": "Nimmt einen Einzug für <head>- und <body>-Abschnitte vor.",
	"html.format.maxPreserveNewLines.desc": "Die maximale Anzahl von Zeilenumbrüchen, die in einem Block beibehalten werden soll. Verwenden Sie \"null\" für eine unbegrenzte Anzahl.",
	"html.format.preserveNewLines.desc": "Gibt an, ob vorhandene Zeilenumbrüche vor Elemente beibehalten werden sollen. Funktioniert nur vor Elementen, nicht in Tags oder für Text.",
	"html.format.unformatted.desc": "Die Liste der Tags (durch Kommas getrennt), die nicht erneut formatiert werden sollen. \"null\" bezieht sich standardmäßig auf alle Tags, die unter https://www.w3.org/TR/html5/dom.html#phrasing-content aufgeführt werden.",
	"html.format.wrapAttributes.auto": "Attribute nur dann umschließen, wenn die Zeilenlänge überschritten wird.",
	"html.format.wrapAttributes.desc": "Attribute umschließen.",
	"html.format.wrapAttributes.force": "Jedes Attribut mit Ausnahme des ersten umschließen.",
	"html.format.wrapAttributes.forcealign": "Jedes Attribut mit Ausnahme des ersten umschließen und Ausrichtung beibehalten.",
	"html.format.wrapAttributes.forcemultiline": "Jedes Attribut umschließen.",
	"html.format.wrapLineLength.desc": "Die maximale Anzahl von Zeichen pro Zeile (0 = deaktiviert).",
	"html.suggest.angular1.desc": "Konfiguriert, ob die integrierte HTML-Sprachuntersützung Angular V1-Tags und -Eigenschaften vorschlägt.",
	"html.suggest.html5.desc": "Konfiguriert, ob die integrierte HTML-Sprachuntersützung HTML5-Tags, -Eigenschaften und -Werte vorschlägt.",
	"html.suggest.ionic.desc": "Konfiguriert, ob die integrierte HTML-Sprachuntersützung Ionic-Tags, -Eigenschaften und -Werte vorschlägt.",
	"html.validate.scripts": "Konfiguriert, ob die integrierte HTML-Sprachunterstützung eingebettete Skripts unterstützt.",
	"html.validate.styles": "Konfiguriert, ob die integrierte HTML-Sprachunterstützung eingebettete Skripts validiert."
}