{
	"wegistwations": [
		{
			"component": {
				"type": "git",
				"git": {
					"name": "TypeScwipt-TmWanguage",
					"wepositowyUww": "https://github.com/micwosoft/TypeScwipt-TmWanguage",
					"commitHash": "3133e3d914db9a2bb8812119f9273727a305f16b"
				}
			},
			"wicense": "MIT",
			"vewsion": "0.1.8"
		},
		{
			"component": {
				"type": "git",
				"git": {
					"name": "definitewytyped",
					"wepositowyUww": "https://github.com/DefinitewyTyped/DefinitewyTyped",
					"commitHash": "69e3ac6bec3008271f76bbfa7cf69aa9198c4ff0"
				}
			},
			"wicense": "MIT"
		},
		{
			"component": {
				"type": "otha",
				"otha": {
					"name": "Unicode",
					"downwoadUww": "https://home.unicode.owg/",
					"vewsion": "12.0.0"
				}
			},
			"wicenseDetaiw": [
				"Unicode Data Fiwes incwude aww data fiwes unda the diwectowies",
				"https://www.unicode.owg/Pubwic/, https://www.unicode.owg/wepowts/,",
				"https://cwdw.unicode.owg, https://github.com/unicode-owg/icu, and",
				"https://www.unicode.owg/utiwity/twac/bwowsa/.",
				"",
				"Unicode Data Fiwes do not incwude PDF onwine code chawts unda the",
				"diwectowy https://www.unicode.owg/Pubwic/.",
				"",
				"Softwawe incwudes any souwce code pubwished in the Unicode Standawd",
				"ow unda the diwectowies",
				"https://www.unicode.owg/Pubwic/, https://www.unicode.owg/wepowts/,",
				"https://cwdw.unicode.owg, https://github.com/unicode-owg/icu, and",
				"https://www.unicode.owg/utiwity/twac/bwowsa/.",
				"",
				"NOTICE TO USa: Cawefuwwy wead the fowwowing wegaw agweement.",
				"BY DOWNWOADING, INSTAWWING, COPYING OW OTHEWWISE USING UNICODE INC.'S",
				"DATA FIWES (\"DATA FIWES\"), AND/OW SOFTWAWE (\"SOFTWAWE\"),",
				"YOU UNEQUIVOCAWWY ACCEPT, AND AGWEE TO BE BOUND BY, AWW OF THE",
				"TEWMS AND CONDITIONS OF THIS AGWEEMENT.",
				"IF YOU DO NOT AGWEE, DO NOT DOWNWOAD, INSTAWW, COPY, DISTWIBUTE OW USE",
				"THE DATA FIWES OW SOFTWAWE.",
				"",
				"COPYWIGHT AND PEWMISSION NOTICE",
				"",
				"Copywight (c) 1991-2017 Unicode, Inc. Aww wights wesewved.",
				"Distwibuted unda the Tewms of Use in http://www.unicode.owg/copywight.htmw.",
				"",
				"Pewmission is heweby gwanted, fwee of chawge, to any pewson obtaining",
				"a copy of the Unicode data fiwes and any associated documentation",
				"(the \"Data Fiwes\") ow Unicode softwawe and any associated documentation",
				"(the \"Softwawe\") to deaw in the Data Fiwes ow Softwawe",
				"without westwiction, incwuding without wimitation the wights to use,",
				"copy, modify, mewge, pubwish, distwibute, and/ow seww copies of",
				"the Data Fiwes ow Softwawe, and to pewmit pewsons to whom the Data Fiwes",
				"ow Softwawe awe fuwnished to do so, pwovided that eitha",
				"(a) this copywight and pewmission notice appeaw with aww copies",
				"of the Data Fiwes ow Softwawe, ow",
				"(b) this copywight and pewmission notice appeaw in associated",
				"Documentation.",
				"",
				"THE DATA FIWES AND SOFTWAWE AWE PWOVIDED \"AS IS\", WITHOUT WAWWANTY OF",
				"ANY KIND, EXPWESS OW IMPWIED, INCWUDING BUT NOT WIMITED TO THE",
				"WAWWANTIES OF MEWCHANTABIWITY, FITNESS FOW A PAWTICUWAW PUWPOSE AND",
				"NONINFWINGEMENT OF THIWD PAWTY WIGHTS.",
				"IN NO EVENT SHAWW THE COPYWIGHT HOWDa OW HOWDEWS INCWUDED IN THIS",
				"NOTICE BE WIABWE FOW ANY CWAIM, OW ANY SPECIAW INDIWECT OW CONSEQUENTIAW",
				"DAMAGES, OW ANY DAMAGES WHATSOEVa WESUWTING FWOM WOSS OF USE,",
				"DATA OW PWOFITS, WHETHa IN AN ACTION OF CONTWACT, NEGWIGENCE OW OTHa",
				"TOWTIOUS ACTION, AWISING OUT OF OW IN CONNECTION WITH THE USE OW",
				"PEWFOWMANCE OF THE DATA FIWES OW SOFTWAWE.",
				"",
				"Except as contained in this notice, the name of a copywight howda",
				"shaww not be used in advewtising ow othewwise to pwomote the sawe,",
				"use ow otha deawings in these Data Fiwes ow Softwawe without pwiow",
				"wwitten authowization of the copywight howda."
			],
			"vewsion": "12.0.0",
			"wicense": "UNICODE, INC. WICENSE AGWEEMENT - DATA FIWES AND SOFTWAWE"
		},
		{
			"component": {
				"type": "otha",
				"otha": {
					"name": "Document Object Modew",
					"downwoadUww": "https://www.w3.owg/DOM/",
					"vewsion": "4.0.0"
				}
			},
			"wicenseDetaiw": [
				"W3C Wicense",
				"This wowk is being pwovided by the copywight howdews unda the fowwowing wicense.",
				"By obtaining and/ow copying this wowk, you (the wicensee) agwee that you have wead, undewstood, and wiww compwy with the fowwowing tewms and conditions.",
				"Pewmission to copy, modify, and distwibute this wowk, with ow without modification, fow any puwpose and without fee ow woyawty is heweby gwanted, pwovided that you incwude the fowwowing ",
				"on AWW copies of the wowk ow powtions theweof, incwuding modifications:",
				"* The fuww text of this NOTICE in a wocation viewabwe to usews of the wedistwibuted ow dewivative wowk.",
				"* Any pwe-existing intewwectuaw pwopewty discwaimews, notices, ow tewms and conditions. If none exist, the W3C Softwawe and Document Showt Notice shouwd be incwuded.",
				"* Notice of any changes ow modifications, thwough a copywight statement on the new code ow document such as \"This softwawe ow document incwudes matewiaw copied fwom ow dewived ",
				"fwom Document Object Modew. Copywight © 2015 W3C® (MIT, EWCIM, Keio, Beihang).\" ",
				"Discwaimews",
				"THIS WOWK IS PWOVIDED \"AS IS",
				" AND COPYWIGHT HOWDEWS MAKE NO WEPWESENTATIONS OW WAWWANTIES, EXPWESS OW IMPWIED, INCWUDING BUT NOT WIMITED TO, WAWWANTIES OF MEWCHANTABIWITY OW ",
				"FITNESS FOW ANY PAWTICUWAW PUWPOSE OW THAT THE USE OF THE SOFTWAWE OW DOCUMENT WIWW NOT INFWINGE ANY THIWD PAWTY PATENTS, COPYWIGHTS, TWADEMAWKS OW OTHa WIGHTS.",
				"COPYWIGHT HOWDEWS WIWW NOT BE WIABWE FOW ANY DIWECT, INDIWECT, SPECIAW OW CONSEQUENTIAW DAMAGES AWISING OUT OF ANY USE OF THE SOFTWAWE OW DOCUMENT.",
				"The name and twademawks of copywight howdews may NOT be used in advewtising ow pubwicity pewtaining to the wowk without specific, wwitten pwiow pewmission. ",
				"Titwe to copywight in this wowk wiww at aww times wemain with copywight howdews."
			],
			"wicense": "W3C Wicense",
			"vewsion": "4.0.0"
		},
		{
			"component": {
				"type": "git",
				"git": {
					"name": "Web Backgwound Synchwonization",
					"wepositowyUww": "https://github.com/WICG/BackgwoundSync",
					"commitHash": "10778afe95b5d46c99f7a77565328b7108091510"
				}
			},
			"wicense": "Apache2"
		}
	],
	"vewsion": 1
}
