{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"previewOnGitHub": "Prévisualiser sur GitHub",
	"loadingData": "Chargement des données en cours...",
	"similarIssues": "Problèmes similaires",
	"open": "Ouvrir",
	"closed": "Fermé",
	"noResults": "Résultats introuvables",
	"settingsSearchIssue": "Problème de paramètres de recherche",
	"bugReporter": "Rapporteur de bogue",
	"performanceIssue": "Problème de performance",
	"featureRequest": "Demande de fonctionnalité",
	"stepsToReproduce": "Étapes à reproduire",
	"bugDescription": "Partagez les étapes nécessaires pour reproduire fidèlement le problème. Veuillez inclure les résultats réels et prévus. Nous prenons en charge la syntaxe GitHub Markdown. Vous pourrez éditer votre problème et ajouter des captures d'écran lorsque nous le prévisualiserons sur GitHub.",
	"performanceIssueDesciption": "Quand ce problème de performance s'est-il produit ? Se produit-il au démarrage ou après une série d'actions spécifiques ? Nous prenons en charge la syntaxe Markdown de GitHub. Vous pourrez éditer votre problème et ajouter des captures d'écran lorsque nous le prévisualiserons sur GitHub.",
	"description": "Description",
	"featureRequestDescription": "Veuillez décrire la fonctionnalité que vous voulez voir. Nous supportons la syntaxe GitHub Markdown. Vous pourrez modifier votre problème et ajouter des captures d’écran lorsque nous la prévisualiserons sur GitHub.",
	"expectedResults": "Résultats attendus",
	"settingsSearchResultsDescription": "Veuillez lister les résultats que vous vous attendiez à voir quand vous avez cherché cette requête. Nous supportons la syntaxe GitHub Markdown. Vous pourrez modifier votre question et ajouter des captures d’écran lorsque nous la prévisualiserons sur GitHub.",
	"urlLengthError": "Les données dépassent la longueur limite de {0} caractères. La longueur des données est {1}.",
	"disabledExtensions": "Les extensions sont désactivées"
}