/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"vscode.extension.engines.vscode": "Per le estensioni di Visual Studio Code consente di specificare la versione di Visual Studio Code con cui è compatibile l'estensione. Non può essere *. Ad esempio: ^0.10.5 indica la compatibilità con la versione minima 0.10.5 di Visual Studio Code.",
	"vscode.extension.publisher": "Editore dell'estensione Visual Studio Code.",
	"vscode.extension.displayName": "Nome visualizzato per l'estensione usato nella raccolta di Visual Studio Code.",
	"vscode.extension.categories": "Categorie usate dalla raccolta di Visual Studio Code per definire la categoria dell'estensione.",
	"vscode.extension.galleryBanner": "Banner usato nel marketplace di Visual Studio Code.",
	"vscode.extension.galleryBanner.color": "Colore del banner nell'intestazione pagina del marketplace di Visual Studio Code.",
	"vscode.extension.galleryBanner.theme": "Tema colori per il tipo di carattere usato nel banner.",
	"vscode.extension.contributes": "Tutti i contributi dell'estensione Visual Studio Code rappresentati da questo pacchetto.",
	"vscode.extension.preview": "Imposta l'estensione in modo che venga contrassegnata come Anteprima nel Marketplace.",
	"vscode.extension.activationEvents": "Eventi di attivazione per l'estensione Visual Studio Code.",
	"vscode.extension.badges": "Matrice di notifiche da visualizzare nella barra laterale della pagina delle estensioni del Marketplace.",
	"vscode.extension.badges.url": "URL di immagine della notifica.",
	"vscode.extension.badges.href": "Collegamento della notifica.",
	"vscode.extension.badges.description": "Descrizione della notifica.",
	"vscode.extension.extensionDependencies": "Dipendenze ad altre estensioni. L'identificatore di un'estensione è sempre ${publisher}.${name}. Ad esempio: vscode.csharp.",
	"vscode.extension.scripts.prepublish": "Script eseguito prima che il pacchetto venga pubblicato come estensione Visual Studio Code.",
	"vscode.extension.icon": "Percorso di un'icona da 128x128 pixel."
}