/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"activeVersion": "Attualmente attiva",
	"channelName": "TypeScript",
	"later": "In seguito",
	"learnMore": "Altre informazioni",
	"noBundledServerFound": "Il file tsserver di VSCode è stato eliminato da un'altra applicazione, ad esempio uno strumento di rilevamento virus che non funziona correttamente. Reinstallare VSCode.",
	"noServerFound": "Il percorso {0} non punta a un'installazione valida di tsserver. Verrà eseguito il fallback alla versione in bundle di TypeScript.",
	"reloadBlurb": "Ricaricare la finestra per applicare le modifiche",
	"reloadTitle": "Ricarica",
	"selectTsVersion": "Selezionare la versione di TypeScript usata per le funzionalità del linguaggio JavaScript e TypeScript",
	"serverCouldNotBeStarted": "Non è stato possibile avviare il server di linguaggio TypeScript. Messaggio di errore: {0}",
	"serverDied": "Il servizio di linguaggio Typescript è stato arrestato in modo imprevisto per cinque volte negli ultimi cinque minuti.",
	"serverDiedAfterStart": "Il servizio di linguaggio TypeScript è stato arrestato in modo imprevisto per cinque volte dopo che è stato avviato e non verrà riavviato.",
	"serverDiedReportIssue": "Segnala problema",
	"tsserverLogReloadBlurb": "Ricaricare Visual Studio Code per applicare la modifica relativa a 'typescript.tsserver.log'",
	"typescript.openTsServerLog.enableAndReloadOption": "Abilita la registrazione e ricarica Visual Studio Code",
	"typescript.openTsServerLog.loggingNotEnabled": "La registrazione del server TypeScript è disattivata. Per abilitarla, impostare `typescript.tsserver.log` e ricaricare Visual Studio Code",
	"typescript.openTsServerLog.noLogFile": "Il server TypeScript non ha avviato la registrazione.",
	"typescript.openTsServerLog.notSupported": "Per la registrazione del server TypeScript è necessario almeno TypeScript 2.2.2",
	"useVSCodeVersionOption": "Usa versione di VSCode",
	"useWorkspaceVersionOption": "Usa versione dell'area di lavoro",
	"versionNumber.custom": "personalizzato"
}