/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"invalid.color": "Formato de color no válido. Use #TGB, #RBGA, #RRGGBB o #RRGGBBAA",
	"schema.colors": "Colores usados en el área de trabajo.",
	"foreground": "Color de primer plano general. Este color solo se usa si un componente no lo invalida.",
	"focusBorder": "Color de borde de los elementos con foco. Este color solo se usa si un componente no lo invalida.",
	"contrastBorder": "Un borde adicional alrededor de los elementos para separarlos unos de otros y así mejorar el contraste.",
	"activeContrastBorder": "Un borde adicional alrededor de los elementos activos para separarlos unos de otros y así mejorar el contraste.",
	"widgetShadow": "Color de sombra de los widgets  dentro del editor, como buscar/reemplazar",
	"inputBoxBackground": "Fondo de cuadro de entrada.",
	"inputBoxForeground": "Primer plano de cuadro de entrada.",
	"inputBoxBorder": "Borde de cuadro de entrada.",
	"inputBoxActiveOptionBorder": "Color de borde de opciones activadas en campos de entrada.",
	"inputValidationInfoBackground": "Color de fondo de validación de entrada para gravedad de información.",
	"inputValidationInfoBorder": "Color de borde de validación de entrada para gravedad de información.",
	"inputValidationWarningBackground": "Color de fondo de validación de entrada para advertencia de información.",
	"inputValidationWarningBorder": "Color de borde de validación de entrada para gravedad de advertencia.",
	"inputValidationErrorBackground": "Color de fondo de validación de entrada para gravedad de error.",
	"inputValidationErrorBorder": "Color de borde de valdación de entrada para gravedad de error.",
	"dropdownBackground": "Fondo de lista desplegable.",
	"dropdownForeground": "Primer plano de lista desplegable.",
	"dropdownBorder": "Borde de lista desplegable.",
	"listFocusBackground": "Color de fondo de la lista o el árbol del elemento con el foco cuando la lista o el árbol están activos. Una lista o un árbol tienen el foco del teclado cuando están activos, cuando están inactivos no.",
	"listActiveSelectionBackground": "Color de fondo de la lista o el árbol del elemento seleccionado cuando la lista o el árbol están activos. Una lista o un árbol tienen el foco del teclado cuando están activos, cuando están inactivos no.",
	"listInactiveSelectionBackground": "Color de fondo de la lista o el árbol del elemento seleccionado cuando la lista o el árbol están inactivos. Una lista o un árbol tienen el foco del teclado cuando están activos, cuando están inactivos no.",
	"listActiveSelectionForeground": "Color de primer plano de la lista o el árbol del elemento con el foco cuando la lista o el árbol están activos. Una lista o un árbol tienen el foco del teclado cuando están activos, cuando están inactivos no.",
	"listHoverBackground": "Fondo de la lista o el árbol al mantener el mouse sobre los elementos.",
	"listDropBackground": "Fondo de arrastrar y colocar la lista o el árbol al mover los elementos con el mouse.",
	"highlight": "Color de primer plano de la lista o el árbol de las coincidencias resaltadas al buscar dentro de la lista o el ábol.",
	"pickerGroupForeground": "Selector de color rápido para la agrupación de etiquetas.",
	"pickerGroupBorder": "Selector de color rápido para la agrupación de bordes.",
	"buttonForeground": "Color de primer plano del botón.",
	"buttonBackground": "Color de fondo del botón.",
	"buttonHoverBackground": "Color de fondo del botón al mantener el puntero.",
	"scrollbarShadow": "Sombra de la barra de desplazamiento indica que la vista se ha despazado.",
	"scrollbarSliderBackground": "Color de fondo del control deslizante.",
	"scrollbarSliderHoverBackground": "Color de fondo del control deslizante al mantener el puntero.",
	"scrollbarSliderActiveBackground": "Color de fondo del control deslizante cuando está activo.",
	"editorBackground": "Color de fondo del editor.",
	"editorForeground": "Color de primer plano predeterminado del editor.",
	"editorSelection": "Color de la selección del editor.",
	"editorInactiveSelection": "Color de la selección en un editor inactivo.",
	"editorSelectionHighlight": "Color de las regiones con el mismo contenido que la selección.",
	"editorFindMatch": "Color de la coincidencia de búsqueda actual.",
	"findMatchHighlight": "Color de las demás coincidencias de búsqueda.",
	"findRangeHighlight": "Color del intervalo que limita la búsqueda.",
	"hoverHighlight": "Resaltado debajo de la palabra para la que se muestra un recuadro al mantener el puntero.",
	"hoverBackground": "Color de fondo al mantener el puntero en el editor.",
	"hoverBorder": "Color del borde al mantener el puntero en el editor.",
	"activeLinkForeground": "Color de los vínculos activos.",
	"editorWidgetBackground": "Color de fondo del editor de widgets como buscar/reemplazar"
}