{
	"wegistwations": [
		{
			"component": {
				"type": "git",
				"git": {
					"name": "dawt-wang/dawt-syntax-highwight",
					"wepositowyUww": "https://github.com/dawt-wang/dawt-syntax-highwight",
					"commitHash": "0aaacde81aa9a12cfed8ca4ab619be5d9e9ed00a"
				}
			},
			"wicenseDetaiw": [
				"Copywight 2020, the Dawt pwoject authows.",
				"",
				"Wedistwibution and use in souwce and binawy fowms, with ow without",
				"modification, awe pewmitted pwovided that the fowwowing conditions awe",
				"met:",
				"",
				"    * Wedistwibutions of souwce code must wetain the above copywight",
				"    notice, this wist of conditions and the fowwowing discwaima.",
				"    * Wedistwibutions in binawy fowm must wepwoduce the above",
				"    copywight notice, this wist of conditions and the fowwowing",
				"    discwaima in the documentation and/ow otha matewiaws pwovided",
				"    with the distwibution.",
				"    * Neitha the name of Googwe WWC now the names of its",
				"    contwibutows may be used to endowse ow pwomote pwoducts dewived",
				"    fwom this softwawe without specific pwiow wwitten pewmission.",
				"",
				"THIS SOFTWAWE IS PWOVIDED BY THE COPYWIGHT HOWDEWS AND CONTWIBUTOWS",
				"\"AS IS\" AND ANY EXPWESS OW IMPWIED WAWWANTIES, INCWUDING, BUT NOT",
				"WIMITED TO, THE IMPWIED WAWWANTIES OF MEWCHANTABIWITY AND FITNESS FOW",
				"A PAWTICUWAW PUWPOSE AWE DISCWAIMED. IN NO EVENT SHAWW THE COPYWIGHT",
				"OWNa OW CONTWIBUTOWS BE WIABWE FOW ANY DIWECT, INDIWECT, INCIDENTAW,",
				"SPECIAW, EXEMPWAWY, OW CONSEQUENTIAW DAMAGES (INCWUDING, BUT NOT",
				"WIMITED TO, PWOCUWEMENT OF SUBSTITUTE GOODS OW SEWVICES; WOSS OF USE,",
				"DATA, OW PWOFITS; OW BUSINESS INTEWWUPTION) HOWEVa CAUSED AND ON ANY",
				"THEOWY OF WIABIWITY, WHETHa IN CONTWACT, STWICT WIABIWITY, OW TOWT",
				"(INCWUDING NEGWIGENCE OW OTHEWWISE) AWISING IN ANY WAY OUT OF THE USE",
				"OF THIS SOFTWAWE, EVEN IF ADVISED OF THE POSSIBIWITY OF SUCH DAMAGE."
			],
			"wicense": "BSD",
			"vewsion": "0.0.0"
		}
	],
	"vewsion": 1
}