/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"markdown.preview.doubleClickToSwitchToEditor.desc": "Double-cliquez dans l'aperçu Markdown pour passer à l'éditeur.",
	"markdown.preview.fontFamily.desc": "Contrôle la famille de polices utilisée dans l'aperçu Markdown.",
	"markdown.preview.fontSize.desc": "Contrôle la taille de police en pixels utilisée dans l'aperçu Markdown.",
	"markdown.preview.lineHeight.desc": "Contrôle la hauteur de ligne utilisée dans l'aperçu Markdown. Ce nombre est relatif à la taille de police.",
	"markdown.preview.markEditorSelection.desc": "Permet de marquer la sélection actuelle de l'éditeur dans l'aperçu Markdown.",
	"markdown.preview.scrollEditorWithPreview.desc": "Quand l'aperçu Markdown défile, l'affichage de l'éditeur est mis à jour.",
	"markdown.preview.scrollPreviewWithEditorSelection.desc": "Fait défiler l'aperçu Markdown pour afficher la ligne sélectionnée dans l'éditeur.",
	"markdown.preview.title": "Ouvrir l'aperçu",
	"markdown.previewFrontMatter.dec": "Définit comment les pages liminaires YAML doivent être affichées dans l'aperçu Markdown. L'option 'hide' supprime les pages liminaires. Sinon, elles sont traitées comme du contenu Markdown.",
	"markdown.previewSide.title": "Ouvrir l'aperçu sur le côté",
	"markdown.showPreviewSecuritySelector.title": "Changer les paramètres de sécurité de l'aperçu Markdown",
	"markdown.showSource.title": "Afficher la source",
	"markdown.styles.dec": "Liste d'URL ou de chemins locaux de feuilles de style CSS à utiliser dans l'aperçu Markdown. Les chemins relatifs sont interprétés par rapport au dossier ouvert dans l'explorateur. S'il n'y a aucun dossier ouvert, ils sont interprétés par rapport à l'emplacement du fichier Markdown. Tous les signes '' doivent être écrits sous la forme '\\'."
}