/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"ProblemPatternParser.loopProperty.notLast": "La propiedad loop solo se admite en el buscador de coincidencias de la última línea.",
	"ProblemPatternParser.problemPattern.missingRegExp": "Falta una expresión regular en el patrón de problema.",
	"ProblemPatternParser.problemPattern.missingProperty": "El patrón de problema no es válido. Debe tener al menos un archivo, un mensaje y un grupo de coincidencias de ubicación o línea.",
	"ProblemPatternParser.invalidRegexp": "Error: La cadena {0} no es una expresión regular válida.\n",
	"ProblemPatternSchema.regexp": "Expresión regular para encontrar un error, una advertencia o información en la salida.",
	"ProblemPatternSchema.file": "Índice de grupo de coincidencias del nombre de archivo. Si se omite, se usa 1.",
	"ProblemPatternSchema.location": "Índice de grupo de coincidencias de la ubicación del problema. Los patrones de ubicación válidos son: (line), (line,column) y (startLine,startColumn,endLine,endColumn). Si se omite, se asume el uso de (line,column).",
	"ProblemPatternSchema.line": "Índice de grupo de coincidencias de la línea del problema. Valor predeterminado: 2.",
	"ProblemPatternSchema.column": "Índice de grupo de coincidencias del carácter de línea del problema. Valor predeterminado: 3",
	"ProblemPatternSchema.endLine": "Índice de grupo de coincidencias de la línea final del problema. Valor predeterminado como no definido.",
	"ProblemPatternSchema.endColumn": "Índice de grupo de coincidencias del carácter de línea final del problema. Valor predeterminado como no definido",
	"ProblemPatternSchema.severity": "Índice de grupo de coincidencias de la gravedad del problema. Valor predeterminado como no definido.",
	"ProblemPatternSchema.code": "Índice de grupo de coincidencias del código del problema. Valor predeterminado como no definido.",
	"ProblemPatternSchema.message": "Índice de grupo de coincidencias del mensaje. Si se omite, el valor predeterminado es 4 en caso de definirse la ubicación. De lo contrario, el valor predeterminado es 5.",
	"ProblemPatternSchema.loop": "En un bucle de buscador de coincidencias multilínea, indica si este patrón se ejecuta en un bucle siempre que haya coincidencias. Solo puede especificarse en el último patrón de un patrón multilínea.",
	"NamedProblemPatternSchema.name": "Nombre del patrón de problema.",
	"NamedMultiLineProblemPatternSchema.name": "Nombre del patrón de problema de varias líneas.",
	"NamedMultiLineProblemPatternSchema.patterns": "The actual patterns.",
	"ProblemPatternExtPoint": "Aporta patrones de problemas",
	"ProblemPatternRegistry.error": "Patrón de problema no válido. Se omitirá.",
	"ProblemMatcherParser.noProblemMatcher": "Error: La descripción no se puede convertir en un buscador de coincidencias de problemas:\n{0}\n",
	"ProblemMatcherParser.noProblemPattern": "Error: La descripción no define un patrón de problema válido:\n{0}\n",
	"ProblemMatcherParser.noOwner": "Error: La descripción no define un propietario:\n{0}\n",
	"ProblemMatcherParser.noFileLocation": "Error: La descripción no define una ubicación de archivo:\n{0}\n",
	"ProblemMatcherParser.unknownSeverity": "Información: Gravedad {0} desconocida. Los valores válidos son \"error\", \"advertencia\" e \"información\".\n",
	"ProblemMatcherParser.noDefinedPatter": "Error: El patrón con el identificador {0} no existe.",
	"ProblemMatcherParser.noIdentifier": "Error: La propiedad pattern hace referencia a un identificador vacío.",
	"ProblemMatcherParser.noValidIdentifier": "Error: La propiedad pattern {0} no es un nombre de variable de patrón válido.",
	"ProblemMatcherParser.problemPattern.watchingMatcher": "Un buscador de coincidencias de problemas debe definir tanto un patrón de inicio como un patrón de finalización para la inspección.",
	"ProblemMatcherParser.invalidRegexp": "Error: La cadena {0} no es una expresión regular válida.\n",
	"WatchingPatternSchema.regexp": "Expresión regular para detectar el principio o el final de una tarea en segundo plano.",
	"WatchingPatternSchema.file": "Índice de grupo de coincidencias del nombre de archivo. Se puede omitir.",
	"PatternTypeSchema.name": "Nombre de un patrón aportado o predefinido",
	"PatternTypeSchema.description": "Patrón de problema o nombre de un patrón de problema que se ha aportado o predefinido. Se puede omitir si se especifica la base.",
	"ProblemMatcherSchema.base": "Nombre de un buscador de coincidencias de problemas base que se va a usar.",
	"ProblemMatcherSchema.owner": "Propietario del problema dentro de Code. Se puede omitir si se especifica \"base\". Si se omite y no se especifica \"base\", el valor predeterminado es \"external\".",
	"ProblemMatcherSchema.severity": "Gravedad predeterminada para los problemas de capturas. Se usa si el patrón no define un grupo de coincidencias para \"severity\".",
	"ProblemMatcherSchema.applyTo": "Controla si un problema notificado en un documento de texto se aplica solamente a los documentos abiertos, cerrados o a todos los documentos.",
	"ProblemMatcherSchema.fileLocation": "Define cómo deben interpretarse los nombres de archivo notificados en un patrón de problema.",
	"ProblemMatcherSchema.background": "Patrones para hacer seguimiento del comienzo y el final en un comprobador activo de la tarea en segundo plano.",
	"ProblemMatcherSchema.background.activeOnStart": "Si se establece en True, el monitor está en modo activo cuando la tarea empieza. Esto es equivalente a emitir una línea que coincide con beginPattern",
	"ProblemMatcherSchema.background.beginsPattern": "Si se encuentran coincidencias en la salida, se señala el inicio de una tarea en segundo plano.",
	"ProblemMatcherSchema.background.endsPattern": "Si se encuentran coincidencias en la salida, se señala el fin de una tarea en segundo plano.",
	"ProblemMatcherSchema.watching.deprecated": "Esta propiedad está en desuso. Use la propiedad en segundo plano.",
	"ProblemMatcherSchema.watching": "Patrones para hacer un seguimiento del comienzo y el final de un patrón de supervisión.",
	"ProblemMatcherSchema.watching.activeOnStart": "Si se establece en true, el monitor está en modo activo cuando la tarea empieza. Esto es equivalente a emitir una línea que coincide con beginPattern",
	"ProblemMatcherSchema.watching.beginsPattern": "Si se encuentran coincidencias en la salida, se señala el inicio de una tarea de inspección.",
	"ProblemMatcherSchema.watching.endsPattern": "Si se encuentran coincidencias en la salida, se señala el fin de una tarea de inspección",
	"LegacyProblemMatcherSchema.watchedBegin.deprecated": "This property is deprecated. Use the watching property instead.",
	"LegacyProblemMatcherSchema.watchedBegin": "Expresión regular que señala que una tarea inspeccionada comienza a ejecutarse desencadenada a través de la inspección de archivos.",
	"LegacyProblemMatcherSchema.watchedEnd.deprecated": "This property is deprecated. Use the watching property instead.",
	"LegacyProblemMatcherSchema.watchedEnd": "Expresión regular que señala que una tarea inspeccionada termina de ejecutarse.",
	"ProblemMatcherExtPoint": "Aporta buscadores de coincidencias de problemas"
}