{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"previewOnGitHub": "GitHub'da Önizle",
	"loadingData": "Veri yükleniyor...",
	"rateLimited": "GitHub sorgu sınırı aşıldı. Lütfen bekleyin.",
	"similarIssues": "Benzer sorunlar",
	"open": "Aç",
	"closed": "Kapalı",
	"noSimilarIssues": "Benzer bir sorun bulunmadı",
	"settingsSearchIssue": "Ayar Arama Sorunu",
	"bugReporter": "Hata Raporu",
	"featureRequest": "Özellik İsteği",
	"performanceIssue": "Performans Sorunu",
	"stepsToReproduce": "Yeniden oluşturma adımları",
	"bugDescription": "Sorunu güvenilir şekilde yeniden oluşturmak için gerekli adımları paylaşın. Lütfen gerçekleşen ve beklenen sonuçları ekleyin. GitHub-tarzı Markdown'ı destekliyoruz. GitHub'da önizleme yaptığımızda sorununuzu düzenleyebilecek ve ekran görüntüleri ekleyebileceksiniz.",
	"performanceIssueDesciption": "Bu performans sorunu ne zaman oluştu? Başlangıçta mı yoksa belirli eylemlerden sonra mı oluşuyor? GitHub-tarzı Markdown'ı destekliyoruz. GitHub'da önizleme yaptığımızda sorununuzu düzenleyebilecek ve ekran görüntüleri ekleyebileceksiniz.",
	"description": "Açıklama",
	"featureRequestDescription": "Lütfen görmek istediğiniz özelliği açıklayın. GitHub-tarzı Markdown'ı destekliyoruz. GitHub'da önizleme yaptığımızda sorununuzu düzenleyebilecek ve ekran görüntüleri ekleyebileceksiniz.",
	"expectedResults": "Beklenen Sonuçlar",
	"settingsSearchResultsDescription": "Lütfen bu sorgu ile arama yaptığınızda beklediğiniz sonuçları listeleyin. GitHub-tarzı Markdown'ı destekliyoruz. GitHub'da önizleme yaptığımızda sorununuzu düzenleyebilecek ve ekran görüntüleri ekleyebileceksiniz.",
	"pasteData": "İhtiyaç duyulan veri gönderilemeyecek kadar büyük olduğu için, bu veriyi panonuza kopyaladık. Lütfen yapıştırın.",
	"disabledExtensions": "Eklentiler devre dışı"
}