/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"acceptSuggestionOnEnter": "Controlla se i suggerimenti devono essere accettati con 'INVIO' in aggiunta a 'TAB'. Consente di evitare ambiguità tra l'inserimento di nuove righe e l'accettazione di suggerimenti.",
	"autoClosingBrackets": "Controlla se l'editor deve chiudere automaticamente le parentesi quadre dopo che sono state aperte",
	"cursorBlinking": "Controlla l'animazione per l'intermittenza del cursore. I valori accettati sono: 'blink', 'visible' e 'hidden'",
	"cursorStyle": "Controlla lo stile del cursore. I valori accettati sono 'block' e 'line'",
	"detectIndentation": "All'apertura di un file, `editor.tabSize` e `editor.insertSpaces` verranno rilevati in base al contenuto del file.",
	"editorConfigurationTitle": "Configurazione editor",
	"folding": "Controlla se per l'editor è abilitata la riduzione del codice",
	"fontFamily": "Controlla la famiglia di caratteri.",
	"fontLigatures": "Abilita i caratteri legatura",
	"fontSize": "Controlla le dimensioni del carattere.",
	"formatOnType": "Controlla se l'editor deve formattare automaticamente la riga dopo la digitazione",
	"glyphMargin": "Controlla la visibilità del margine del glifo",
	"hideCursorInOverviewRuler": "Controlla se il cursore deve essere nascosto nel righello delle annotazioni.",
	"ignoreTrimWhitespace": "Controlla se l'editor diff mostra come differenze le modifiche relative a spazi vuoti iniziali e finali",
	"insertSpaces": "Inserisce spazi quando si preme TAB.",
	"insertSpaces.errorMessage": "È previsto 'boolean'. Nota: il valore \"auto\" è stato sostituito dall'impostazione `editor.detectIndentation`.",
	"lineHeight": "Controlla l'altezza della riga.",
	"lineNumbers": "Controlla la visibilità dei numeri di riga",
	"mouseWheelScrollSensitivity": "Moltiplicatore da usare sui valori `deltaX` e `deltaY` degli eventi di scorrimento della rotellina del mouse",
	"overviewRulerLanes": "Controlla il numero di effetti che possono essere visualizzati nella stessa posizione nel righello delle annotazioni",
	"quickSuggestions": "Controlla se durante la digitazione verranno o meno visualizzati i suggerimenti rapidi",
	"quickSuggestionsDelay": "Controlla il ritardo in ms dopo il quale verranno visualizzati i suggerimenti rapidi",
	"referenceInfos": "Controlla se l'editor visualizza le informazioni di riferimento per le modalità supportate",
	"renderWhitespace": "Controlla se l'editor deve eseguire il rendering dei spazi vuoti",
	"roundedSelection": "Controlla se gli angoli delle selezioni sono arrotondati",
	"rulers": "Colonne in corrispondenza delle quali visualizzare i righelli verticali",
	"scrollBeyondLastLine": "Controlla se l'editor scorrerà oltre l'ultima riga",
	"selectionHighlight": "Controlla se l'editor deve evidenziare gli elementi corrispondenti simili alla selezione",
	"sideBySide": "Controlla se l'editor diff mostra le differenze affiancate o incorporate",
	"suggestOnTriggerCharacters": "Controlla se i suggerimenti devono essere visualizzati automaticamente durante la digitazione dei caratteri trigger",
	"tabSize": "Numero di spazi a cui equivale una tabulazione.",
	"tabSize.errorMessage": "È previsto 'number'. Nota: il valore \"auto\" è stato sostituito dall'impostazione `editor.detectIndentation`.",
	"wordSeparators": "Caratteri che verranno usati come separatori di parola quando si eseguono operazioni o spostamenti correlati a parole",
	"wrappingColumn": "Controlla il numero di caratteri dopo i quali l'editor attiverà l'a capo automatico alla riga successiva. Se è impostato su 0, verrà attivato l'a capo automatico in base alla larghezza del viewport",
	"wrappingIndent": "Controlla il rientro delle righe con ritorno a capo. Può essere uno dei valori seguenti: 'none', 'same' o 'indent'."
}