/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"vscode.extension.engines.vscode": "Para extensões do VS Code, especifica a versão do VS Code que a extensão é compatível. Não pode ser *. Por exemplo: ^0.10.5 indica compatibilidade com uma versão mínima de 0.10.5 para o VS Code.",
	"vscode.extension.publisher": "O editor da extensão do VS Code.",
	"vscode.extension.displayName": "O nome de exibição para a extensão do VS Code.",
	"vscode.extension.categories": "As categorias usadas pela galeria do VS Code para categorizar a extensão.",
	"vscode.extension.galleryBanner": "Banner usado na loja VS Code.",
	"vscode.extension.galleryBanner.color": "A cor do banner usado no cabeçalho de página da loja VS Code.",
	"vscode.extension.galleryBanner.theme": "A cor do tema usada para o fonte usado no banner.",
	"vscode.extension.contributes": "Todas as contribuições da extensão VS Code representadas por este pacote.",
	"vscode.extension.preview": "Configura a extensão para ser marcada como pré-visualização na Loja.",
	"vscode.extension.activationEvents": "Eventos de ativação para a extensão VS Code.",
	"vscode.extension.activationEvents.onLanguage": "Um evento de ativação emitido sempre que um arquivo que resolve para a linguagem especificada é aberto.",
	"vscode.extension.activationEvents.onCommand": "Um evento de ativação emitido sempre que o comando especificado for invocado.",
	"vscode.extension.activationEvents.onDebug": "Um evento de ativação emitido sempre que uma sessão de depuração do tipo especificado é iniciada.",
	"vscode.extension.activationEvents.workspaceContains": "Um evento de ativação emitido quando uma pasta que contém pelo menos um arquivo correspondente ao padrão global especificado é aberta.",
	"vscode.extension.activationEvents.onView": "Um evento de ativação emitido sempre que o modo de visualização especificado é expandido.",
	"vscode.extension.activationEvents.star": "Um evento de ativação emitido na inicialização do VS Code. Para garantir uma ótima experiência de usuário, por favor, use este evento de ativação em sua extensão somente quando nenhuma outra combinação de eventos de ativação funcionar em seu caso de uso.",
	"vscode.extension.badges": "Matriz de emblemas a mostrar na barra lateral da página da extensão na Loja.",
	"vscode.extension.badges.url": "URL da imagem do emblema.",
	"vscode.extension.badges.href": "Link do emblema.",
	"vscode.extension.badges.description": "Descrição do emblema.",
	"vscode.extension.extensionDependencies": "Dependências para outras extensões. O identificador de uma extensão sempre é ${publisher}. ${nome}. Por exemplo: vscode.csharp.",
	"vscode.extension.scripts.prepublish": "Script a ser executado antes do pacote ser publicado como uma extensão VS Code.",
	"vscode.extension.icon": "O caminho para um ícone de 128x128 pixels."
}