/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"enableValidation": "Active ou désactive toutes les validations",
	"rule.avoidFloat": "N'utilisez pas 'float'. Les éléments Float peuvent fragiliser le code CSS qui est ainsi plus vulnérable si un aspect de la disposition change.",
	"rule.avoidIdSelector": "Les sélecteurs ne doivent pas contenir d'ID, car ces règles sont trop fortement couplées au code HTML.",
	"rule.avoidImportant": "N'utilisez pas !important. Cela indique que la spécificité de l'intégralité du code CSS est incorrecte et qu'il doit être refactorisé.",
	"rule.colorFunction": "Nombre de paramètres incorrect",
	"rule.duplicateDeclarations": "Ne pas utiliser de définitions de style en double",
	"rule.emptyRuleSets": "Ne pas utiliser d'ensembles de règles vides",
	"rule.fontFaceProperties": "la règle @font-face doit définir les propriétés 'src' et 'font-family'",
	"rule.hexColor": "Les couleurs Hex doivent contenir trois ou six chiffres hex",
	"rule.ieHack": "Les hacks IE ne sont nécessaires que si IE7 et versions antérieures sont pris en charge",
	"rule.importDirective": "Les instructions d'importation ne sont pas chargées en parallèle",
	"rule.propertyIgnoredDueToDisplay": "Propriété ignorée en raison de l'affichage. Par exemple, avec 'display: inline', les propriétés width, height, margin-top, margin-bottom et float sont sans effet",
	"rule.standardvendorprefix.all": "Lors de l'utilisation d'un préfixe spécifique à un fournisseur, ajouter également la propriété standard",
	"rule.universalSelector": "Le sélecteur universel (*) est connu pour sa lenteur",
	"rule.unknownProperty": "Propriété inconnue.",
	"rule.unknownVendorSpecificProperty": "Propriété spécifique à un fournisseur inconnue.",
	"rule.vendorprefixes.all": "Lors de l'utilisation d'un préfixe spécifique à un fabricant, toujours inclure également toutes les propriétés spécifiques au fabricant",
	"rule.withHeightAndBorderPadding": "Ne pas utiliser la largeur ou la hauteur avec une marge intérieure ou une bordure",
	"rule.zeroWidthUnit": "Aucune unité requise pour zéro"
}