/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"schema.json": "Descrive un file JSON che usa uno schema. Per altre informazioni, visitare il sito json-schema.org.",
	"schema.json.$schema": "Schema da usare per la verifica di questo documento ",
	"schema.json.additionalItems": "Per le matrici solo quando gli elementi sono impostati come una matrice. Se è uno schema, convalida gli elementi dopo quelli specificati dalla matrice di elementi. Se è false, gli elementi aggiuntivi impediranno la convalida.",
	"schema.json.additionalProperties": "Schema o valore booleano. Se è uno schema, viene usato per convalidare tutte le proprietà che non corrispondono a 'properties' o 'patternProperties'. Se è false, eventuali proprietà non corrispondenti a nessuna delle due bloccheranno lo schema.",
	"schema.json.allOf": "Matrice di schemi che devono tutti avere una corrispondenza.",
	"schema.json.anyOf": "Matrice di schemi, in cui almeno uno deve avere una corrispondenza.",
	"schema.json.default": "Valore predefinito. Usato dai suggerimenti.",
	"schema.json.definitions": "Non usato per la convalida. Inserire qui i sottoschemi ai quali fare riferimento inline con $ref",
	"schema.json.dependencies": "Mapping di nomi di proprietà a una matrice di nomi di proprietà o a uno schema. Una matrice di nomi di proprietà indica che, per essere valida, la proprietà denominata nella chiave dipende dalle proprietà nella matrice presente nell'oggetto. Se il valore è uno schema, lo schema viene applicato solo all'oggetto se la proprietà nella chiave esiste nell'oggetto.",
	"schema.json.description": "Descrizione lunga dell'elemento. Usata nei menu visualizzati al passaggio del mouse e nei suggerimenti.",
	"schema.json.enum": "Set di valori letterali validi",
	"schema.json.exclusiveMaximum": "Rende esclusiva la proprietà maximum.",
	"schema.json.exclusiveMininum": "Rende esclusiva la proprietà minimum.",
	"schema.json.format": "Descrive il formato previsto per il valore.",
	"schema.json.id": "Identificatore univoco per lo schema.",
	"schema.json.items": "Per le matrici. Può essere uno schema in base al quale convalidare tutti gli elementi oppure una matrice di schemi in base alla quale convalidare ogni elemento nell'ordine appropriato. Il primo schema convalida il primo elemento, il secondo schema convalida il secondo elemento e così via.",
	"schema.json.maxItems": "Numero massimo di elementi che possono essere presenti in una matrice. Inclusivo.",
	"schema.json.maxLength": "Lunghezza massima di una stringa.",
	"schema.json.maxProperties": "Numero massimo di proprietà che un oggetto può avere. Inclusivo.",
	"schema.json.maximum": "Valore numerico massimo, inclusivo per impostazione predefinita.",
	"schema.json.minItems": "Numero minimo di elementi che possono essere presenti in una matrice. Inclusivo.",
	"schema.json.minLength": "Lunghezza minima di una stringa.",
	"schema.json.minProperties": "Numero minimo di proprietà che un oggetto può avere. Inclusivo.",
	"schema.json.minimum": "Valore numerico minimo, inclusivo per impostazione predefinita.",
	"schema.json.multipleOf": "Numero per il quale deve essere diviso perfettamente il valore corrente (ossia senza resto)",
	"schema.json.not": "Schema che non deve avere corrispondenze.",
	"schema.json.oneOf": "Matrice di schemi, uno dei quali deve avere una corrispondenza.",
	"schema.json.pattern": "Espressione regolare alla quale far corrispondere la stringa. Non è implicitamente ancorata.",
	"schema.json.patternProperties": "Mapping di espressioni regolari su nomi di proprietà a schemi per le proprietà corrispondenti.",
	"schema.json.properties": "Mapping di nomi di proprietà a schemi per ogni proprietà.",
	"schema.json.required": "Matrice di stringhe che elenca i nomi di tutte le proprietà richieste per questo oggetto.",
	"schema.json.title": "Titolo descrittivo dell'elemento",
	"schema.json.type": "Stringa di uno dei tipi di schema di base (numero, intero, Null, matrice, oggetto, booleano, stringa) o matrice di stringhe che specifica un subset di questi tipi.",
	"schema.json.uniqueItems": "Indica se tutti gli elementi nella matrice devono essere univoci. Il valore predefinito è false."
}