/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"lineHighlight": "Цвет фона для выделения строки в позиции курсора.",
	"lineHighlightBorderBox": "Цвет фона границ вокруг строки в позиции курсора.",
	"rangeHighlight": "Цвет фона выделенных диапазонов, например в функциях быстрого открытия и поиска.",
	"caret": "Цвет курсора редактора.",
	"editorCursorBackground": "Цвет фона курсора редактора. Позволяет настраивать цвет символа, перекрываемого прямоугольным курсором.",
	"editorWhitespaces": "Цвет пробелов в редакторе.",
	"editorIndentGuides": "Цвет направляющих для отступов редактора.",
	"editorLineNumbers": "Цвет номеров строк редактора.",
	"editorRuler": "Цвет линейки редактора.",
	"editorCodeLensForeground": "Цвет переднего плана элемента CodeLens в редакторе",
	"editorBracketMatchBackground": "Цвет фона парных скобок",
	"editorBracketMatchBorder": "Цвет прямоугольников парных скобок",
	"editorOverviewRulerBorder": "Цвет границы для линейки в окне просмотра.",
	"editorGutter": "Цвет фона поля в редакторе. В поле размещаются отступы глифов и номера строк.",
	"errorForeground": "Цвет волнистой линии для выделения ошибок в редакторе.",
	"errorBorder": "Цвет границ волнистой линии для выделения ошибок в редакторе.",
	"warningForeground": "Цвет волнистой линии для выделения предупреждений в редакторе.",
	"warningBorder": "Цвет границ волнистой линии для выделения предупреждений в редакторе.",
	"overviewRulerRangeHighlight": "Цвет метки линейки в окне просмотра для выделений диапазонов.",
	"overviewRuleError": "Цвет метки линейки в окне просмотра для ошибок.",
	"overviewRuleWarning": "Цвет метки линейки в окне просмотра для предупреждений.",
	"overviewRuleInfo": "Цвет метки линейки в окне просмотра для информационных сообщений."
}