/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"lineHighlight": "Couleur d'arrière-plan de la mise en surbrillance de la ligne à la position du curseur.",
	"lineHighlightBorderBox": "Couleur d'arrière-plan de la bordure autour de la ligne à la position du curseur.",
	"rangeHighlight": "Couleur d'arrière-plan des plages mises en surbrillance, par exemple par les fonctionnalités de recherche et Quick Open.",
	"caret": "Couleur du curseur de l'éditeur.",
	"editorCursorBackground": "La couleur de fond du curseur de l'éditeur. Permet de personnaliser la couleur d'un caractère survolé par un curseur de bloc.",
	"editorWhitespaces": "Couleur des espaces blancs dans l'éditeur.",
	"editorIndentGuides": "Couleur des repères de retrait de l'éditeur.",
	"editorLineNumbers": "Couleur des numéros de ligne de l'éditeur.",
	"editorRuler": "Couleur des règles de l'éditeur",
	"editorCodeLensForeground": "Couleur pour les indicateurs CodeLens",
	"editorBracketMatchBackground": "Couleur d'arrière-plan pour les accolades associées",
	"editorBracketMatchBorder": "Couleur pour le contour des accolades associées",
	"editorOverviewRulerBorder": "Couleur de la bordure de la règle d'apperçu.",
	"editorGutter": "Couleur de fond pour la bordure de l'éditeur. La bordure contient les marges pour les symboles et les numéros de ligne.",
	"errorForeground": "Couleur de premier plan de la ligne ondulée marquant les erreurs dans l'éditeur.",
	"errorBorder": "Couleur de bordure de la ligne ondulée marquant les erreurs dans l'éditeur.",
	"warningForeground": "Couleur de premier plan de la ligne ondulée marquant les avertissements dans l'éditeur.",
	"warningBorder": "Couleur de bordure de la ligne ondulée marquant les avertissements dans l'éditeur.",
	"overviewRulerRangeHighlight": "Couleur du marqueur de la règle d'aperçu pour la mise en évidence de plage.",
	"overviewRuleError": "Couleur du marqueur de la règle d'aperçu pour les erreurs.",
	"overviewRuleWarning": "Couleur du marqueur de la règle d'aperçu pour les avertissements.",
	"overviewRuleInfo": "Couleur du marqueur de la règle d'aperçu pour les informations."
}