/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"status.400": "Недопустимый запрос. Невозможно заполнить запрос из-за неправильного синтаксиса.",
	"status.401": "Запрос неавторизован. Сервер не отвечает.",
	"status.403": "Запрещено. Сервер не отвечает.",
	"status.404": "Не найдено. Не удалось найти запрошенное расположение.",
	"status.405": "Метод запрещен. Запрос был выполнен с помощью метода запроса, который не поддерживается этим расположением.",
	"status.406": "Недопустимо. Сервер может создать только ответ, который не принят клиентом.",
	"status.407": "Требуется проверка подлинности прокси. Клиент должен сначала выполнить проверку подлинности себя с помощью прокси.",
	"status.408": "Время ожидания запроса истекло. Время ожидания запроса истекло во время ожидания ответа.",
	"status.409": "Конфликт. Не удалось выполнить запрос из-за конфликта в запросе.",
	"status.410": "Потеряно. Запрошенная страница больше не доступна.",
	"status.411": "Требуется длина. Значение Content-Length не задано.",
	"status.412": "Сбой предварительного условия. Предварительное условие, заданное в запросе, имеет значение false на сервере.",
	"status.413": "Слишком большой объект запроса. Сервер не примет запрос, так как слишком большой объект запроса.",
	"status.414": "Слишком велика длина URI в запросе. Сервер не примет запрос, так как URL-адрес слишком длинный.",
	"status.415": "Неподдерживаемый тип мультимедиа. Сервер не примет запрос, так как тип мультимедиа не поддерживается.",
	"status.416": "Код состояния HTTP {0}",
	"status.500": "Внутренняя ошибка сервера.",
	"status.501": "Не реализовано. Сервер не распознает метод запроса, или недостаточно возможностей для его выполнения.",
	"status.503": "Служба недоступна. Сервер недоступен (перегружен или не работает)."
}