/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"vscode.extension.engines.vscode": "Para las extensiones de VS Code, especifica la versión de VS Code con la que la extensión es compatible. No puede ser *. Por ejemplo: ^0.10.5 indica compatibilidad con una versión de VS Code mínima de 0.10.5.",
	"vscode.extension.publisher": "El publicador de la extensión VS Code.",
	"vscode.extension.displayName": "Nombre para mostrar de la extensión que se usa en la galería de VS Code.",
	"vscode.extension.categories": "Categorías que usa la galería de VS Code para clasificar la extensión.",
	"vscode.extension.galleryBanner": "Banner usado en VS Code Marketplace.",
	"vscode.extension.galleryBanner.color": "Color del banner en el encabezado de página de VS Code Marketplace.",
	"vscode.extension.galleryBanner.theme": "Tema de color de la fuente que se usa en el banner.",
	"vscode.extension.contributes": "Todas las contribuciones de la extensión VS Code representadas por este paquete.",
	"vscode.extension.preview": "Establece la extensión que debe marcarse como versión preliminar en Marketplace.",
	"vscode.extension.activationEvents": "Eventos de activación de la extensión VS Code.",
	"vscode.extension.activationEvents.onLanguage": "Un evento de activación emitido cada vez que se abre un archivo que se resuelve en el idioma especificado.",
	"vscode.extension.activationEvents.onCommand": "Un evento de activación emitido cada vez que se invoca el comando especificado.",
	"vscode.extension.activationEvents.onDebug": "Un evento de activación emitido cada vez que se inicia una sesión de depuración del tipo especificado.",
	"vscode.extension.activationEvents.workspaceContains": "Un evento de activación emitido cada vez que se abre una carpeta que contiene al menos un archivo que coincide con el patrón global especificado.",
	"vscode.extension.activationEvents.onView": "Un evento de activación emitido cada vez que se expande la vista especificada.",
	"vscode.extension.activationEvents.star": "Un evento de activación emitido al inicio de VS Code. Para garantizar una buena experiencia para el usuario final, use este evento de activación en su extensión solo cuando no le sirva ninguna otra combinación de eventos de activación en su caso.",
	"vscode.extension.badges": "Matriz de distintivos que se muestran en la barra lateral de la página de extensiones de Marketplace.",
	"vscode.extension.badges.url": "URL de la imagen del distintivo.",
	"vscode.extension.badges.href": "Vínculo del distintivo.",
	"vscode.extension.badges.description": "Descripción del distintivo.",
	"vscode.extension.extensionDependencies": "Dependencias a otras extensiones. El identificador de una extensión siempre es ${publisher}.${name}. Por ejemplo: vscode.csharp.",
	"vscode.extension.scripts.prepublish": "Script que se ejecuta antes de publicar el paquete como extensión VS Code.",
	"vscode.extension.icon": "Ruta de acceso a un icono de 128 x 128 píxeles."
}