/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"enableValidation": "Aktiviert oder deaktiviert alle Überprüfungen.",
	"rule.avoidFloat": "Die Verwendung von \"float\" vermeiden. float-Eigenschaften führen zu anfälligem CSS, das schnell nicht mehr funktioniert, wenn sich ein Aspekt des Layouts ändert.",
	"rule.avoidIdSelector": "Selektoren sollten keine IDs enthalten, da diese Regeln zu eng mit HTML verknüpft sind.",
	"rule.avoidImportant": "Verwendung von „!important“ vermeiden. Damit wird angegeben, dass die Spezifität vom gesamten CSS außer Kontrolle geraten ist und umgestaltet werden muss.",
	"rule.colorFunction": "Ungültige Parameteranzahl",
	"rule.duplicateDeclarations": "Keine doppelten Formatdefinitionen verwenden",
	"rule.emptyRuleSets": "Keine leeren Regelsätze verwenden",
	"rule.fontFaceProperties": "@font-face-Regel muss Eigenschaften src und font-family definieren",
	"rule.hexColor": "Hexfarben müssen aus drei oder sechs Hexzahlen bestehen",
	"rule.ieHack": "IE-Hacks sind nur für die Unterstützung von IE7 und älter erforderlich",
	"rule.importDirective": "Import-Anweisungen können nicht parallel laden",
	"rule.propertyIgnoredDueToDisplay": "Die Eigenschaft wird aufgrund der Anzeige ignoriert. Mit \"display: inline\" besitzen die width-, height-, margin-top-, margin-bottom- und float-Eigenschaften z. B. keine Auswirkung.",
	"rule.standardvendorprefix.all": "Beim Verwenden von anbieterspezifischen Präfix auch die Standardeigenschaft miteinbeziehen",
	"rule.universalSelector": "Es ist bekannt, dass der Universal-Selektor (*) langsam ist",
	"rule.unknownProperty": "Unbekannte Eigenschaft.",
	"rule.unknownVendorSpecificProperty": "Unbekannte anbieterspezifische Eigenschaft.",
	"rule.vendorprefixes.all": "Stellen Sie beim Verwenden vom anbieterspezifischen Präfix sicher, dass alle anderen anbieterspezifischen Eigenschaften miteinbezogen werden",
	"rule.withHeightAndBorderPadding": "Verwenden Sie width oder height nicht beim Festlegen von padding oder border",
	"rule.zeroWidthUnit": "Keine Einheit für Null erforderlich"
}