/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"html.format.contentUnformatted.desc": "Разделенный запятыми список тегов, в которых формат содержимого не должен изменяться. Значение null задается по умолчанию для тега pre.",
	"html.format.enable.desc": "Включение или отключение модуля форматирования HTML по умолчанию (требуется перезагрузка)",
	"html.format.endWithNewline.desc": "Завершение символом новой строки.",
	"html.format.extraLiners.desc": "Список тегов с разделителями-запятыми и дополнительными новыми строками между ними. Значение \"null\" по умолчанию ставится для \"head, body, /html\".",
	"html.format.indentHandlebars.desc": "Формат и отступ {{#foo}} и {{/foo}}.",
	"html.format.indentInnerHtml.desc": "Отступ в разделах <head> и <body>.",
	"html.format.maxPreserveNewLines.desc": "Максимальное число разрывов строк для сохранения в блоке. Чтобы указать неограниченное число строк, используйте \"null\".",
	"html.format.preserveNewLines.desc": "Следует ли сохранять разрывы строк перед элементами. Работает только перед элементами, а не внутри тегов или для текста.",
	"html.format.unformatted.desc": "Список тегов, которые не следует повторно форматировать, с разделителями-запятыми. Значение \"NULL\" по умолчанию означает все теги, перечисленные на странице https://www.w3.org/TR/html5/dom.html#phrasing-content.",
	"html.format.wrapAttributes.auto": "Перенос атрибутов только при превышении длины строки.",
	"html.format.wrapAttributes.desc": "Перенос атрибутов.",
	"html.format.wrapAttributes.force": "Перенос всех атрибутов, кроме первого.",
	"html.format.wrapAttributes.forcealign": "Перенос всех атрибутов, кроме первого, и сохранение выравнивания.",
	"html.format.wrapAttributes.forcemultiline": "Перенос всех атрибутов.",
	"html.format.wrapLineLength.desc": "Максимальное число символов на строку (0 — отключить).",
	"html.suggest.angular1.desc": "Определяет, будет ли встроенная поддержка языка HTML предлагать теги и свойства Angular 1.",
	"html.suggest.html5.desc": "Определяет, будет ли встроенная поддержка языка HTML предлагать теги, свойства и значения HTML5.",
	"html.suggest.ionic.desc": "Определяет, будет ли встроенная поддержка языка HTML предлагать теги, свойства и значения Ionic.",
	"html.validate.scripts": "Определяет, будет ли встроенная поддержка языка HTML проверять внедренные сценарии.",
	"html.validate.styles": "Определяет, будет ли встроенная поддержка языка HTML проверять внедренные стили."
}