{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"previewOnGitHub": "Vorschau in GitHub",
	"loadingData": "Daten werden geladen …",
	"similarIssues": "Ähnliche Probleme",
	"open": "Öffnen",
	"closed": "Geschlossen",
	"noResults": "Es wurden keine Ergebnisse gefunden.",
	"settingsSearchIssue": "Fehler in Einstellungssuche ",
	"bugReporter": "Fehlerbericht",
	"performanceIssue": "Leistungsproblem",
	"featureRequest": "Featureanforderung",
	"stepsToReproduce": "Zu reproduzierende Schritte",
	"bugDescription": "Geben Sie an, welche Schritte ausgeführt werden müssen, um das Problem zuverlässig zu reproduzieren. Was sollte geschehen, und was ist stattdessen geschehen? Wir unterstützen GitHub Flavored Markdown. Sie können während der Vorschau in GitHub Ihr Problem bearbeiten und Screenshots hinzufügen.",
	"performanceIssueDesciption": "Wann ist dieses Leistungsproblem aufgetreten? Tritt es beispielsweise beim Start oder nach einer bestimmten Reihe von Aktionen auf? Wir unterstützen GitHub Flavored Markdown. Sie können während der Vorschau in GitHub Ihr Problem bearbeiten und Screenshots hinzufügen.",
	"description": "Beschreibung",
	"featureRequestDescription": "Bitte beschreiben Sie die Funktion, die Sie sehen möchten. Wir unterstützen GitHub-Markdown. Sie können in der GitHub-Preview ihr Problem bearbeiten und Screenshots hinzufügen.",
	"expectedResults": "Erwartete Ergebnisse",
	"settingsSearchResultsDescription": "Bitte führen Sie die Ergebnisse auf, die Sie bei der Suche mit dieser Abfrage erwartet haben. Wir unterstützen GitHub-Markdown. Sie können in der GitHub-Preview ihr Problem bearbeiten und Screenshots hinzufügen.",
	"pasteData": "Wir haben die erforderlichen Daten in die Zwischenablage geschrieben, da sie zu groß zum Senden waren. Bitte fügen Sie sie ein.",
	"disabledExtensions": "Erweiterungen sind deaktiviert"
}