/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"activeVersion": "Activa actualmente",
	"channelName": "TypeScript",
	"later": "Más tarde",
	"learnMore": "Más información",
	"noBundledServerFound": "Otra aplicación (por ejemplo, una herramienta de detección de virus con un comportamiento erróneo) eliminó el tsserver de VSCode. Debe reinstalar VS Code.",
	"noServerFound": "La ruta de acceso {0} no apunta a una instalación válida de tsserver. Se usará la versión de TypeScript del paquete.",
	"openTsServerLog.openFileFailedFailed": "No se puede abrir el archivo de registro del servidor de TS",
	"reloadBlurb": "Recargar ventana para aplicar cambios",
	"reloadTitle": "Recargar",
	"selectTsVersion": "Seleccionar la versión de TypeScript usada para las características del lenguaje de JavaScript y TypeScript",
	"serverCouldNotBeStarted": "El servidor de lenguaje TypeScript no se pudo iniciar. El mensaje de error es: {0}",
	"serverDied": "El servicio de lenguaje Typescript finalizó de forma inesperada cinco veces en los últimos cinco minutos.",
	"serverDiedAfterStart": "El servicio de lenguaje TypeScript finalizó de forma inesperada cinco veces después de haberse iniciado y no se reiniciará.",
	"serverDiedReportIssue": "Notificar problema",
	"tsserverLogReloadBlurb": "Recargue VS Code para aplicar el cambio \"typescript.tsserver.log\"",
	"typescript.openTsServerLog.enableAndReloadOption": "Habilitar el registro y recargar VS Code",
	"typescript.openTsServerLog.loggingNotEnabled": "El registro del servidor de TS está desactivado. Establezca \"typescript.tsserver.log\" y recargue VS Code para habilitar el registro.",
	"typescript.openTsServerLog.noLogFile": "El servidor de TS no ha iniciado el registro.",
	"typescript.openTsServerLog.notSupported": "El registro del servidor de TS requiere TS 2.2.2+",
	"useVSCodeVersionOption": "Usar versión de VSCode",
	"useWorkspaceVersionOption": "Usar versión del área de trabajo",
	"versionNumber.custom": "personalizada"
}