/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"schema.json": "Describe un archivo JSON mediante un esquema. Vea json-schema.org para obtener más información.",
	"schema.json.$schema": "El esquema para comprobar el documento ",
	"schema.json.additionalItems": "Para matrices, solo cuando los elementos se hayan establecido como una matriz. Si es un esquema, valida los elementos después de los que haya especificado la matriz de elementos. Cuando se establece en \"false\", los elementos adicionales provocarán un error en la validación.",
	"schema.json.additionalProperties": "Esquema o valor booleano. Si es un esquema, se usa para validar todas las propiedades sin coincidencias con \"properties\" o \"patternProperties\". Si es false, las propiedades sin este tipo de coincidencias provocarán un error del esquema.",
	"schema.json.allOf": "Una matriz de esquemas, todos los cuales deben coincidir.",
	"schema.json.anyOf": "Una matriz de esquemas, donde al menos uno debe coincidir.",
	"schema.json.default": "Un valor predeterminado. Lo usan las sugerencias.",
	"schema.json.definitions": "No se usa para validar. Coloque aquí los esquemas secundarios a los que desee hacer referencia en línea con $ref",
	"schema.json.dependencies": "Mapa de nombres de propiedad para una matriz de nombres de propiedad o un esquema. Una matriz de nombres de propiedad significa que, para que sea válida, la propiedad denominada en la clave va a depender de las propiedades de la matriz que se encuentre en el objeto. Si el valor es un esquema, este se aplica solamente al objeto si la propiedad en la clave existe en el objeto.",
	"schema.json.description": "Una descripción larga del elemento. Se usa en menús y sugerencias que aparecen al mantener el puntero.",
	"schema.json.enum": "El conjunto de valores literales que son válidos",
	"schema.json.exclusiveMaximum": "Hace exclusiva la propiedad maximum.",
	"schema.json.exclusiveMininum": "Hace exclusiva la propiedad minimum.",
	"schema.json.format": "Describe el formato que se espera para el valor.",
	"schema.json.id": "Un identificador único para el esquema.",
	"schema.json.items": "Para matrices. Puede ser un esquema respecto al que validar cada elemento o una matriz de esquemas respecto a la que validar cada elemento por orden (el primer esquema validará al primer elemento, el segundo esquema validará al segundo elemento y así sucesivamente).",
	"schema.json.maxItems": "El número máximo de elementos que puede haber en una matriz. Inclusivo.",
	"schema.json.maxLength": "La longitud máxima de una cadena.",
	"schema.json.maxProperties": "El número máximo de propiedades que puede tener un objeto. Inclusivo.",
	"schema.json.maximum": "El máximo valor numérico, inclusivo de forma predeterminada.",
	"schema.json.minItems": "El número mínimo de elementos que puede haber en una matriz. Inclusivo.",
	"schema.json.minLength": "La longitud mínima de una cadena.",
	"schema.json.minProperties": "El número mínimo de propiedades que puede tener un objeto. Inclusivo.",
	"schema.json.minimum": "El valor numérico mínimo, inclusivo de forma predeterminada.",
	"schema.json.multipleOf": "Un número que debe dividir de forma exacta el valor actual (es decir, sin resto).",
	"schema.json.not": "Un esquema que no debe tener coincidencias.",
	"schema.json.oneOf": "Una matriz de esquemas, de los cuales uno debe coincidir.",
	"schema.json.pattern": "Una expresión regular con la que hacer coincidir la cadena. No está anclada de forma implícita.",
	"schema.json.patternProperties": "Mapa de expresiones regulares de nombres de propiedad para hacer coincidir las propiedades de los esquemas.",
	"schema.json.properties": "Mapa de nombres de propiedad para esquemas para cada propiedad.",
	"schema.json.required": "Una matriz de cadenas que enumera los nombres de todas las propiedades necesarias para este objeto.",
	"schema.json.title": "Un título descriptivo del elemento",
	"schema.json.type": "Una cadena de uno de los tipos de esquema básicos (número, entero, nulo, matriz, objeto, booleano, cadena) o una matriz de cadenas que especifica un subconjunto de esos tipos.",
	"schema.json.uniqueItems": "Si todos los elementos en la matriz deben ser únicos. El valor predeterminado es false."
}