/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"vscode.extension.engines.vscode": "Pour les extensions VS Code, spécifie la version de VS Code avec laquelle l'extension est compatible. Ne peut pas être *. Exemple : ^0.10.5 indique une compatibilité avec la version minimale 0.10.5 de VS Code.",
	"vscode.extension.publisher": "Éditeur de l'extension VS Code.",
	"vscode.extension.displayName": "Nom d'affichage de l'extension utilisée dans la galerie VS Code.",
	"vscode.extension.categories": "Catégories utilisées par la galerie VS Code pour catégoriser l'extension.",
	"vscode.extension.galleryBanner": "Bannière utilisée dans le marketplace VS Code.",
	"vscode.extension.galleryBanner.color": "Couleur de la bannière de l'en-tête de page du marketplace VS Code.",
	"vscode.extension.galleryBanner.theme": "Thème de couleur de la police utilisée dans la bannière.",
	"vscode.extension.contributes": "Toutes les contributions de l'extension VS Code représentées par ce package.",
	"vscode.extension.preview": "Définit l'extension à marquer en tant que préversion dans Marketplace.",
	"vscode.extension.activationEvents": "Événements d'activation pour l'extension VS Code.",
	"vscode.extension.activationEvents.onLanguage": "Événement d'activation envoyé quand un fichier résolu dans le langage spécifié est ouvert.",
	"vscode.extension.activationEvents.onCommand": "Événement d'activation envoyé quand la commande spécifiée est appelée.",
	"vscode.extension.activationEvents.onDebug": "Événement d'activation envoyé quand une session de débogage du type spécifié est démarrée.",
	"vscode.extension.activationEvents.workspaceContains": "Événement d'activation envoyé quand un dossier ouvert contient au moins un fichier correspondant au modèle glob spécifié.",
	"vscode.extension.activationEvents.onView": "Événement d'activation envoyé quand la vue spécifiée est développée.",
	"vscode.extension.activationEvents.star": "Événement d'activation envoyé au démarrage de VS Code. Pour garantir la qualité de l'expérience utilisateur, utilisez cet événement d'activation dans votre extension uniquement quand aucune autre combinaison d'événements d'activation ne fonctionne dans votre cas d'utilisation.",
	"vscode.extension.badges": "Ensemble de badges à afficher dans la barre latérale de la page d'extensions de Marketplace.",
	"vscode.extension.badges.url": "URL de l'image du badge.",
	"vscode.extension.badges.href": "Lien du badge.",
	"vscode.extension.badges.description": "Description du badge.",
	"vscode.extension.extensionDependencies": "Dépendances envers d'autres extensions. L'identificateur d'une extension est toujours ${publisher}.${name}. Exemple : vscode.csharp.",
	"vscode.extension.scripts.prepublish": "Le script exécuté avant le package est publié en tant qu'extension VS Code.",
	"vscode.extension.icon": "Chemin d'une icône de 128 x 128 pixels."
}