/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"command.wrapWithAbbreviation": "Envelopper avec une abréviation",
	"command.wrapIndividualLinesWithAbbreviation": "Envelopper les lignes individuelles avec une abréviation",
	"command.removeTag": "Supprimer le Tag",
	"command.updateTag": "Mettre à jour le Tag",
	"command.matchTag": "Aller à la paire correspondante",
	"command.balanceIn": "Equilibrer (vers l'intérieur)",
	"command.balanceOut": "Equilibrer (vers l'extérieur)",
	"command.prevEditPoint": "Aller au Point d'édition précédent",
	"command.nextEditPoint": "Aller au Point d’édition suivant",
	"command.mergeLines": "Fusionner les lignes",
	"command.selectPrevItem": "Sélectionner l’élément précédent",
	"command.selectNextItem": "Sélectionner l’élément suivant",
	"command.splitJoinTag": "Séparer / Joindre le Tag",
	"command.toggleComment": "Activer/désactiver le commentaire",
	"command.evaluateMathExpression": "Évaluer l’Expression mathématique",
	"command.updateImageSize": "Mettre à jour la taille de l’image",
	"command.reflectCSSValue": "Reflèter la valeur CSS",
	"command.incrementNumberByOne": "Incrémenter de 1",
	"command.decrementNumberByOne": "Décrémenter de 1",
	"command.incrementNumberByOneTenth": "Incrémenter de 0,1",
	"command.decrementNumberByOneTenth": "Décrémenter de 0,1",
	"command.incrementNumberByTen": "Incrémenter de 10",
	"command.decrementNumberByTen": "Décrémenter de 10",
	"emmetSyntaxProfiles": "Définissez le profil pour la syntaxe spécifiée ou utilisez votre propre profil avec des règles spécifiques.",
	"emmetExclude": "Un tableau des langages pour lesquels les abréviations Emmet ne devraient pas être développées.",
	"emmetExtensionsPath": "Chemin d’accès au dossier contenant les profils Emmet et les extraits.",
	"emmetShowExpandedAbbreviation": "Affiche les abréviations Emmet développées sous forme de suggestions.\nL’option \"inMarkupAndStylesheetFilesOnly\" s’applique à haml, jade, slim, xml, xsl, css, html, scss, sass, less et stylus.\nL’option\"always\" s’applique à toutes les parties du fichier indépendamment du balisage/css.",
	"emmetShowAbbreviationSuggestions": "Affiche les abréviations Emmet possibles sous forme de suggestions. Non applicable dans les feuilles de style ou lorsque emmet.showExpandedAbbreviation est défini à \"never\".",
	"emmetIncludeLanguages": "Activer les abréviations Emmet dans les langages qui ne sont pas pris en charge par défaut. Ajouter ici un mappage entre le langage et le langage Emmet pris en charge.\n Par exemple : {\"vue-html\": \"html\", \"javascript\": \"javascriptreact\"}",
	"emmetVariables": "Variables à utiliser dans les extraits de Emmet",
	"emmetTriggerExpansionOnTab": "Lorsqu’activé, les abréviations Emmet sont développées lorsque vous appuyez sur TAB.",
	"emmetPreferences": "Préférences utilisées pour modifier le comportement de certaines actions et résolveurs d'Emmet.",
	"emmetPreferencesIntUnit": "Unité par défaut pour les valeurs entières",
	"emmetPreferencesFloatUnit": "Unité par défaut pour les valeurs float",
	"emmetPreferencesCssAfter": "Symbole à placer à la fin de la propriété CSS pendant le développement des abréviations CSS",
	"emmetPreferencesSassAfter": "Symbole à placer à la fin de la propriété CSS pendant le développement des abréviations CSS dans les fichiers Sass",
	"emmetPreferencesStylusAfter": "Symbole à placer à la fin de la propriété CSS pendant le développement des abréviations CSS dans les fichiers Stylus",
	"emmetPreferencesCssBetween": "Symbole à placer entre la propriété CSS et la valeur pendant le développement des abréviations CSS",
	"emmetPreferencesSassBetween": "Symbole à placer entre la propriété CSS et la valeur pendant le développement des abréviations CSS dans les fichiers Sass",
	"emmetPreferencesStylusBetween": "Symbole à placer entre la propriété CSS et la valeur pendant le développement des abréviations CSS dans les fichiers Stylus",
	"emmetShowSuggestionsAsSnippets": "Si true, alors les suggestions Emmet apparaîtront en tant qu’extraits vous permettant de les commander selon le paramètre editor.snippetSuggestions.",
	"emmetPreferencesBemElementSeparator": "Séparateur d’éléments utilisé pour les classes lorsque le filtre BEM est utilisé",
	"emmetPreferencesBemModifierSeparator": "Séparateur de modificateur utilisé pour les classes lorsque le filtre BEM est utilisé",
	"emmetPreferencesFilterCommentBefore": "Une définition de commentaire qui doit être placée avant l’élément correspondant quand le filtre de commentaire est appliqué.",
	"emmetPreferencesFilterCommentAfter": "Une définition de commentaire qui doit être placée après l’élément correspondant quand un filtre de commentaire est appliqué.",
	"emmetPreferencesFilterCommentTrigger": "Une liste séparée par des virgules de noms d’attributs qui devraient exister en abrégé pour que le filtre de commentaire soit appliqué"
}