/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"acceptSuggestionOnEnter": "Steuert, ob Vorschläge über die EINGABETASTE (zusätzlich zur TAB-TASTE) angenommen werden sollen. Vermeidet Mehrdeutigkeit zwischen dem Einfügen neuer Zeilen oder dem Annehmen von Vorschlägen.",
	"autoClosingBrackets": "Steuert, ob der Editor Klammern automatisch nach dem Öffnen schließt.",
	"cursorBlinking": "Steuert das Blinken der Cursoranimation. Gültige Werte sind \"blink\", \"visible\" und \"hidden\".",
	"cursorStyle": "Steuert den Cursorstil. Gültige Werte sind \"block\" und \"line\".",
	"detectIndentation": "Beim Öffnen einer Datei werden \"editor.tabSize\" und \"editor.insertSpaces\" basierend auf den Dateiinhalten erkannt.",
	"editorConfigurationTitle": "Editor-Konfiguration",
	"folding": "Steuert, ob für den Editor Codefaltung aktiviert ist.",
	"fontFamily": "Steuert die Schriftfamilie.",
	"fontLigatures": "Aktiviert Schriftartligaturen.",
	"fontSize": "Steuert den Schriftgrad.",
	"formatOnType": "Steuert, ob der Editor Zeilen automatisch nach der Eingabe formatiert.",
	"glyphMargin": "Steuert die Sichtbarkeit des Glyphenrands.",
	"hideCursorInOverviewRuler": "Steuert die Sichtbarkeit des Cursors im Übersichtslineal.",
	"ignoreTrimWhitespace": "Steuert, ob der Diff-Editor Änderungen in führenden oder nachgestellten Leerzeichen als Diffs anzeigt.",
	"insertSpaces": "Fügt beim Drücken der TAB-TASTE Leerzeichen ein.",
	"insertSpaces.errorMessage": "\"boolean\" wurde erwartet. Beachten Sie, dass der Wert \"auto\" durch die Einstellung \"editor.detectIndentation\" ersetzt wurde.",
	"lineHeight": "Steuert die Zeilenhöhe.",
	"lineNumbers": "Steuert die Sichtbarkeit der Zeilennummern.",
	"mouseWheelScrollSensitivity": "Ein Multiplikator, der für die Mausrad-Bildlaufereignisse \"deltaX\" und \"deltaY\" verwendet werden soll.",
	"overviewRulerLanes": "Steuert die Anzahl von Dekorationen, die an derselben Position im Übersichtslineal angezeigt werden.",
	"quickSuggestions": "Steuert, ob Schnellvorschläge während der Eingabe angezeigt werden.",
	"quickSuggestionsDelay": "Steuert die Verzögerung in ms für die Anzeige der Schnellvorschläge.",
	"referenceInfos": "Steuert, ob der Editor Verweisinformationen zu den Modi anzeigt, die dies unterstützen.",
	"renderWhitespace": "Steuert, ob der Editor Leerzeichen rendert.",
	"roundedSelection": "Steuert, ob die Auswahl runde Ecken aufweist.",
	"rulers": "Spalten, an denen vertikale Lineale angezeigt werden sollen",
	"scrollBeyondLastLine": "Legt fest, ob der Editor Bildläufe über die letzte Zeile hinaus ausführt.",
	"selectionHighlight": "Steuert, ob der Editor der Auswahl ähnelnde Übereinstimmungen hervorheben soll.",
	"sideBySide": "Steuert, ob der Diff-Editor das Diff nebeneinander oder inline anzeigt.",
	"suggestOnTriggerCharacters": "Steuert, ob Vorschläge automatisch bei der Eingabe von Triggerzeichen angezeigt werden.",
	"tabSize": "Die Anzahl der Leerzeichen, denen ein Tabstopp entspricht.",
	"tabSize.errorMessage": "\"number\" wurde erwartet. Beachten Sie, dass der Wert \"auto\" durch die Einstellung \"editor.detectIndentation\" ersetzt wurde.",
	"wordSeparators": "Zeichen, die als Worttrennzeichen verwendet werden, wenn wortbezogene Navigationen oder Vorgänge ausgeführt werden.",
	"wrappingColumn": "Steuert, nach wie vielen Zeichen der Editor einen Umbruch in die nächste Zeile ausführt. Durch das Festlegen auf 0 wird der Umbruch auf Viewportbreite aktiviert.",
	"wrappingIndent": "Steuert den Einzug der umbrochenen Zeilen. Der Wert kann \"none\", \"same\" oder \"indent\" sein."
}