/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"autoClosingBrackets": "Steuert, ob der Editor Klammern automatisch nach dem Öffnen schließt.",
	"editorConfigurationTitle": "Editor-Konfiguration",
	"fontFamily": "Steuert die Schriftfamilie.",
	"fontSize": "Steuert den Schriftgrad.",
	"formatOnType": "Steuert, ob der Editor Zeilen automatisch nach der Eingabe formatiert.",
	"glyphMargin": "Steuert die Sichtbarkeit des Glyphenrands.",
	"hideCursorInOverviewRuler": "Steuert die Sichtbarkeit des Cursors im Übersichtslineal.",
	"insertSpaces": "Steuert, ob der Editor Leerzeichen für Tabstopps einfügt. Zulässige Werte: \"auto\", true, false. Wenn \"auto festgelegt ist, wird der Wert beim Öffnen einer Datei geschätzt.",
	"lineHeight": "Steuert die Zeilenhöhe.",
	"lineNumbers": "Steuert die Sichtbarkeit der Zeilennummern.",
	"mouseWheelScrollSensitivity": "Ein Multiplikator, der für die Mausrad-Bildlaufereignisse \"deltaX\" und \"deltaY\" verwendet werden soll.",
	"overviewRulerLanes": "Steuert die Anzahl von Dekorationen, die an derselben Position im Übersichtslineal angezeigt werden.",
	"quickSuggestions": "Steuert, ob Schnellvorschläge während der Eingabe angezeigt werden.",
	"quickSuggestionsDelay": "Steuert die Verzögerung in ms für die Anzeige der Schnellvorschläge.",
	"referenceInfos": "Steuert, ob der Editor Verweisinformationen zu den Modi anzeigt, die dies unterstützen.",
	"renderWhitespace": "Steuert, ob der Editor Leerzeichen rendert.",
	"roundedSelection": "Steuert, ob die Auswahl runde Ecken aufweist.",
	"scrollBeyondLastLine": "Legt fest, ob der Editor Bildläufe über die letzte Zeile hinaus ausführt.",
	"selectionHighlight": "Steuert, ob der Editor der Auswahl ähnelnde Übereinstimmungen hervorheben soll.",
	"suggestOnTriggerCharacters": "Steuert, ob Vorschläge automatisch bei der Eingabe von Triggerzeichen angezeigt werden.",
	"tabSize": "Steuert die Renderinggröße von Tabstopps in Zeichen. Zulässige Werte: \"auto\", 2, 4, 6 usw. Wenn \"auto festgelegt ist, wird der Wert beim Öffnen einer Datei geschätzt.",
	"wrappingColumn": "Steuert, nach wie vielen Zeichen der Editor einen Umbruch in die nächste Zeile ausführt. Durch das Festlegen auf 0 wird der Umbruch auf Viewportbreite aktiviert.",
	"wrappingIndent": "Steuert den Einzug der umbrochenen Zeilen. Der Wert kann \"none\", \"same\" oder \"indent\" sein."
}