/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"LegacyProblemMatcherSchema.watchedBegin": "Espressione regolare con cui viene segnalato l'avvio dell'esecuzione di un'attività controllata attivato tramite il controllo dei file.",
	"LegacyProblemMatcherSchema.watchedBegin.deprecated": "Questa proprietà è deprecata. In alternativa, usare la proprietà watching.",
	"LegacyProblemMatcherSchema.watchedEnd": "Espressione regolare con cui viene segnalato il termine dell'esecuzione di un'attività controllata.",
	"LegacyProblemMatcherSchema.watchedEnd.deprecated": "Questa proprietà è deprecata. In alternativa, usare la proprietà watching.",
	"NamedMultiLineProblemPatternSchema.name": "Nome del criterio di problema a più righe.",
	"NamedMultiLineProblemPatternSchema.patterns": "Criteri effettivi.",
	"NamedProblemMatcherSchema.name": "Nome del matcher problemi.",
	"NamedProblemPatternSchema.name": "Nome del criterio di problema.",
	"PatternTypeSchema.description": "Criterio di problema o nome di un criterio di problema predefinito o aggiunto come contributo. Può essere omesso se si specifica base.",
	"PatternTypeSchema.name": "Nome di un criterio predefinito o aggiunto come contributo",
	"ProblemMatcherExtPoint": "Aggiunge come contributo i matcher problemi",
	"ProblemMatcherParser.invalidRegexp": "Errore: la stringa {0} non è un'espressione regolare valida.\n",
	"ProblemMatcherParser.noDefinedPatter": "Errore: il criterio con identificatore {0} non esiste.",
	"ProblemMatcherParser.noFileLocation": "Errore: la descrizione non definisce un percorso file:\n{0}\n",
	"ProblemMatcherParser.noIdentifier": "Errore: la proprietà del criterio fa riferimento a un identificatore vuoto.",
	"ProblemMatcherParser.noOwner": "Errore: la descrizione non definisce un proprietario:\n{0}\n",
	"ProblemMatcherParser.noProblemMatcher": "Errore: non è possibile convertire la descrizione in un matcher problemi:\n{0}\n",
	"ProblemMatcherParser.noProblemPattern": "Errore: la descrizione non definisce un criterio problema valido:\n{0}\n",
	"ProblemMatcherParser.noValidIdentifier": "Errore: la proprietà {0} del criterio non è un nome di variabile criterio valido.",
	"ProblemMatcherParser.problemPattern.watchingMatcher": "Un matcher problemi deve definire un criterio di inizio e un criterio di fine per il controllo.",
	"ProblemMatcherParser.unknownSeverity": "Info: gravità {0} sconosciuta. I valori validi sono errore, avviso e info.\n",
	"ProblemMatcherSchema.applyTo": "Controlla se un problema segnalato in un documento di testo è valido solo per i documenti aperti o chiusi oppure per tutti i documenti.",
	"ProblemMatcherSchema.base": "Nome di un matcher problemi di base da usare.",
	"ProblemMatcherSchema.fileLocation": "Consente di definire come interpretare i nomi file indicati in un criterio di problema.",
	"ProblemMatcherSchema.owner": "Proprietario del problema in Visual Studio Code. Può essere omesso se si specifica base. Se è omesso e non si specifica base, viene usato il valore predefinito 'external'.",
	"ProblemMatcherSchema.severity": "Gravità predefinita per i problemi di acquisizione. Viene usato se il criterio non definisce un gruppo di corrispondenze per la gravità.",
	"ProblemMatcherSchema.watching": "Criteri per tenere traccia dell'inizio e della fine di un criterio di controllo.",
	"ProblemMatcherSchema.watching.activeOnStart": "Se impostato su true, indica che il watcher è in modalità attiva all'avvio dell'attività. Equivale a inviare una riga che corrisponde al criterio di avvio",
	"ProblemMatcherSchema.watching.beginsPattern": "Se corrisponde nell'output, viene segnalato l'avvio di un'attività di controllo.",
	"ProblemMatcherSchema.watching.endsPattern": "Se corrisponde nell'output, viene segnalata la fine di un'attività di controllo.",
	"ProblemPatternExtPoint": "Aggiunge come contributo i criteri di problema",
	"ProblemPatternParser.invalidRegexp": "Errore: la stringa {0} non è un'espressione regolare valida.\n",
	"ProblemPatternParser.loopProperty.notLast": "La proprietà loop è supportata solo sul matcher dell'ultima riga.",
	"ProblemPatternParser.problemPattern.missingProperty": "Il criterio del problema non è valido. Deve includere almeno un gruppo di corrispondenze di tipo file, messaggio e riga o posizione.",
	"ProblemPatternParser.problemPattern.missingRegExp": "Nel criterio del problema manca un'espressione regolare.",
	"ProblemPatternRegistry.error": "Il criterio di problema non è valido e verrà ignorato.",
	"ProblemPatternSchema.code": "Indice del gruppo di corrispondenze del codice del problema. Il valore predefinito è undefined",
	"ProblemPatternSchema.column": "Indice del gruppo di corrispondenze del carattere di riga del problema. Il valore predefinito è 3",
	"ProblemPatternSchema.endColumn": "Indice del gruppo di corrispondenze del carattere di fine riga del problema. Il valore predefinito è undefined",
	"ProblemPatternSchema.endLine": "Indice del gruppo di corrispondenze della riga finale del problema. Il valore predefinito è undefined",
	"ProblemPatternSchema.file": "Indice del gruppo di corrispondenze del nome file. Se omesso, viene usato 1.",
	"ProblemPatternSchema.line": "Indice del gruppo di corrispondenze della riga del problema. Il valore predefinito è 2",
	"ProblemPatternSchema.location": "Indice del gruppo di corrispondenze della posizione del problema. I criteri di posizione validi sono: (line), (line,column) e (startLine,startColumn,endLine,endColumn). Se omesso, si presuppone che sia impostato su (line,column).",
	"ProblemPatternSchema.loop": "In un matcher di più righe il ciclo indica se questo criterio viene eseguito in un ciclo finché esiste la corrispondenza. Può essere specificato solo come ultimo criterio in un criterio su più righe.",
	"ProblemPatternSchema.message": "Indice del gruppo di corrispondenze del messaggio. Se omesso, il valore predefinito è 4 se si specifica la posizione; in caso contrario, il valore predefinito è 5.",
	"ProblemPatternSchema.regexp": "Espressione regolare per trovare un messaggio di tipo errore, avviso o info nell'output.",
	"ProblemPatternSchema.severity": "Indice del gruppo di corrispondenze della gravità del problema. Il valore predefinito è undefined",
	"WatchingPatternSchema.file": "Indice del gruppo di corrispondenze del nome file. Può essere omesso.",
	"WatchingPatternSchema.regexp": "Espressione regolare per rilevare l'inizio o la fine di un'attività di controllo."
}