/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"LegacyProblemMatcherSchema.watchedBegin": "Ein regulärer Ausdruck, der signalisiert, dass die Ausführung eines überwachten Tasks (ausgelöst durch die Dateiüberwachung) beginnt.",
	"LegacyProblemMatcherSchema.watchedBegin.deprecated": "Diese Eigenschaft ist veraltet. Verwenden Sie stattdessen die Überwachungseigenschaft.",
	"LegacyProblemMatcherSchema.watchedEnd": "Ein regulärer Ausdruck, der signalisiert, dass die Ausführung eines überwachten Tasks beendet wird.",
	"LegacyProblemMatcherSchema.watchedEnd.deprecated": "Diese Eigenschaft ist veraltet. Verwenden Sie stattdessen die Überwachungseigenschaft.",
	"NamedMultiLineProblemPatternSchema.name": "Der Name des mehrzeiligen Problemmusters.",
	"NamedMultiLineProblemPatternSchema.patterns": "Die aktuellen Muster.",
	"NamedProblemMatcherSchema.name": "Der Name des Problemabgleichers.",
	"NamedProblemPatternSchema.name": "Der Name des Problemmusters.",
	"PatternTypeSchema.description": "Ein Problemmuster oder der Name eines beigetragenen oder vordefinierten Problemmusters. Kann ausgelassen werden, wenn die Basis angegeben ist.",
	"PatternTypeSchema.name": "Der Name eines beigetragenen oder vordefinierten Musters",
	"ProblemMatcherExtPoint": "Trägt Problemabgleicher bei",
	"ProblemMatcherParser.invalidRegexp": "Fehler: Die Zeichenfolge {0} ist kein gültiger regulärer Ausdruck.\n",
	"ProblemMatcherParser.noDefinedPatter": "Fehler: Das Muster mit dem Bezeichner {0} ist nicht vorhanden.",
	"ProblemMatcherParser.noFileLocation": "Fehler: Die Beschreibung definiert keinen Dateispeicherort:\n{0}\n",
	"ProblemMatcherParser.noIdentifier": "Fehler: Die Mustereigenschaft verweist auf einen leeren Bezeichner.",
	"ProblemMatcherParser.noOwner": "Fehler: Die Beschreibung definiert keinen Besitzer:\n{0}\n",
	"ProblemMatcherParser.noProblemMatcher": "Fehler: Die Beschreibung kann nicht in einen Problemabgleich konvertiert werden:\n{0}\n",
	"ProblemMatcherParser.noProblemPattern": "Fehler: Die Beschreibung definiert kein gültiges Problemmuster:\n{0}\n",
	"ProblemMatcherParser.noValidIdentifier": "Fehler: Die Mustereigenschaft {0} ist kein gültiger Name für eine Mustervariable.",
	"ProblemMatcherParser.problemPattern.watchingMatcher": "Ein Problemmatcher muss ein Anfangsmuster und ein Endmuster für die Überwachung definieren.",
	"ProblemMatcherParser.unknownSeverity": "Info: unbekannter Schweregrad {0}. Gültige Werte sind Fehler, Warnung und Info.\n",
	"ProblemMatcherSchema.applyTo": "Steuert, ob ein für ein Textdokument gemeldetes Problem nur auf geöffnete, geschlossene oder alle Dokumente angewendet wird.",
	"ProblemMatcherSchema.base": "Der Name eines zu verwendenden Basisproblemabgleichers.",
	"ProblemMatcherSchema.fileLocation": "Definiert, wie Dateinamen interpretiert werden sollen, die in einem Problemmuster gemeldet werden.",
	"ProblemMatcherSchema.owner": "Der Besitzer des Problems im Code. Kann ausgelassen werden, wenn \"base\" angegeben wird. Der Standardwert ist \"external\", wenn keine Angabe erfolgt und \"base\" nicht angegeben wird.",
	"ProblemMatcherSchema.severity": "Der Standardschweregrad für Erfassungsprobleme. Dieser wird verwendet, wenn das Muster keine Übereinstimmungsgruppe für den Schweregrad definiert.",
	"ProblemMatcherSchema.watching": "Muster zum Nachverfolgen des Beginns und Endes eines Beobachtungsmusters.",
	"ProblemMatcherSchema.watching.activeOnStart": "Wenn dieser Wert auf \"true\" festgelegt wird, befindet sich die Überwachung im aktiven Modus, wenn der Task gestartet wird. Dies entspricht dem Ausgeben einer Zeile, die mit dem \"beginPattern\" übereinstimmt.",
	"ProblemMatcherSchema.watching.beginsPattern": "Wenn eine Übereinstimmung mit der Ausgabe vorliegt, wird der Start eines Überwachungstasks signalisiert.",
	"ProblemMatcherSchema.watching.endsPattern": "Wenn eine Übereinstimmung mit der Ausgabe vorliegt, wird das Ende eines Überwachungstasks signalisiert.",
	"ProblemPatternExtPoint": "Trägt Problemmuster bei",
	"ProblemPatternParser.invalidRegexp": "Fehler: Die Zeichenfolge {0} ist kein gültiger regulärer Ausdruck.\n",
	"ProblemPatternParser.loopProperty.notLast": "Die loop-Eigenschaft wird nur für Matcher für die letzte Zeile unterstützt.",
	"ProblemPatternParser.problemPattern.missingProperty": "Das Problemmuster ist ungültig. Es muss mindestens eine Datei, Nachricht und Zeile oder eine Speicherort-Übereinstimmungsgruppe aufweisen.",
	"ProblemPatternParser.problemPattern.missingRegExp": "Im Problemmuster fehlt ein regulärer Ausdruck.",
	"ProblemPatternRegistry.error": "Ungültiges Problemmuster. Das Muster wird ignoriert.",
	"ProblemPatternSchema.code": "Der Übereinstimmungsgruppenindex des Codes des Problems. Der Standardwert ist undefiniert.",
	"ProblemPatternSchema.column": "Der Übereinstimmungsgruppenindex des Zeilenzeichens des Problems. Der Standardwert ist 3.",
	"ProblemPatternSchema.endColumn": "Der Übereinstimmungsgruppenindex des Zeilenendezeichens des Problems. Der Standardwert ist undefiniert.",
	"ProblemPatternSchema.endLine": "Der Übereinstimmungsgruppenindex der Endzeile des Problems. Der Standardwert ist undefiniert.",
	"ProblemPatternSchema.file": "Der Übereinstimmungsgruppenindex des Dateinamens. Wenn keine Angabe erfolgt, wird 1 verwendet.",
	"ProblemPatternSchema.line": "Der Übereinstimmungsgruppenindex der Zeile des Problems. Der Standardwert ist 2.",
	"ProblemPatternSchema.location": "Der Übereinstimmungsgruppenindex der Position des Problems. Gültige Positionsmuster: (line), (line,column) und (startLine,startColumn,endLine,endColumn). Wenn keine Angabe erfolgt, wird (line,column) angenommen.",
	"ProblemPatternSchema.loop": "Gibt in einer mehrzeiligen Abgleichschleife an, ob dieses Muster in einer Schleife ausgeführt wird, wenn es übereinstimmt. Kann nur für ein letztes Muster in einem mehrzeiligen Muster angegeben werden.",
	"ProblemPatternSchema.message": "Der Übereinstimmungsgruppenindex der Nachricht. Wenn keine Angabe erfolgt, ist der Standardwert 4, wenn die Position angegeben wird. Andernfalls ist der Standardwert 5.",
	"ProblemPatternSchema.regexp": "Der reguläre Ausdruck zum Ermitteln eines Fehlers, einer Warnung oder von Informationen in der Ausgabe.",
	"ProblemPatternSchema.severity": "Der Übereinstimmungsgruppenindex des Schweregrads des Problems. Der Standardwert ist undefiniert.",
	"WatchingPatternSchema.file": "Der Übereinstimmungsgruppenindex des Dateinamens. Kann ausgelassen werden.",
	"WatchingPatternSchema.regexp": "Der reguläre Ausdruck zum Erkennen des Anfangs oder Endes eines Überwachungstasks."
}