/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"enableValidation": "Habilita o deshabilita todas las validaciones.",
	"rule.avoidFloat": "Le recomendamos no usar 'float'. Los floats producen CSS frágiles, fáciles de corromper si cambia cualquier aspecto del diseño.",
	"rule.avoidIdSelector": "Los selectores no deben contener identificadores porque estas reglas están estrechamente ligadas a HTML.",
	"rule.avoidImportant": "Le recomendamos no usar !important. Esto indica que la especificidad de todo el CSS está fuera de control y que debe refactorizarse.",
	"rule.colorFunction": "Número de parámetros no válido",
	"rule.duplicateDeclarations": "No use definiciones de estilo duplicadas.",
	"rule.emptyRuleSets": "No use conjuntos de reglas vacíos.",
	"rule.fontFaceProperties": "La regla @font-face debe definir las propiedades 'src' y 'font-family'.",
	"rule.hexColor": "Los colores hexadecimales deben estar formados por tres o seis números hexadecimales.",
	"rule.ieHack": "Las modificaciones de IE solo son necesarias cuando admiten IE7 y anteriores",
	"rule.importDirective": "Las instrucciones Import no se cargan en paralelo.",
	"rule.propertyIgnoredDueToDisplay": "La propiedad se ignora a causa de la pantalla. Por ejemplo, con 'display: inline', el ancho, el alto, el margen superior e inferior y las propiedades de float no tienen efecto.",
	"rule.standardvendorprefix.all": "Cuando use un prefijo específico del proveedor, incluya también la propiedad estándar.",
	"rule.universalSelector": "Se sabe que el selector universal (*) es lento.",
	"rule.unknownProperty": "Propiedad desconocida.",
	"rule.unknownVendorSpecificProperty": "Propiedad específica del proveedor desconocida.",
	"rule.vendorprefixes.all": "Cuando use un prefijo específico del proveedor, compruebe que también haya incluido el resto de propiedades específicas del proveedor.",
	"rule.withHeightAndBorderPadding": "No use ancho o alto con el relleno o los bordes.",
	"rule.zeroWidthUnit": "No se necesita una unidad para cero."
}