/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"acceptSuggestionOnEnter": "Contrôle si les suggestions peuvent être acceptées avec Entrée (en plus de Tab). Cela permet d'éviter toute ambiguïté entre l'insertion de nouvelles lignes et l'acceptation de suggestions.",
	"autoClosingBrackets": "Contrôle si l'éditeur doit automatiquement fermer les crochets après les avoir ouverts",
	"cursorBlinking": "Contrôle l'animation clignotante du curseur. Les valeurs acceptées sont 'blink', 'visible' et 'hidden'",
	"cursorStyle": "Contrôle le style du curseur. Les valeurs acceptées sont 'block' et 'line'",
	"detectIndentation": "Quand vous ouvrez un fichier, 'editor.tabSize' et 'editor.insertSpaces' sont détectés en fonction du contenu du fichier.",
	"editorConfigurationTitle": "Configuration de l'éditeur",
	"folding": "Contrôle si le pliage de code est activé dans l'éditeur",
	"fontFamily": "Contrôle la famille de polices.",
	"fontLigatures": "Active les ligatures de police",
	"fontSize": "Contrôle la taille de police.",
	"formatOnType": "Contrôle si l'éditeur doit automatiquement mettre en forme la ligne après la saisie",
	"glyphMargin": "Contrôle la visibilité de la marge des glyphes",
	"hideCursorInOverviewRuler": "Contrôle si le curseur doit être masqué dans la règle d'aperçu.",
	"ignoreTrimWhitespace": "Contrôle si l'éditeur de différences affiche les changements liés aux espaces blancs de début ou de fin comme des différences",
	"insertSpaces": "Insérer des espaces en appuyant sur Tab.",
	"insertSpaces.errorMessage": "'boolean' attendu. Notez que la valeur \"auto\" a été remplacée par le paramètre 'editor.detectIndentation'.",
	"lineHeight": "Contrôle la hauteur de ligne.",
	"lineNumbers": "Contrôle la visibilité des numéros de ligne",
	"mouseWheelScrollSensitivity": "Multiplicateur à utiliser pour le 'deltaX' et le 'deltaY' des événements de défilement de la roulette de la souris",
	"overviewRulerLanes": "Contrôle le nombre d'ornements pouvant s'afficher à la même position dans la règle d'aperçu",
	"parameterHints": "Active les indicateurs de paramètres",
	"quickSuggestions": "Contrôle si les suggestions rapides doivent s'afficher ou non pendant la saisie",
	"quickSuggestionsDelay": "Contrôle le délai en ms au bout duquel les suggestions rapides s'affichent",
	"referenceInfos": "Contrôle si l'éditeur affiche des informations de référence pour les modes qui le prennent en charge",
	"renderWhitespace": "Contrôle si l'éditeur doit restituer des espaces",
	"roundedSelection": "Contrôle si les sélections ont des angles arrondis",
	"rulers": "Colonnes où afficher les règles verticales",
	"scrollBeyondLastLine": "Contrôle si l'éditeur défile au-delà de la dernière ligne",
	"selectionClipboard": "Contrôle si le presse-papiers primaire Linux doit être pris en charge.",
	"selectionHighlight": "Détermine si l'éditeur doit surligner les correspondances similaires à la sélection",
	"sideBySide": "Contrôle si l'éditeur de différences affiche les différences en mode côte à côte ou inline",
	"stablePeek": "Garder les éditeurs d'aperçu ouverts même si l'utilisateur double-clique sur son contenu ou appuie sur la touche Échap.",
	"suggestOnTriggerCharacters": "Contrôle si les suggestions doivent s'afficher automatiquement durant la saisie de caractères de déclenchement",
	"tabSize": "Nombre d'espaces correspondant à une tabulation.",
	"tabSize.errorMessage": "'number' attendu. Notez que la valeur \"auto\" a été remplacée par le paramètre 'editor.detectIndentation'.",
	"wordSeparators": "Caractères utilisés comme séparateurs de mots durant la navigation ou les opérations basées sur les mots",
	"wrappingColumn": "Contrôle le nombre de caractères après lesquels l'éditeur effectue un retour automatique à la ligne suivante. Si vous affectez la valeur 0, le retour automatique à la ligne s'effectue en fonction de la largeur de la fenêtre d'affichage (retour automatique à la ligne). Si vous affectez la valeur -1, l'éditeur n'effectue jamais de retour automatique à la ligne.",
	"wrappingIndent": "Contrôle le retrait des lignes renvoyées. La valeur peut être 'none', 'same' ou 'indent'."
}