/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"autoClosingBrackets": "Contrôle si l'éditeur doit automatiquement fermer les crochets après les avoir ouverts",
	"editorConfigurationTitle": "Configuration de l'éditeur",
	"fontFamily": "Contrôle la famille de polices.",
	"fontSize": "Contrôle la taille de police.",
	"formatOnType": "Contrôle si l'éditeur doit automatiquement mettre en forme la ligne après la saisie",
	"glyphMargin": "Contrôle la visibilité de la marge des glyphes",
	"hideCursorInOverviewRuler": "Contrôle si le curseur doit être masqué dans la règle d'aperçu.",
	"insertSpaces": "Contrôle si l'éditeur insère des espaces pour les tabulations. Valeur acceptées : \"auto\", true, false. Si la valeur est \"auto\", elle est déterminée à l'ouverture d'un fichier.",
	"lineHeight": "Contrôle la hauteur de ligne.",
	"lineNumbers": "Contrôle la visibilité des numéros de ligne",
	"mouseWheelScrollSensitivity": "Multiplicateur à utiliser pour le 'deltaX' et le 'deltaY' des événements de défilement de la roulette de la souris",
	"overviewRulerLanes": "Contrôle le nombre d'ornements pouvant s'afficher à la même position dans la règle d'aperçu",
	"quickSuggestions": "Contrôle si les suggestions rapides doivent s'afficher ou non pendant la saisie",
	"quickSuggestionsDelay": "Contrôle le délai en ms au bout duquel les suggestions rapides s'affichent",
	"referenceInfos": "Contrôle si l'éditeur affiche des informations de référence pour les modes qui le prennent en charge",
	"renderWhitespace": "Contrôle si l'éditeur doit restituer des espaces",
	"roundedSelection": "Contrôle si les sélections ont des angles arrondis",
	"scrollBeyondLastLine": "Contrôle si l'éditeur défile au-delà de la dernière ligne",
	"selectionHighlight": "Détermine si l'éditeur doit surligner les correspondances similaires à la sélection",
	"suggestOnTriggerCharacters": "Contrôle si les suggestions doivent s'afficher automatiquement durant la saisie de caractères de déclenchement",
	"tabSize": "Contrôle la taille de rendu des tabulations parmi les caractères. Valeur acceptées : \"auto\", 2, 4, 6, etc. Si la valeur est \"auto\", elle est déterminée à l'ouverture d'un fichier.",
	"wrappingColumn": "Contrôle le nombre de caractères après lequel l'éditeur renvoie à la ligne suivante. La valeur 0 active le renvoi en fonction de la largeur de la fenêtre d'affichage",
	"wrappingIndent": "Contrôle le retrait des lignes renvoyées. La valeur peut être 'none', 'same' ou 'indent'."
}