/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"status.400": "Richiesta non valida. Non è possibile soddisfare la richiesta perché la sintassi non è valida.",
	"status.401": "Non autorizzato. Il server non risponde.",
	"status.403": "Accesso negato. Il server non risponde.",
	"status.404": "Non trovato. Il percorso richiesto non è stato trovato.",
	"status.405": "Metodo non consentito. Per effettuare la richiesta, è stato usato un metodo non supportato da tale posizione.",
	"status.406": "Non accettabile. Il server può solo generare una risposta non accettata dal client.",
	"status.407": "Autenticazione proxy obbligatoria. Il client deve prima eseguire l'autenticazione con il proxy.",
	"status.408": "Timeout richiesta. Si è verificato un timeout del server in attesa della richiesta.",
	"status.409": "Conflitto. Non è stato possibile completare la richiesta perché contiene un conflitto.",
	"status.410": "Non disponibile. La pagina richiesta non è più disponibile.",
	"status.411": "Lunghezza obbligatoria. Il valore \"Content-Length\" non è definito.",
	"status.412": "Precondizione non riuscita. Il server ha restituito false per la precondizione specificata nella richiesta.",
	"status.413": "Entità della richiesta troppo estesa. Il server non accetterà la richiesta perché l'entità della richiesta è troppo estesa.",
	"status.414": "URI della richiesta troppo lungo. Il server non accetterà la richiesta perché l'URL è troppo lungo.",
	"status.415": "Tipo di supporto non supportato. Il server non accetterà la richiesta perché il tipo di supporto non è supportato.",
	"status.416": "Codice di stato HTTP {0}",
	"status.500": "Errore interno del server.",
	"status.501": "Non implementato. Il server non riconosce il metodo della richiesta o non include la funzionalità necessaria per soddisfare la richiesta.",
	"status.503": "Servizio non disponibile. Il server non è attualmente disponibile perché in overload o inattivo."
}