/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"markdown.preview.doubleClickToSwitchToEditor.desc": "Разрешение двойного щелчка в параметрах предпросмотра Markdown в редакторе.",
	"markdown.preview.fontFamily.desc": "Определяет семейство шрифтов, используемое в области предварительного просмотра файла Markdown.",
	"markdown.preview.fontSize.desc": "Определяет размер шрифта (в пикселях), используемый в области предварительного просмотра файла Markdown.",
	"markdown.preview.lineHeight.desc": "Определяет высоту строки, используемую в области предварительного просмотра файла Markdown. Это значение задается относительно размера шрифта.",
	"markdown.preview.markEditorSelection.desc": "Выделение выбранного в текущем редакторе в предпросмотре Markdown.",
	"markdown.preview.scrollEditorWithPreview.desc": "При прокрутке предпросмотра Markdown обновите представление в редакторе.",
	"markdown.preview.scrollPreviewWithEditorSelection.desc": "Прокрутка предпросмотра Markdown до выбранной строки в редакторе.",
	"markdown.preview.title": "Открыть область предварительного просмотра",
	"markdown.previewFrontMatter.dec": "Определяет обработку титульных листов YAML в области предварительного просмотра файла Markdown. Значение \"скрыть\" удаляет титульные листы. В противном случае титульные листы обрабатываются как содержимое файла Markdown.",
	"markdown.previewSide.title": "Открыть область предварительного просмотра сбоку",
	"markdown.showSource.title": "Показать источник",
	"markdown.styles.dec": "Список URL-адресов или локальных путей к таблицам стилей CSS, используемых из области предварительного просмотра файла Markdown. Относительные пути интерпретируются относительно папки, открытой в проводнике. Если папка не открыта, они интерпретируются относительно расположения файла Markdown. Все символы \"\" должны записываться в виде \"\\\"."
}