/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"referencesFailre": "Échec de la résolution du fichier.",
	"referencesCount": "{0} références",
	"referenceCount": "{0} référence",
	"missingPreviewMessage": "aperçu non disponible",
	"treeAriaLabel": "Références",
	"noResults": "Aucun résultat",
	"peekView.alternateTitle": "Références",
	"peekViewTitleBackground": "Couleur d'arrière-plan de la zone de titre de l'affichage d'aperçu.",
	"peekViewTitleForeground": "Couleur du titre de l'affichage d'aperçu.",
	"peekViewTitleInfoForeground": "Couleur des informations sur le titre de l'affichage d'aperçu.",
	"peekViewBorder": "Couleur des bordures et de la flèche de l'affichage d'aperçu.",
	"peekViewResultsBackground": "Couleur d'arrière-plan de la liste des résultats de l'affichage d'aperçu.",
	"peekViewResultsMatchForeground": "Couleur de premier plan des noeuds de lignes dans la liste des résultats de l'affichage d'aperçu.",
	"peekViewResultsFileForeground": "Couleur de premier plan des noeuds de fichiers dans la liste des résultats de l'affichage d'aperçu.",
	"peekViewResultsSelectionBackground": "Couleur d'arrière-plan de l'entrée sélectionnée dans la liste des résultats de l'affichage d'aperçu.",
	"peekViewResultsSelectionForeground": "Couleur de premier plan de l'entrée sélectionnée dans la liste des résultats de l'affichage d'aperçu.",
	"peekViewEditorBackground": "Couleur d'arrière-plan de l'éditeur d'affichage d'aperçu.",
	"peekViewEditorGutterBackground": "Couleur d'arrière-plan de la bordure de l'éditeur d'affichage d'aperçu.",
	"peekViewResultsMatchHighlight": "Couleur de mise en surbrillance d'une correspondance dans la liste des résultats de l'affichage d'aperçu.",
	"peekViewEditorMatchHighlight": "Couleur de mise en surbrillance d'une correspondance dans l'éditeur de l'affichage d'aperçu."
}