/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"schema.json": "Beschreibt eine JSON-Datei mithilfe eines Schemas. Weitere Informationen finden Sie unter \"json-schema.org\".",
	"schema.json.$schema": "Das Schema, anhand dessen das Dokument überprüft wird. ",
	"schema.json.additionalItems": "Für Arrays. Gilt nur, wenn \"items\" als Array festgelegt ist. Wenn es sich um ein Schema handelt, überprüft dieses Schema Elemente nach den vom Elementarray angegebenen Elementen. Wenn der Wert \"false\" ist, führen zusätzliche Elemente zu Validierungsfehlern.",
	"schema.json.additionalProperties": "Ein Schema oder ein boolescher Wert. Wenn es sich um ein Schema handelt, werden alle Eigenschaften überprüft, die nicht mit \"Properties\" oder \"PatternProperties\" übereinstimmen. Wenn \"false\", bewirken alle Eigenschaften, die mit keiner dieser Angaben übereinstimmen, einen Schemafehler.",
	"schema.json.allOf": "Ein Array von Schemas, die alle übereinstimmen müssen.",
	"schema.json.anyOf": "Ein Array von Schemas, von denen mindestens ein Schema übereinstimmen muss.",
	"schema.json.default": "Ein Standardwert. Wird von Vorschlägen verwendet.",
	"schema.json.definitions": "Nicht für Überprüfungen verwendet. Platzieren Sie hier Teilschemas, auf die Sie inline mit $ref verweisen möchten.",
	"schema.json.dependencies": "Eine Zuordnung von Eigenschaftennamen zu einem Array von Eigenschaftennamen oder zu einem Schema. Ein Array von Eigenschaftennamen bedeutet, dass die Gültigkeit der im Schlüssel benannten Eigenschaft davon abhängt, ob die Eigenschaften im Array des Objekts vorhanden sind. Wenn der Wert ein Schema ist, wird dieses Schema nur dann auf das Objekt angewendet, wenn die Eigenschaft im Schlüssel für das Objekt vorhanden ist.",
	"schema.json.description": "Eine lange Beschreibung des Elements. Wird in Hovermenüs verwendet sowie in Vorschlägen.",
	"schema.json.enum": "Die Sammlung der gültigen Literalwerte.",
	"schema.json.exclusiveMaximum": "Definiert die maximum-Eigenschaft als exklusiv.",
	"schema.json.exclusiveMininum": "Definiert die minimum-Eigenschaft als exklusiv.",
	"schema.json.format": "Beschreibt das Format, das für den Wert erwartet wird.",
	"schema.json.id": "Ein eindeutiger Bezeichner für das Schema.",
	"schema.json.items": "Für Arrays. Kann ein Schema sein, anhand dessen jedes Element überprüft wird, oder ein Array von Schemas, anhand dessen jedes Element in der Reihenfolge überprüft wird (das erste Schema überprüft das erste Element, das zweite Schema überprüft das zweite Element usw.).",
	"schema.json.maxItems": "Die maximale Anzahl von Elementen, die sich innerhalb eines Arrays befinden können. Inklusiv.",
	"schema.json.maxLength": "Die maximale Länge einer Zeichenfolge.",
	"schema.json.maxProperties": "Die maximale Anzahl von Eigenschaften, die ein Objekt haben kann. Inklusiv.",
	"schema.json.maximum": "Der maximale numerische Wert, standardmäßig inklusiv.",
	"schema.json.minItems": "Die minimale Anzahl von Elementen, die sich in einem Array befinden können. Inklusiv.",
	"schema.json.minLength": "Die minimale Länge einer Zeichenfolge.",
	"schema.json.minProperties": "Die minimale Anzahl von Eigenschaften, die ein Objekt haben kann. Inklusiv.",
	"schema.json.minimum": "Der minimale numerische Wert, standardmäßig inklusiv.",
	"schema.json.multipleOf": "Eine Zahl, die den aktuellen Wert glatt teilen sollte (d. h. ohne Rest)",
	"schema.json.not": "Ein Schema, das nicht übereinstimmen darf.",
	"schema.json.oneOf": "Ein Array von Schemas, von denen genau ein Schema übereinstimmen muss.",
	"schema.json.pattern": "Ein regulärer Ausdruck, mit dem die Zeichenfolge verglichen wird. Er ist nicht implizit verankert.",
	"schema.json.patternProperties": "Eine Zuordnung von regulären Ausdrücken für Eigenschaftennamen zu Schemas zum Vergleichen von Eigenschaften.",
	"schema.json.properties": "Eine Zuordnung von Eigenschaftennamen zu Schemas für jede Eigenschaft.",
	"schema.json.required": "Ein Array von Zeichenfolgen, das die Namen aller für dieses Objekt erforderlichen Eigenschaften auflistet.",
	"schema.json.title": "Ein beschreibender Titel des Elements.",
	"schema.json.type": "Eine Zeichenfolge eines der grundlegenden Schematypen (\"number\", \"integer\", \"null\", \"array\", \"object\", \"boolean\", \"string\") oder ein Array aus Zeichenfolgen, das eine Teilmenge dieser Typen angibt.",
	"schema.json.uniqueItems": "Gibt an, dass alle Elemente im Array eindeutig sein müssen. Der Standardwert ist \"false\"."
}