{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"lineHighlight": "A kurzor pozícióján található sor kiemelési háttérszíne.",
	"lineHighlightBorderBox": "A kurzor pozícióján található sor keretszíne.",
	"rangeHighlight": "A kiemelt területek háttérszíne, pl. a gyors megnyitás és keresés funkcióknál. A színnek áttetszőnek kell lennie, hogy ne fedje el az alatta lévő dekorátorokat.",
	"rangeHighlightBorder": "A kiemelt területek körüli keret háttérszíne.",
	"caret": "A szerkesztőablak kurzorának színe.",
	"editorCursorBackground": "A szerkesztőablak kurzorának háttérszíne. Lehetővé teszik az olyan karakterek színének módosítását, amelyek fölött egy blokk-típusú kurzor áll.",
	"editorWhitespaces": "A szerkesztőablakban található szóköz karakterek színe.",
	"editorIndentGuides": "A szerkesztőablak segédvonalainak színe.",
	"editorLineNumbers": "A szerkesztőablak sorszámainak színe.",
	"editorActiveLineNumber": "A szerkesztőablak aktív sorához tartozó sorszám színe.",
	"editorRuler": "A szerkesztőablak sávjainak színe.",
	"editorCodeLensForeground": "A szerkesztőablakban található kódlencsék előtérszíne",
	"editorBracketMatchBackground": "Hozzátartozó zárójelek háttérszíne",
	"editorBracketMatchBorder": "Az összetartozó zárójelek dobozának színe",
	"editorOverviewRulerBorder": "Az áttekintő sáv keretszíne.",
	"editorGutter": "A szerkesztőablag margójának háttérszíne. A margón található a szimbólummargó és a sorszámok.",
	"errorForeground": "A hibákat jelző hullámvonal előtérszíne a szerkesztőablakban.",
	"errorBorder": "A hibákat jelző hullámvonal keretszíne a szerkesztőablakban.",
	"warningForeground": "A figyelmeztetéseket jelző hullámvonal előtérszíne a szerkesztőablakban.",
	"warningBorder": "A figyelmeztetéseket jelző hullámvonal keretszíne a szerkesztőablakban.",
	"infoForeground": "Az információkat jelző hullámvonal előtérszíne a szerkesztőablakban.",
	"infoBorder": "Az információkat jelző hullámvonal keretszíne a szerkesztőablakban. ",
	"hintForeground": "Az utalásokat jelző hullámvonal előtérszíne a szerkesztőablakban.",
	"hintBorder": "Az utalásokat jelző hullámvonal keretszíne a szerkesztőablakban.",
	"overviewRulerRangeHighlight": "A kiemelt területeket jelölő jelzések színe az áttekintősávon. A színnek áttetszőnek kell lennie, hogy ne fedje el az alatta lévő dekorátorokat.",
	"overviewRuleError": "A hibákat jelölő jelzések színe az áttekintősávon.",
	"overviewRuleWarning": "A figyelmeztetéseket jelölő jelzések színe az áttekintősávon.",
	"overviewRuleInfo": "Az információkat jelölő jelzések színe az áttekintősávon."
}