/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"acceptSuggestionOnEnter": "Controla si las sugerencias deben aceptarse (\"Entrar\" además de \"TAB\"). Ayuda a evitar la ambigüedad entre insertar nuevas líneas o aceptar sugerencias.",
	"autoClosingBrackets": "Controla si el editor debe cerrar automáticamente los corchetes después de abrirlos",
	"cursorBlinking": "Controla la animación intermitente del cursor. Los valores aceptados son \"blink\", \"visible\" y \"hidden\".",
	"cursorStyle": "Controla el estilo del cursor. Los valores aceptados son \"block\" y \"line\".",
	"detectIndentation": "Al abrir un archivo, se detectarán `editor.tabSize` y `editor.insertSpaces` en función del contenido del archivo.",
	"editorConfigurationTitle": "Configuración del editor",
	"folding": "Controla si el editor tiene habilitado el plegado de código.",
	"fontFamily": "Controla la familia de fuentes.",
	"fontLigatures": "Habilita las ligaduras tipográficas.",
	"fontSize": "Controla el tamaño de la fuente.",
	"formatOnType": "Controla si el editor debe dar formato automáticamente a la línea después de escribirla",
	"glyphMargin": "Controla la visibilidad del margen del glifo",
	"hideCursorInOverviewRuler": "Controla si el cursor debe ocultarse en la regla de visión general.",
	"ignoreTrimWhitespace": "Controla si el editor de diferencias muestra los cambios de espacio inicial o espacio final como diferencias.",
	"insertSpaces": "Insertar espacios al presionar TAB.",
	"insertSpaces.errorMessage": "Se esperaba \"boolean\". Tenga en cuenta que el ajuste \"editor.detectIndentation\" ha reemplazado al valor \"auto\".",
	"lineHeight": "Controla la altura de línea.",
	"lineNumbers": "Controla la visibilidad de los números de línea",
	"mouseWheelScrollSensitivity": "Se utilizará un multiplicador en los eventos de desplazamiento de la rueda del mouse `deltaX` y `deltaY`",
	"overviewRulerLanes": "Controla el número de decoraciones que pueden aparecer en la misma posición en la regla de visión general",
	"quickSuggestions": "Controla si van a aparecer sugerencias rápidas mientras se escribe",
	"quickSuggestionsDelay": "Controla el retardo en ms tras el cual aparecerán sugerencias rápidas",
	"referenceInfos": "Controla si el editor muestra información de referencia para los modos compatibles",
	"renderWhitespace": "Controla si el editor debe representar los espacios en blanco",
	"roundedSelection": "Controla si las selecciones tienen esquinas redondeadas",
	"rulers": "Columnas en las que mostrar reglas verticales",
	"scrollBeyondLastLine": "Controla si el editor se seguirá desplazando después de la última línea",
	"selectionHighlight": "Controla si el editor debería destacar coincidencias similares a la selección",
	"sideBySide": "Controla si el editor de diferencias muestra las diferencias en paralelo o alineadas.",
	"suggestOnTriggerCharacters": "Controla si las sugerencias deben aparecer de forma automática al escribir caracteres desencadenadores",
	"tabSize": "El número de espacios a los que equivale una tabulación.",
	"tabSize.errorMessage": "Se esperaba \"number\". Tenga en cuenta que el ajuste \"editor.detectIndentation\" ha reemplazado al valor \"auto\".",
	"wordSeparators": "Caracteres que se usarán como separadores de palabras al realizar operaciones o navegaciones relacionadas con palabras.",
	"wrappingColumn": "Controla el número de caracteres tras los cuales el editor salta a la línea siguiente. Si el valor se establece en 0, se activa el ajuste del ancho de la ventanilla",
	"wrappingIndent": "Controla el sangrado de las líneas ajustadas. Puede ser uno los valores 'none', 'same' o 'indent'."
}