/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"autoClosingBrackets": "Controla si el editor debe cerrar automáticamente los corchetes después de abrirlos",
	"editorConfigurationTitle": "Configuración del editor",
	"fontFamily": "Controla la familia de fuentes.",
	"fontSize": "Controla el tamaño de la fuente.",
	"formatOnType": "Controla si el editor debe dar formato automáticamente a la línea después de escribirla",
	"glyphMargin": "Controla la visibilidad del margen del glifo",
	"hideCursorInOverviewRuler": "Controla si el cursor debe ocultarse en la regla de visión general.",
	"insertSpaces": "Controla si el editor insertará espacios para las tabulaciones. Valores admitidos: \"auto\", true, false. Si se establece en \"auto\", el valor se estimará cuando se abra un archivo.",
	"lineHeight": "Controla la altura de línea.",
	"lineNumbers": "Controla la visibilidad de los números de línea",
	"mouseWheelScrollSensitivity": "Se utilizará un multiplicador en los eventos de desplazamiento de la rueda del mouse `deltaX` y `deltaY`",
	"overviewRulerLanes": "Controla el número de decoraciones que pueden aparecer en la misma posición en la regla de visión general",
	"quickSuggestions": "Controla si van a aparecer sugerencias rápidas mientras se escribe",
	"quickSuggestionsDelay": "Controla el retardo en ms tras el cual aparecerán sugerencias rápidas",
	"referenceInfos": "Controla si el editor muestra información de referencia para los modos compatibles",
	"renderWhitespace": "Controla si el editor debe representar los espacios en blanco",
	"roundedSelection": "Controla si las selecciones tienen esquinas redondeadas",
	"scrollBeyondLastLine": "Controla si el editor se seguirá desplazando después de la última línea",
	"selectionHighlight": "Controla si el editor debería destacar coincidencias similares a la selección",
	"suggestOnTriggerCharacters": "Controla si las sugerencias deben aparecer de forma automática al escribir caracteres desencadenadores",
	"tabSize": "Controla el ajuste del tamaño de los tabuladores en los caracteres. Valores admitidos: \"auto\", 2, 4, 6, etc. Si se establece en \"auto\", el valor se estimará cuando se abra un archivo.",
	"wrappingColumn": "Controla el número de caracteres tras los cuales el editor salta a la línea siguiente. Si el valor se establece en 0, se activa el ajuste del ancho de la ventanilla",
	"wrappingIndent": "Controla el sangrado de las líneas ajustadas. Puede ser uno los valores 'none', 'same' o 'indent'."
}