/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"schema.json": "Описывает JSON-файл с использованием схемы. Дополнительные сведения см. на веб-сайте json-schema.org.",
	"schema.json.$schema": "Схема, с использованием которой будет проверяться этот документ ",
	"schema.json.additionalItems": "Для массивов, только когда элементы заданы в виде массива. Если это схема, эта схема проверяет элементы после тех, которые заданы массивом элементов. Если значение равно false, дополнительные элементы вызывают сбой проверки.",
	"schema.json.additionalProperties": "Схема или логическое значение. Если это схема, она используется для проверки всех свойств, не сопоставленных с параметром \"properties\" или \"patternProperties\". Если значение равно false, любые свойства, не сопоставленные ни с одним из этих параметров, вызывают ошибку схемы.",
	"schema.json.allOf": "Массив схем, все из которых должны соответствовать.",
	"schema.json.anyOf": "Массив схем, хотя бы одна из которых должна соответствовать.",
	"schema.json.default": "Значение по умолчанию. Используется предложениями.",
	"schema.json.definitions": "Не используется для проверки. Поместите сюда вложенные схемы, на которые требуется ссылаться в строке с помощью $ref",
	"schema.json.dependencies": "Сопоставление имен свойств с массивом имен свойств или схеме. Массив имен свойств означает, что допустимость свойства, именованного в ключе, зависит от свойств массива, присутствующих в объекте. Если значение — схема, эта схема применима к объекту только в том случае, если свойство ключа существует в объекте.",
	"schema.json.description": "Длинное описание элемента. Используется в меню, отображаемых при наведении, и предложениях.",
	"schema.json.enum": "Набор допустимых значений литерала",
	"schema.json.exclusiveMaximum": "Делает максимальное свойство эксклюзивным.",
	"schema.json.exclusiveMininum": "Делает минимальное свойство эксклюзивным.",
	"schema.json.format": "Описание формата, ожидаемого для значения.",
	"schema.json.id": "Уникальный идентификатор для схемы.",
	"schema.json.items": "Для массивов. Может являться схемой, относительно которой проверяется каждый элемент, или массивом схем, относительно которого проверяется каждый элемент по порядку (первая схема проверяет первый элемент, вторая схема проверяет второй элемент и так далее).",
	"schema.json.maxItems": "Максимальное число элементов, которые могут находиться внутри массива. Включительно.",
	"schema.json.maxLength": "Максимальная длина строки.",
	"schema.json.maxProperties": "Максимальное число свойств, которыми может обладать объект. Включительно.",
	"schema.json.maximum": "Максимальное числовое значение, включенное по умолчанию.",
	"schema.json.minItems": "Минимальное число элементов, которые могут находиться внутри массива. Включительно.",
	"schema.json.minLength": "Минимальная длина строки.",
	"schema.json.minProperties": "Минимальное число свойств, которыми может обладать объект. Включительно.",
	"schema.json.minimum": "Минимальное числовое значение, включенное по умолчанию.",
	"schema.json.multipleOf": "Число, которое должно разделять текущее значение без остатка",
	"schema.json.not": "Схема, которая не должна соответствовать.",
	"schema.json.oneOf": "Массив схем, из которых должна соответствовать только одна.",
	"schema.json.pattern": "Регулярное выражение, относительно которого сопоставляется строка. Оно не является неявно прикрепленным.",
	"schema.json.patternProperties": "Сопоставление регулярных выражений в именах со свойствами схем для соответствующих свойств.",
	"schema.json.properties": "Сопоставление имен свойств со схемами для каждого свойства.",
	"schema.json.required": "Массив строк, перечисляющий имена всех свойств, необходимых в этом объекте.",
	"schema.json.title": "Описательное название элемента",
	"schema.json.type": "Строка одного из базовых типов схем (число, целое число, значение NULL, массив, объект, логическое значение, строка) или массив строк, задающий подмножество тех типов.",
	"schema.json.uniqueItems": "Если все элементы массива должны быть уникальными. По умолчанию имеет значение false."
}