{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"previewOnGitHub": "Anteprima in GitHub",
	"loadingData": "Caricamento dei dati...",
	"similarIssues": "Problemi simili",
	"open": "Apri",
	"closed": "Chiuso",
	"noResults": "Non sono stati trovati risultati",
	"settingsSearchIssue": "Problema di ricerca impostazioni",
	"bugReporter": "Segnalazione bug",
	"performanceIssue": "Problema di prestazioni",
	"featureRequest": "Richiesta di funzionalità",
	"stepsToReproduce": "Passi da riprodurre",
	"bugDescription": "Indicare i passaggi necessari per riprodurre il problema in modo affidabile. Includere i risultati effettivi e quelli previsti. È supportato il linguaggio Markdown per GitHub. Sarà possibile modificare il problema e aggiungere screenshot quando verrà visualizzato in anteprima in GitHub.",
	"performanceIssueDesciption": "Quando si è verificato questo problema di prestazioni? All'avvio o dopo una serie specifiche di azioni? È supportato il linguaggio Markdown per GitHub. Sarà possibile modificare il problema e aggiungere screenshot quando verrà visualizzato in anteprima in GitHub.",
	"description": "Descrizione",
	"featureRequestDescription": "Descrivere la funzionalità desiderata. È supportato il linguaggio Markdown per GitHub. Sarà possibile modificare il problema e aggiungere screenshot quando verrà visualizzato in anteprima in GitHub.",
	"expectedResults": "Risultati previsti",
	"settingsSearchResultsDescription": "Elencare i risultati che si prevedeva di visualizzare durante la ricerca con questa query. È supportato il linguaggio Markdown per GitHub. Sarà possibile modificare il problema e aggiungere screenshot quando verrà visualizzato in anteprima in GitHub.",
	"pasteData": "I dati necessari sono stati scritti negli appunti perché erano eccessivi per l'invio. Incollarli.",
	"disabledExtensions": "Le estensioni sono disabilitate"
}