/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"ShowAccessibilityHelpAction": "Visualizza la Guida sull'accessibilità",
	"experimentalScreenReaderOptsOn": "Il supporto per l'utilità per la lettura dello schermo sperimentale è attivato perché è presente la chiave delle impostazioni editor.experimentalScreenReader.",
	"experimentalScreenReaderSessionOff": "Il supporto per l'utilità per la lettura dello schermo sperimentale è disattivato. Per attivarlo per questa sessione, premere {0}; per attivarlo per tutte le sessioni, impostare editor.experimentalScreenReader su true.",
	"experimentalScreenReaderSessionOffNoKb": "Il supporto per l'utilità per la lettura dello schermo sperimentale è disattivato. Il comando {0} non è attualmente attivabile con un tasto di scelta rapida. Per attivarlo per tutte le sessioni, impostare editor.experimentalScreenReader su true.",
	"experimentalScreenReaderSessionOn": "Il supporto per l'utilità per la lettura dello schermo sperimentale è attivato per questa sessione. Per attivare/disattivare questo comportamento, premere {0}.",
	"experimentalScreenReaderSessionOnNoKb": "Il supporto per l'utilità per la lettura dello schermo sperimentale è attivato per questa sessione. Il comando {0} non può essere attualmente attivato con un tasto di scelta rapida.",
	"introMsg": "Grazie per aver provato le opzioni di accessibilità sperimentali di Visual Studio Code.",
	"outroMsg": "Per chiudere questa descrizione comando e tornare all'editor, premere ESC.",
	"status": "Stato:",
	"tabFocusModeOffMsg": "Premere TAB in questo editor per inserire il carattere di tabulazione. Per attivare/disattivare questo comportamento, premere {0}.",
	"tabFocusModeOffMsgNoKb": "Premere TAB in questo editor per spostare lo stato attivo sull'elemento con stato attivabile successivo. Il comando {0} non può essere attualmente attivato con un tasto di scelta rapida.",
	"tabFocusModeOnMsg": "Premere TAB in questo editor per spostare lo stato attivo sull'elemento con stato attivabile successivo. Per attivare/disattivare questo comportamento, premere {0}.",
	"tabFocusModeOnMsgNoKb": "Premere TAB in questo editor per spostare lo stato attivo sull'elemento con stato attivabile successivo. Il comando {0} non può essere attualmente attivato con un tasto di scelta rapida."
}