/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"schema.json": "Décrit un fichier JSON à l'aide d'un schéma. Voir json-schema.org pour plus d'infos.",
	"schema.json.$schema": "Schéma servant à la vérification de ce document ",
	"schema.json.additionalItems": "Pour les tableaux, uniquement quand les éléments sont définis comme tableau. S'il s'agit d'un schéma, celui-ci valide les éléments après ceux spécifiés par le tableau d'éléments. Si la valeur est false, les éléments supplémentaires entraînent l'échec de la validation.",
	"schema.json.additionalProperties": "Schéma ou booléen. S'il s'agit d'un schéma, il est utilisé pour valider toutes les propriétés non mises en correspondance par 'properties' ou 'patternProperties'. Si la valeur est false, les propriétés non mises en correspondance entraînent l'échec du schéma.",
	"schema.json.allOf": "Tableau de schémas qui doivent tous correspondre.",
	"schema.json.anyOf": "Tableau de schémas dont au moins un doit correspondre.",
	"schema.json.default": "Valeur par défaut. Utilisée par les suggestions.",
	"schema.json.definitions": "Non utilisé pour la validation. Placez ici les sous-schémas à référencer inline avec $ref",
	"schema.json.dependencies": "Mappage des noms de propriétés à un tableau de noms de propriétés ou un schéma. Dans le cas d'un tableau de noms de propriétés, la propriété nommée dans la clé est valide uniquement si les propriétés du tableau sont présentes dans l'objet. Si la valeur est un schéma, celui-ci est uniquement appliqué à l'objet si la propriété dans la clé existe sur l'objet.",
	"schema.json.description": "Description longue de l'élément. Utilisée dans les menus sensitifs et les suggestions.",
	"schema.json.enum": "Ensemble des valeurs littérales valides",
	"schema.json.exclusiveMaximum": "Rend la propriété maximum exclusive.",
	"schema.json.exclusiveMininum": "Rend la propriété minimum exclusive.",
	"schema.json.format": "Décrit le format attendu pour la valeur.",
	"schema.json.id": "Identificateur unique du schéma.",
	"schema.json.items": "Pour les tableaux. Peut être soit un schéma en fonction duquel valider chaque élément, soit un tableau de schémas en fonction duquel valider chaque élément dans l'ordre (le premier schéma valide le premier élément, le deuxième schéma valide le deuxième élément, etc.).",
	"schema.json.maxItems": "Nombre maximum d'éléments pouvant figurer dans un tableau (inclusif).",
	"schema.json.maxLength": "Longueur maximum d'une chaîne.",
	"schema.json.maxProperties": "Nombre maximum de propriétés d'un objet (inclusif).",
	"schema.json.maximum": "Valeur numérique maximum, inclusive par défaut.",
	"schema.json.minItems": "Nombre minimum d'éléments pouvant figurer dans un tableau (inclusif).",
	"schema.json.minLength": "Longueur minimum d'une chaîne.",
	"schema.json.minProperties": "Nombre minimum de propriétés d'un objet (inclusif).",
	"schema.json.minimum": "Valeur numérique minimum, inclusive par défaut.",
	"schema.json.multipleOf": "Nombre qui doit diviser parfaitement la valeur actuelle (sans reste)",
	"schema.json.not": "Schéma qui ne doit pas correspondre.",
	"schema.json.oneOf": "Tableau de schémas, dont exactement un doit correspondre.",
	"schema.json.pattern": "Expression régulière à mettre en correspondance avec la chaîne. Elle n'est pas implicitement ancrée.",
	"schema.json.patternProperties": "Mappage d'expressions régulières sur les noms de propriété avec les schémas des propriétés correspondantes.",
	"schema.json.properties": "Mappage des noms de propriété avec les schémas de chaque propriété.",
	"schema.json.required": "Tableau de chaînes qui répertorie les noms de toutes les propriétés nécessaires sur cet objet.",
	"schema.json.title": "Titre descriptif de l'élément",
	"schema.json.type": "Chaîne d'un des types de schéma de base (nombre, entier, Null, tableau, objet, booléen ou chaîne) ou tableau de chaînes spécifiant un sous-ensemble de ces types.",
	"schema.json.uniqueItems": "Si tous les éléments du tableau doivent être uniques. La valeur par défaut est false."
}