/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"lineHighlight": "Cor de fundo para a posição do cursor  na seleção de linhas.",
	"lineHighlightBorderBox": "Cor de fundo para a borda em volta da linha na posição do cursor",
	"rangeHighlight": "Cor de fundo dos ranges selecionados, assim como abertura instantânea e descoberta de recursos ",
	"caret": "Cor do cursor no editor.",
	"editorCursorBackground": "A cor de fundo do cursor do editor. Permite customizar a cor de um caractere sobreposto pelo bloco do cursor.",
	"editorWhitespaces": "Cor dos caracteres em branco no editor",
	"editorIndentGuides": "Cor das guias de indentação do editor.",
	"editorLineNumbers": "Cor dos números de linha do editor.",
	"editorRuler": "Cor das réguas do editor.",
	"editorCodeLensForeground": "Cor do primeiro plano das lentes de código do editor",
	"editorBracketMatchBackground": "Cor de fundo atrás do colchetes correspondentes",
	"editorBracketMatchBorder": "Cor para as caixas de colchetes correspondentes",
	"editorOverviewRulerBorder": "Cor da borda da régua de visão geral.",
	"editorGutter": "Cor de fundo da separação do editor.O separador contém os glifos das margens e os números de linha.",
	"errorForeground": "Cor do primeiro plano das linhas onduladas de erro no editor.",
	"errorBorder": "Cor da borda das linhas onduladas de erro no editor.",
	"warningForeground": "Cor do primeiro plano de linhas onduladas de aviso no editor.",
	"warningBorder": "Cor da borda das linhas onduladas de aviso no editor.",
	"overviewRulerRangeHighlight": "Visão geral da cor do marcador da régua para intervalos de destaques.",
	"overviewRuleError": "Visão geral da cor do marcador da régua para erros.",
	"overviewRuleWarning": "Visão geral da cor do marcador da régua para avisos.",
	"overviewRuleInfo": "Visão geral da cor do marcador da régua para informações."
}