/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"enableValidation": "Abilita o disabilita tutte le convalide",
	"rule.avoidFloat": "Evitare di usare 'float'. Con gli elementi float si ottiene codice CSS che causa facilmente interruzioni in caso di modifica di un aspetto del layout.",
	"rule.avoidIdSelector": "I selettori non devono contenere ID perché queste regole sono strettamente accoppiate al codice HTML.",
	"rule.avoidImportant": "Evitare di usare !important perché indica che la specificità dell'intero codice CSS non è più controllabile ed è necessario effettuarne il refactoring.",
	"rule.colorFunction": "Numero di parametri non valido",
	"rule.duplicateDeclarations": "Non usare definizioni di stile duplicate",
	"rule.emptyRuleSets": "Non usare set di regole vuoti",
	"rule.fontFaceProperties": "La regola @font-face deve definire le proprietà 'src' e 'font-family'",
	"rule.hexColor": "I colori esadecimali devono essere composti da tre o sei numeri esadecimali",
	"rule.ieHack": "Gli hack IE sono necessari solo per il supporto di IE7 e versioni precedenti",
	"rule.importDirective": "Le istruzioni Import non vengono caricate in parallelo",
	"rule.propertyIgnoredDueToDisplay": "La proprietà viene ignorata a causa della visualizzazione. Ad esempio, con 'display: inline', le proprietà width, height, margin-top, margin-bottom e float non hanno effetto",
	"rule.standardvendorprefix.all": "Quando si usa un prefisso specifico del fornitore, includere anche la proprietà standard",
	"rule.universalSelector": "Il selettore universale (*) è notoriamente lento",
	"rule.unknownProperty": "Proprietà sconosciuta.",
	"rule.unknownVendorSpecificProperty": "Proprietà specifica del fornitore sconosciuta.",
	"rule.vendorprefixes.all": "Quando si usa un prefisso specifico del fornitore, assicurarsi di includere anche tutte le altre proprietà specifiche del fornitore",
	"rule.withHeightAndBorderPadding": "Non usare width o height con padding o border",
	"rule.zeroWidthUnit": "Non è necessaria alcuna unità per lo zero"
}