/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"html.format.enable.desc": "Abilita/Disabilita il formattatore HTML predefinito",
	"html.format.wrapLineLength.desc": "Numero massimo di caratteri per riga (0 = disabilita).",
	"html.format.unformatted.desc": "Elenco di tag, separati da virgole, che non devono essere riformattati. Con 'null' viene usata l'impostazione predefinita che prevede l'uso di tutti i tag elencati in https://www.w3.org/TR/html5/dom.html#phrasing-content.",
	"html.format.contentUnformatted.desc": "Elenco di tag, separati da virgole, in cui il contenuto non deve essere riformattato. Per impostazione predefinita, con 'null' viene usato il tag 'pre'.",
	"html.format.indentInnerHtml.desc": "Imposta un rientro per le sezioni <head> e <body>.",
	"html.format.preserveNewLines.desc": "Indica se è necessario mantenere interruzioni di riga esistenti prima degli elementi. Funziona solo prima degli elementi e non all'interno di tag o per il testo.",
	"html.format.maxPreserveNewLines.desc": "Numero massimo di interruzioni di riga da mantenere in un unico blocco. Per non impostare un numero massimo, usare 'null'.",
	"html.format.indentHandlebars.desc": "Applica la formattazione e imposta un rientro per {{#foo}} e {{/foo}}.",
	"html.format.endWithNewline.desc": "Termina con un carattere di nuova riga.",
	"html.format.extraLiners.desc": "Elenco di tag, separati da virgole, che devono essere preceduti da un carattere di nuova riga. Con 'null' viene usata l'impostazione predefinita \"head, body, /html\".",
	"html.format.wrapAttributes.desc": "Esegue il wrapping degli attributi.",
	"html.format.wrapAttributes.auto": "Esegue il wrapping degli attributi solo quando viene superata la lunghezza di riga.",
	"html.format.wrapAttributes.force": "Esegue il wrapping di ogni attributo ad eccezione del primo.",
	"html.format.wrapAttributes.forcealign": "Esegue il wrapping di ogni attributo ad eccezione del primo e mantiene l'allineamento.",
	"html.format.wrapAttributes.forcemultiline": "Esegue il wrapping di ogni attributo.",
	"html.suggest.angular1.desc": "Consente di configurare se il supporto del linguaggio HTML predefinito suggerisce tag e proprietà di Angular V1.",
	"html.suggest.ionic.desc": "Consente di configurare se il supporto del linguaggio HTML predefinito suggerisce tag, proprietà e valori di Ionic.",
	"html.suggest.html5.desc": "Consente di configurare se il supporto del linguaggio HTML predefinito suggerisce tag, proprietà e valori di HTML5.",
	"html.trace.server.desc": "Traccia la comunicazione tra VS Code e il server del linguaggio HTML.",
	"html.validate.scripts": "Consente di configurare se il supporto del linguaggio HTML predefinito convalida gli script incorporati.",
	"html.validate.styles": "Consente di configurare se il supporto del linguaggio HTML predefinito convalida gli stili incorporati.",
	"html.autoClosingTags": "Abilita/Disabilita la chiusura automatica dei tag HTML."
}