{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"previewOnGitHub": "Előnézet GitHubon",
	"loadingData": "Adatok betöltése...",
	"similarIssues": "Hasonló problémák",
	"open": "Megnyitás",
	"closed": "Bezárva",
	"noResults": "Nincs találat",
	"settingsSearchIssue": "Hiba a beállítások keresőjében",
	"bugReporter": "hibát",
	"performanceIssue": "teljesítményproblémát",
	"featureRequest": "funkcióigényt",
	"stepsToReproduce": "A probléma előidézésének lépései",
	"bugDescription": "Ossza meg a probléma megbízható előidézéséhez szükséges részleteket! Írja le a valós és az elvárt működést! A mezőben GitHub-stílusú markdown használható. A hibajelentés szerkeszthető lesz és képernyőfotók is csatolhatók a githubos előnézetnél.",
	"performanceIssueDesciption": "Mikor fordult elő ez a teljesítménybeli probléma? Például előfordul indulásnál vagy végre kell hajtani bizonyos műveleteket? A mezőben GitHub-stílusú markdown használható. A hibajelentés szerkeszthető lesz és képernyőfotók is csatolhatók a githubos előnézetnél.",
	"description": "Leírás",
	"featureRequestDescription": "Írja körül a funkciót, amit látni szeretne! A mezőben GitHub-stílusú markdown használható. A hibajelentés szerkeszthető lesz és képernyőfotók is csatolhatók a githubos előnézetnél.",
	"expectedResults": "Elvárt működés",
	"settingsSearchResultsDescription": "Írja le, hogy milyen találatokat szeretett volna kapni, amikor ezzel a keresőkifejezéssel keresett! A mezőben GitHub-stílusú markdown használható. A hibajelentés szerkeszthető lesz és képernyőfotók is csatolhatók a githubos előnézetnél.",
	"urlLengthError": "Az adat túllépi a(z) {0} karakteres korlátot. Hossza: {1} karakter.",
	"disabledExtensions": "A kiegészítők le vannak tiltva."
}