/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"autoClosingBrackets": "Управляет параметром, определяющим, должен ли редактор автоматически закрывать скобки после открытия.",
	"editorConfigurationTitle": "Конфигурация редактора",
	"fontFamily": "Управляет семейством шрифтов.",
	"fontSize": "Управляет размером шрифтов.",
	"formatOnType": "Управляет параметром, определяющим, должен ли редактор автоматически форматировать строку после ввода.",
	"glyphMargin": "Управляет видимостью полей глифа.",
	"hideCursorInOverviewRuler": "Управляет скрытием курсора в обзорной линейке.",
	"insertSpaces": "Управляет тем, будет ли редактор вставлять пробелы вместо табуляции. Допустимые значения: \"auto\", true, false. Если задан параметр \"auto\", значение будет автоматически предполагаться при открытии файла.",
	"lineHeight": "Управляет высотой строк.",
	"lineNumbers": "Управляет видимостью номеров строк.",
	"mouseWheelScrollSensitivity": "При событиях прокрутки колесика мыши следует использовать множитель на \"deltaX\" и \"deltaY\".",
	"overviewRulerLanes": "Управляет числом украшений, которые могут отображаться на том же месте в обзорной линейке.",
	"quickSuggestions": "Управляет параметром, определяющим, должны ли при вводе текста отображаться краткие предложения.",
	"quickSuggestionsDelay": "Управляет длительностью задержки (в мс), после которой будут отображаться краткие предложения.",
	"referenceInfos": "Управляет тем, отображает ли редактор справочные сведения для поддерживаемых режимов.",
	"renderWhitespace": "Управляет отображением символов пробелов в редакторе.",
	"roundedSelection": "Управляет параметром, определяющим, будут ли выделения иметь скругленные углы.",
	"scrollBeyondLastLine": "Управляет параметром, определяющим, будет ли редактор прокручиваться за последнюю строку.",
	"selectionHighlight": "Управляет возможностью выделения совпадений, похожих на выделенный фрагмент, в редакторе.",
	"suggestOnTriggerCharacters": "Управляет параметром, определяющим, должны ли предложения автоматически отображаться при вводе триггерных символов.",
	"tabSize": "Управляет размером отрисовки знаков табуляции. Допустимые значения: \"auto\", 2, 4, 6 и т. д. Если задан параметр \"auto\", значение будет автоматически предложено при открытии файла.",
	"wrappingColumn": "Управляет параметром, определяющим число символов, которые будут перенесены редактором на следующую строку. Если этот параметр имеет значение 0, включается перенос по ширине окна просмотра.",
	"wrappingIndent": "Управляет отступом упакованных строк. Может быть \"none\", \"same\" или \"indent\"."
}