/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"acceptSuggestionOnEnter": "Определяет, можно ли принимать предложения клавишей ВВОД в дополнение к клавише TAB. Это помогает избежать неоднозначности между вставкой новых строк или принятием предложений.",
	"autoClosingBrackets": "Определяет, должен ли редактор автоматически закрывать скобки после открытия.",
	"cursorBlinking": "Управляет анимацией мигания курсора. Допустимые значения: \"blink\", \"visible\" и \"hidden\".",
	"cursorStyle": "Определяет стиль курсора. Допустимые значения: \"block\" и \"line\".",
	"detectIndentation": "При открытии файла editor.tabSize и editor.insertSpaces будут определяться на основе содержимого файла.",
	"editorConfigurationTitle": "Конфигурация редактора",
	"folding": "Определяет, включено ли сворачивание кода в редакторе.",
	"fontFamily": "Определяет семейство шрифтов.",
	"fontLigatures": "Включает лигатуры шрифта.",
	"fontSize": "Управляет размером шрифта.",
	"formatOnType": "Управляет параметром, определяющим, должен ли редактор автоматически форматировать строку после ввода.",
	"glyphMargin": "Управляет видимостью полей глифа.",
	"hideCursorInOverviewRuler": "Управляет скрытием курсора в обзорной линейке.",
	"ignoreTrimWhitespace": "Определяет, должен ли редактор несовпадений трактовать несовпадения символов-разделителей как различия.",
	"insertSpaces": "Вставлять пробелы при нажатии клавиши TAB.",
	"insertSpaces.errorMessage": "Ожидается логическое значение. Обратите внимание, что значение auto заменено параметром editor.detectIndentation.",
	"lineHeight": "Управляет высотой строк.",
	"lineNumbers": "Управляет видимостью номеров строк.",
	"mouseWheelScrollSensitivity": "Множитель, используемый для параметров deltaX и deltaY событий прокрутки колесика мыши.",
	"overviewRulerLanes": "Определяет, сколько украшений могут отображаться на одном месте в обзорной линейке.",
	"quickSuggestions": "Определяет, должны ли при вводе текста отображаться краткие предложения.",
	"quickSuggestionsDelay": "Управляет длительностью задержки (в мс), перед отображением кратких предложений.",
	"referenceInfos": "Определяет, отображает ли редактор справочные сведения для поддерживаемых режимов.",
	"renderWhitespace": "Определяет, должны ли в редакторе отображаться символы-разделители.",
	"roundedSelection": "Определяет, будут ли выделения иметь скругленные углы.",
	"rulers": "Столбцы, в которых должны отображаться вертикальные линейки",
	"scrollBeyondLastLine": "Определяет, будет ли содержимое редактора прокручиваться за последнюю строку.",
	"selectionHighlight": "Определяет, будет ли редактор выделять фрагменты, совпадающие с выделенным текстом.",
	"sideBySide": "Определяет, как редактор несовпадений отображает отличия: рядом или в тексте.",
	"suggestOnTriggerCharacters": "Определяет, должны ли при вводе триггерных символов автоматически отображаться предложения.",
	"tabSize": "Число пробелов в табуляции.",
	"tabSize.errorMessage": "Ожидается число. Обратите внимание, что значение auto заменено параметром editor.detectIndentation.",
	"wordSeparators": "Символы, которые будут использоваться как разделители слов при выполнении навигации или других операций, связанных со словами.",
	"wrappingColumn": "Определяет число символов, после которых текст будет перенесен на следующую строку. Если этот параметр имеет значение 0, используется перенос по ширине окна просмотра.",
	"wrappingIndent": "Управляет отступом строк с переносом по словам. Допустимые значения: \"none\", \"same\" или \"indent\"."
}