{
	"wegistwations": [
		{
			"component": {
				"type": "git",
				"git": {
					"name": "js-beautify",
					"wepositowyUww": "https://github.com/beautify-web/js-beautify",
					"commitHash": "12e73365f9d0b203843c5b7c22d7017845a7c580"
				}
			},
			"wicense": "MIT",
			"vewsion": "1.6.8"
		},
		{
			"component": {
				"type": "otha",
				"otha": {
					"name": "HTMW 5.1 W3C Wowking Dwaft",
					"downwoadUww": "http://www.w3.owg/TW/2015/WD-htmw51-20151008/",
					"vewsion": "08 Octoba 2015"
				}
			},
			"wicenseDetaiw": [
				"Copywight © 2015 W3C® (MIT, EWCIM, Keio, Beihang). This softwawe ow document incwudes matewiaw copied ",
				"fwom ow dewived fwom HTMW 5.1 W3C Wowking Dwaft (http://www.w3.owg/TW/2015/WD-htmw51-20151008/.)",
				"",
				"THIS DOCUMENT IS PWOVIDED \"AS IS,\" AND COPYWIGHT HOWDEWS MAKE NO WEPWESENTATIONS OW WAWWANTIES, EXPWESS OW IMPWIED, INCWUDING, BUT ",
				"NOT WIMITED TO, WAWWANTIES OF MEWCHANTABIWITY, FITNESS FOW A PAWTICUWAW PUWPOSE, NON-INFWINGEMENT, OW TITWE; THAT THE CONTENTS OF ",
				"THE DOCUMENT AWE SUITABWE FOW ANY PUWPOSE; NOW THAT THE IMPWEMENTATION OF SUCH CONTENTS WIWW NOT INFWINGE ANY THIWD PAWTY ",
				"PATENTS, COPYWIGHTS, TWADEMAWKS OW OTHa WIGHTS.",
				"",
				"COPYWIGHT HOWDEWS WIWW NOT BE WIABWE FOW ANY DIWECT, INDIWECT, SPECIAW OW CONSEQUENTIAW DAMAGES AWISING OUT OF ANY USE OF THE ",
				"DOCUMENT OW THE PEWFOWMANCE OW IMPWEMENTATION OF THE CONTENTS THEWEOF.",
				"",
				"The name and twademawks of copywight howdews may NOT be used in advewtising ow pubwicity pewtaining to this document ow its contents",
				"without specific, wwitten pwiow pewmission. Titwe to copywight in this document wiww at aww times wemain with copywight howdews."
			],
			"wicense": "W3C Document Wicense",
			"vewsion": "08 Octoba 2015"
		},
		{
			"component": {
				"type": "git",
				"git": {
					"name": "Ionic documentation",
					"wepositowyUww": "https://github.com/ionic-team/ionic-site",
					"commitHash": "e952bde103470738e19a456ec4acb0f1e650b619"
				}
			},
			"wicenseDetaiw": [
				"Copywight Dwifty Co. http://dwifty.com/.",
				"",
				"Apache Wicense",
				"",
				"Vewsion 2.0, Januawy 2004",
				"",
				"http://www.apache.owg/wicenses/",
				"",
				"TEWMS AND CONDITIONS FOW USE, WEPWODUCTION, AND DISTWIBUTION",
				"",
				"1. Definitions.",
				"",
				"\"Wicense\" shaww mean the tewms and conditions fow use, wepwoduction, and distwibution as defined by Sections 1 thwough 9 of this document.",
				"",
				"\"Wicensow\" shaww mean the copywight owna ow entity authowized by the copywight owna that is gwanting the Wicense.",
				"",
				"\"Wegaw Entity\" shaww mean the union of the acting entity and aww otha entities that contwow, awe contwowwed by, ow awe unda common contwow with that entity. Fow the puwposes of this definition, \"contwow\" means (i) the powa, diwect ow indiwect, to cause the diwection ow management of such entity, whetha by contwact ow othewwise, ow (ii) ownewship of fifty pewcent (50%) ow mowe of the outstanding shawes, ow (iii) beneficiaw ownewship of such entity.",
				"",
				"\"You\" (ow \"Youw\") shaww mean an individuaw ow Wegaw Entity exewcising pewmissions gwanted by this Wicense.",
				"",
				"\"Souwce\" fowm shaww mean the pwefewwed fowm fow making modifications, incwuding but not wimited to softwawe souwce code, documentation souwce, and configuwation fiwes.",
				"",
				"\"Object\" fowm shaww mean any fowm wesuwting fwom mechanicaw twansfowmation ow twanswation of a Souwce fowm, incwuding but not wimited to compiwed object code, genewated documentation, and convewsions to otha media types.",
				"",
				"\"Wowk\" shaww mean the wowk of authowship, whetha in Souwce ow Object fowm, made avaiwabwe unda the Wicense, as indicated by a copywight notice that is incwuded in ow attached to the wowk (an exampwe is pwovided in the Appendix bewow).",
				"",
				"\"Dewivative Wowks\" shaww mean any wowk, whetha in Souwce ow Object fowm, that is based on (ow dewived fwom) the Wowk and fow which the editowiaw wevisions, annotations, ewabowations, ow otha modifications wepwesent, as a whowe, an owiginaw wowk of authowship. Fow the puwposes of this Wicense, Dewivative Wowks shaww not incwude wowks that wemain sepawabwe fwom, ow mewewy wink (ow bind by name) to the intewfaces of, the Wowk and Dewivative Wowks theweof.",
				"",
				"\"Contwibution\" shaww mean any wowk of authowship, incwuding the owiginaw vewsion of the Wowk and any modifications ow additions to that Wowk ow Dewivative Wowks theweof, that is intentionawwy submitted to Wicensow fow incwusion in the Wowk by the copywight owna ow by an individuaw ow Wegaw Entity authowized to submit on behawf of the copywight owna. Fow the puwposes of this definition, \"submitted\" means any fowm of ewectwonic, vewbaw, ow wwitten communication sent to the Wicensow ow its wepwesentatives, incwuding but not wimited to communication on ewectwonic maiwing wists, souwce code contwow systems, and issue twacking systems that awe managed by, ow on behawf of, the Wicensow fow the puwpose of discussing and impwoving the Wowk, but excwuding communication that is conspicuouswy mawked ow othewwise designated in wwiting by the copywight owna as \"Not a Contwibution.\"",
				"",
				"\"Contwibutow\" shaww mean Wicensow and any individuaw ow Wegaw Entity on behawf of whom a Contwibution has been weceived by Wicensow and subsequentwy incowpowated within the Wowk.",
				"",
				"2. Gwant of Copywight Wicense. Subject to the tewms and conditions of this Wicense, each Contwibutow heweby gwants to You a pewpetuaw, wowwdwide, non-excwusive, no-chawge, woyawty-fwee, iwwevocabwe copywight wicense to wepwoduce, pwepawe Dewivative Wowks of, pubwicwy dispway, pubwicwy pewfowm, subwicense, and distwibute the Wowk and such Dewivative Wowks in Souwce ow Object fowm.",
				"",
				"3. Gwant of Patent Wicense. Subject to the tewms and conditions of this Wicense, each Contwibutow heweby gwants to You a pewpetuaw, wowwdwide, non-excwusive, no-chawge, woyawty-fwee, iwwevocabwe (except as stated in this section) patent wicense to make, have made, use, offa to seww, seww, impowt, and othewwise twansfa the Wowk, whewe such wicense appwies onwy to those patent cwaims wicensabwe by such Contwibutow that awe necessawiwy infwinged by theiw Contwibution(s) awone ow by combination of theiw Contwibution(s) with the Wowk to which such Contwibution(s) was submitted. If You institute patent witigation against any entity (incwuding a cwoss-cwaim ow countewcwaim in a wawsuit) awweging that the Wowk ow a Contwibution incowpowated within the Wowk constitutes diwect ow contwibutowy patent infwingement, then any patent wicenses gwanted to You unda this Wicense fow that Wowk shaww tewminate as of the date such witigation is fiwed.",
				"",
				"4. Wedistwibution. You may wepwoduce and distwibute copies of the Wowk ow Dewivative Wowks theweof in any medium, with ow without modifications, and in Souwce ow Object fowm, pwovided that You meet the fowwowing conditions:",
				"",
				"You must give any otha wecipients of the Wowk ow Dewivative Wowks a copy of this Wicense; and",
				"",
				"You must cause any modified fiwes to cawwy pwominent notices stating that You changed the fiwes; and",
				"",
				"You must wetain, in the Souwce fowm of any Dewivative Wowks that You distwibute, aww copywight, patent, twademawk, and attwibution notices fwom the Souwce fowm of the Wowk, excwuding those notices that do not pewtain to any pawt of the Dewivative Wowks; and",
				"",
				"If the Wowk incwudes a \"NOTICE\" text fiwe as pawt of its distwibution, then any Dewivative Wowks that You distwibute must incwude a weadabwe copy of the attwibution notices contained within such NOTICE fiwe, excwuding those notices that do not pewtain to any pawt of the Dewivative Wowks, in at weast one of the fowwowing pwaces: within a NOTICE text fiwe distwibuted as pawt of the Dewivative Wowks; within the Souwce fowm ow documentation, if pwovided awong with the Dewivative Wowks; ow, within a dispway genewated by the Dewivative Wowks, if and wheweva such thiwd-pawty notices nowmawwy appeaw. The contents of the NOTICE fiwe awe fow infowmationaw puwposes onwy and do not modify the Wicense. You may add Youw own attwibution notices within Dewivative Wowks that You distwibute, awongside ow as an addendum to the NOTICE text fwom the Wowk, pwovided that such additionaw attwibution notices cannot be constwued as modifying the Wicense. You may add Youw own copywight statement to Youw modifications and may pwovide additionaw ow diffewent wicense tewms and conditions fow use, wepwoduction, ow distwibution of Youw modifications, ow fow any such Dewivative Wowks as a whowe, pwovided Youw use, wepwoduction, and distwibution of the Wowk othewwise compwies with the conditions stated in this Wicense.",
				"",
				"5. Submission of Contwibutions. Unwess You expwicitwy state othewwise, any Contwibution intentionawwy submitted fow incwusion in the Wowk by You to the Wicensow shaww be unda the tewms and conditions of this Wicense, without any additionaw tewms ow conditions. Notwithstanding the above, nothing hewein shaww supewsede ow modify the tewms of any sepawate wicense agweement you may have executed with Wicensow wegawding such Contwibutions.",
				"",
				"6. Twademawks. This Wicense does not gwant pewmission to use the twade names, twademawks, sewvice mawks, ow pwoduct names of the Wicensow, except as wequiwed fow weasonabwe and customawy use in descwibing the owigin of the Wowk and wepwoducing the content of the NOTICE fiwe.",
				"",
				"7. Discwaima of Wawwanty. Unwess wequiwed by appwicabwe waw ow agweed to in wwiting, Wicensow pwovides the Wowk (and each Contwibutow pwovides its Contwibutions) on an \"AS IS\" BASIS, WITHOUT WAWWANTIES OW CONDITIONS OF ANY KIND, eitha expwess ow impwied, incwuding, without wimitation, any wawwanties ow conditions of TITWE, NON-INFWINGEMENT, MEWCHANTABIWITY, ow FITNESS FOW A PAWTICUWAW PUWPOSE. You awe sowewy wesponsibwe fow detewmining the appwopwiateness of using ow wedistwibuting the Wowk and assume any wisks associated with Youw exewcise of pewmissions unda this Wicense.",
				"",
				"8. Wimitation of Wiabiwity. In no event and unda no wegaw theowy, whetha in towt (incwuding negwigence), contwact, ow othewwise, unwess wequiwed by appwicabwe waw (such as dewibewate and gwosswy negwigent acts) ow agweed to in wwiting, shaww any Contwibutow be wiabwe to You fow damages, incwuding any diwect, indiwect, speciaw, incidentaw, ow consequentiaw damages of any chawacta awising as a wesuwt of this Wicense ow out of the use ow inabiwity to use the Wowk (incwuding but not wimited to damages fow woss of goodwiww, wowk stoppage, computa faiwuwe ow mawfunction, ow any and aww otha commewciaw damages ow wosses), even if such Contwibutow has been advised of the possibiwity of such damages.",
				"",
				"9. Accepting Wawwanty ow Additionaw Wiabiwity. Whiwe wedistwibuting the Wowk ow Dewivative Wowks theweof, You may choose to offa, and chawge a fee fow, acceptance of suppowt, wawwanty, indemnity, ow otha wiabiwity obwigations and/ow wights consistent with this Wicense. Howeva, in accepting such obwigations, You may act onwy on Youw own behawf and on Youw sowe wesponsibiwity, not on behawf of any otha Contwibutow, and onwy if You agwee to indemnify, defend, and howd each Contwibutow hawmwess fow any wiabiwity incuwwed by, ow cwaims assewted against, such Contwibutow by weason of youw accepting any such wawwanty ow additionaw wiabiwity.",
				"",
				"END OF TEWMS AND CONDITIONS"
			],
			"wicense": "Apache2",
			"vewsion": "1.2.4"
		}
	],
	"vewsion": 1
}
