{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"previewOnGitHub": "Предварительный просмотр в GitHub",
	"loadingData": "Загрузка данных...",
	"rateLimited": "Превышено ограничение на количество запросов GitHub. Подождите.",
	"similarIssues": "Похожие проблемы",
	"open": "Открыть",
	"closed": "Закрыто",
	"noSimilarIssues": "Подобные задачи не найдены",
	"settingsSearchIssue": "Проблема с параметрами поиска",
	"bugReporter": "Отчет об ошибках",
	"featureRequest": "Запрос функции",
	"performanceIssue": "Проблема с производительностью",
	"stepsToReproduce": "Действия для воспроизведения проблемы",
	"bugDescription": "Опишите действия для точного воспроизведения проблемы. Включите фактические и ожидаемые результаты. Поддерживается разметка Markdown в стиле GitHub. Вы можете отредактировать текст проблемы и добавить снимки экрана при просмотре проблемы в GitHub.",
	"performanceIssueDesciption": "Когда возникла эта проблема с производительностью? Происходит ли она при запуске или после указанной серии действий? Поддерживается разметка Markdown в стиле GitHub. Вы можете отредактировать текст проблемы и добавить снимки экрана при просмотре проблемы в GitHub.",
	"description": "Описание",
	"featureRequestDescription": "Опишите функцию, которую хотели бы увидеть. Поддерживается разметка Markdown в стиле GitHub. Вы можете отредактировать текст проблемы и добавить снимки экрана при просмотре проблемы в GitHub.",
	"expectedResults": "Ожидаемые результаты",
	"settingsSearchResultsDescription": "Укажите результаты, которые должны быть получены для этого поискового запроса. Поддерживается разметка Markdown в стиле GitHub. Вы можете отредактировать текст проблемы и добавить снимки экрана при просмотре проблемы в GitHub.",
	"pasteData": "Мы скопировали необходимые данные в буфер обмена, так как у них был слишком большой размер для отправки. Вставьте эти данные.",
	"disabledExtensions": "Расширения отключены"
}