/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"ProblemPatternParser.loopProperty.notLast": "A propriedade loop só é suportada na última linha correspondente.",
	"ProblemPatternParser.problemPattern.missingRegExp": "Está faltando uma expressão regular a problema padrão.",
	"ProblemPatternParser.problemPattern.missingProperty": "O problema padrão é inválido. Ele deve ter ao menos um arquivo, mensagem e linha ou local de grupo de correspondência.",
	"ProblemPatternParser.invalidRegexp": "Erro: a cadeia de caracteres {0} não é uma expressão regular válida.\n",
	"ProblemPatternSchema.regexp": "A expressão regular para procurar um erro, aviso ou informação na saída.",
	"ProblemPatternSchema.file": "O índice do grupo de correspondência do arquivo. Se omitido, será usado 1.",
	"ProblemPatternSchema.location": "O índice de grupo de correspondência da localização do problema. Padrões de localização válidos são: (linha), (linha, coluna) e (startLine, startColumn, endLine, endColumn). Se omitido (linha, coluna) é assumido.",
	"ProblemPatternSchema.line": "O índice de grupo de correspondência da linha do problema. O padrão é 2",
	"ProblemPatternSchema.column": "O índice de grupo de correspondência de caractere da linha do problema. O padrão é 3",
	"ProblemPatternSchema.endLine": "O índice de grupo de correspondência de linha final do problema. O padrão é indefinido",
	"ProblemPatternSchema.endColumn": "O índice de grupo de correspondência de caráter final de linha do problema. O padrão é indefinido",
	"ProblemPatternSchema.severity": "O índice de grupo de correspondência da gravidade do problema. O padrão é indefinido",
	"ProblemPatternSchema.code": "O índice de grupo de correspondência do código do problema. O padrão é indefinido",
	"ProblemPatternSchema.message": "O índice de grupo de correspondência da mensagem. Se omitido o padrão é 4 se o local for especificado. Caso contrário o padrão é 5.",
	"ProblemPatternSchema.loop": "Em um loop de correspondência multi linha indica se este padrão é executado em um loop enquanto houver correspondências. Somente pode ser especificado no último padrão em um padrão de linha múltiplas.",
	"NamedProblemPatternSchema.name": "O nome do modelo de problema.",
	"NamedMultiLineProblemPatternSchema.name": "O nome do modelo de problema multi-linhas.",
	"NamedMultiLineProblemPatternSchema.patterns": "Os padrões atuais.",
	"ProblemPatternExtPoint": "Contribui aos modelos de problema",
	"ProblemPatternRegistry.error": "Modelo de problema inválido. O  modelo será ignorado.",
	"ProblemMatcherParser.noProblemMatcher": "Erro: a descrição não pode ser convertida em uma correspondência de problema:\n{0}\n\n",
	"ProblemMatcherParser.noProblemPattern": "Erro: a descrição nao define um padrão de problema válido: {0}\n",
	"ProblemMatcherParser.noOwner": "Erro: a descriçao não define um proprietário:\n{0}\n",
	"ProblemMatcherParser.noFileLocation": "Erro: a descrição não define uma localização de arquivo:\n{0}\n",
	"ProblemMatcherParser.unknownSeverity": "Info: severidade {0} desconhecida. Valores válidos são erro, aviso e info.\n",
	"ProblemMatcherParser.noDefinedPatter": "Erro: o padrão com o identificador {0} não existe.",
	"ProblemMatcherParser.noIdentifier": "Erro: a propriedade padrão se refere a um identificador vazio.",
	"ProblemMatcherParser.noValidIdentifier": "Erro: a propriedade padrão {0} não é uma variável de padrões válida.",
	"ProblemMatcherParser.problemPattern.watchingMatcher": "Um problema de correspondência deve obrigatoriamente definir padrão inicial e um padrão final para monitoramento.",
	"ProblemMatcherParser.invalidRegexp": "Erro: a cadeia de caracteres {0} não é uma expressão regular válida.\n",
	"WatchingPatternSchema.regexp": "A expressão regular para detectar o início ou o fim de uma tarefa em segundo plano.",
	"WatchingPatternSchema.file": "O índice do grupo de correspondência do arquivo. Pode ser omitido.",
	"PatternTypeSchema.name": "O nome de um padrão pré-definido ou contribuído.",
	"PatternTypeSchema.description": "Um padrão de problema ou o nome de um padrão de problema pré-definido ou contribuído. Pode ser omitido se base for especificada.",
	"ProblemMatcherSchema.base": "O nome de uma correspondência de problema base a ser utilizado.",
	"ProblemMatcherSchema.owner": "O proprietário de um problema dentro do código. Pode ser omitido se base for especificada. Default para 'externo' se omitido e base não for especificada.",
	"ProblemMatcherSchema.severity": "A severidade padrão para captura de problemas. É utilizada se o padrão não definir um grupo correspondente para severidade.",
	"ProblemMatcherSchema.applyTo": "Controla se um problema reportado em um documento de texto é aplicado somente para aberto, fechado ou todos os documentos.",
	"ProblemMatcherSchema.fileLocation": "Define como os nomes de arquivos reportados em um padrão de problema devem ser interpretados.",
	"ProblemMatcherSchema.background": "Padrões para monitorar o início e o término de um pesquisador ativo em uma tarefa em segundo plano.",
	"ProblemMatcherSchema.background.activeOnStart": "Se configurado para verdadeiro, o monitor em segundo plano está em modo ativo quando a tarefa inicia. Isto é igual a emissão de uma linha que corresponde ao beginPattern",
	"ProblemMatcherSchema.background.beginsPattern": "Se houver correspondência na saída o início de uma tarefa em segundo plano é sinalizada.",
	"ProblemMatcherSchema.background.endsPattern": "Se houver correspondência na saída o final de uma tarefa em segundo plano é sinalizada.",
	"ProblemMatcherSchema.watching.deprecated": "A propriedade watching foi descontinuada. Use background no lugar dela.",
	"ProblemMatcherSchema.watching": "Padrões para monitorar o início e o término de um pesquisador observando.",
	"ProblemMatcherSchema.watching.activeOnStart": "Se configurado para verdadeiro, o monitoramento está em modo ativo quando a tarefa inicia. Isto é igual a emissão de uma linha que corresponde ao beginPattern",
	"ProblemMatcherSchema.watching.beginsPattern": "Se houver correspondência na saída o início de uma tarefa observada é sinalizada.",
	"ProblemMatcherSchema.watching.endsPattern": "Se houver correspondência na saída o final de uma tarefa observada é sinalizada.",
	"LegacyProblemMatcherSchema.watchedBegin.deprecated": "Esta propriedade está descontinuada. Ao invés, use a propriedade de observação.",
	"LegacyProblemMatcherSchema.watchedBegin": "Uma expressão regular sinalizando que uma tarefa observada é ativada através da observação.",
	"LegacyProblemMatcherSchema.watchedEnd.deprecated": "Esta propriedade está descontinuada. Ao invés, use a propriedade de observação.",
	"LegacyProblemMatcherSchema.watchedEnd": "Uma expressão regular sinalizando que uma tarefa observada terminou a execução.",
	"NamedProblemMatcherSchema.name": "O nome do correspondente do problema usado para se referir a ele.",
	"NamedProblemMatcherSchema.label": "Um rótulo legível para o correspondente do problema.",
	"ProblemMatcherExtPoint": "Contribui aos correspondentes de problema",
	"msCompile": "Problemas do compilador Microsoft",
	"lessCompile": "Menos problemas",
	"gulp-tsc": "Problemas do Gulp TSC",
	"jshint": "Problemas JSHint",
	"jshint-stylish": "Problemas de estilo JSHint",
	"eslint-compact": "Problemas compactos ESLint",
	"eslint-stylish": "Problemas de estilo ESLint",
	"go": "Problemas Go"
}