/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"html.format.enable.desc": "Activer/désactiver le formateur HTML par défaut.",
	"html.format.wrapLineLength.desc": "Nombre maximal de caractères par ligne (0 = désactiver).",
	"html.format.unformatted.desc": "Liste des balises, séparées par des virgules, qui ne doivent pas être remises en forme. 'null' correspond par défaut à toutes les balises répertoriées à l'adresse https://www.w3.org/TR/html5/dom.html#phrasing-content.",
	"html.format.contentUnformatted.desc": "Liste des balises, séparées par des virgules, dont le contenu ne doit pas être remis en forme. 'null' correspond par défaut à toutes les balises 'pre'.",
	"html.format.indentInnerHtml.desc": "Mettez en retrait les sections <head> et <body>.",
	"html.format.preserveNewLines.desc": "Spécifie si les sauts de ligne existants qui précèdent les éléments doivent être conservés. Fonctionne uniquement devant les éléments, pas dans les balises, ni pour du texte.",
	"html.format.maxPreserveNewLines.desc": "Nombre maximal de sauts de ligne à conserver dans un bloc. Utilisez 'null' pour indiquer une valeur illimitée.",
	"html.format.indentHandlebars.desc": "Mettez en forme et en retrait {{#foo}}, ainsi que {{/foo}}.",
	"html.format.endWithNewline.desc": "Finissez par un caractère de nouvelle ligne.",
	"html.format.extraLiners.desc": "Liste de balises, séparées par une virgule, qui doivent être précédées d'une nouvelle ligne. 'null' prend par défaut la valeur \"head, body, /html\".",
	"html.format.wrapAttributes.desc": "Retour à la ligne des attributs.",
	"html.format.wrapAttributes.auto": "Retour automatique à la ligne des attributs uniquement en cas de dépassement de la longueur de la ligne.",
	"html.format.wrapAttributes.force": "Retour automatique à la ligne de chaque attribut, sauf le premier.",
	"html.format.wrapAttributes.forcealign": "Retour automatique à la ligne de chaque attribut, sauf le premier, avec maintien de l'alignement.",
	"html.format.wrapAttributes.forcemultiline": "Retour automatique à la ligne de chaque attribut.",
	"html.suggest.angular1.desc": "Permet de configurer la prise en charge intégrée du langage HTML pour suggérer des balises et propriétés Angular V1.",
	"html.suggest.ionic.desc": "Permet de configurer la prise en charge intégrée du langage HTML pour suggérer des balises, des propriétés et des valeurs Ionic.",
	"html.suggest.html5.desc": "Permet de configurer la prise en charge intégrée du langage HTML pour suggérer des balises, des propriétés et des valeurs HTML5.",
	"html.trace.server.desc": "Trace la communication entre VS Code et le serveur de langage HTML.",
	"html.validate.scripts": "Configure la validation des scripts incorporés par la prise en charge du langage HTML intégré.",
	"html.validate.styles": "Configure la validation des styles incorporés par la prise en charge du langage HTML intégré.",
	"html.autoClosingTags": "Activez/désactivez la fermeture automatique des balises HTML."
}