/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"lineHighlight": "Color de fondo del resaltado de línea en la posición del cursor.",
	"lineHighlightBorderBox": "Color de fondo del borde alrededor de la línea en la posición del cursor.",
	"rangeHighlight": "Color de fondo de los intervalos resaltados; por ejemplo, para Apertura Rápida y Buscar.",
	"caret": "Color del cursor del editor.",
	"editorCursorBackground": "Color de fondo del cursor de edición. Permite personalizar el color del carácter solapado por el bloque del cursor.",
	"editorWhitespaces": "Color de los caracteres de espacio en blanco del editor.",
	"editorIndentGuides": "Color de las guías de sangría del editor.",
	"editorLineNumbers": "Color de números de línea del editor.",
	"editorRuler": "Color de las reglas del editor",
	"editorCodeLensForeground": "Color principal de lentes de código en el editor",
	"editorBracketMatchBackground": "Color de fondo tras corchetes coincidentes",
	"editorBracketMatchBorder": "Color de bloques con corchetes coincidentes",
	"editorOverviewRulerBorder": "Color del borde de la regla de visión general.",
	"editorGutter": "Color de fondo del margen del editor. Este espacio contiene los márgenes de glifos y los números de línea.",
	"errorForeground": "Color de primer plano de squigglies de error en el editor.",
	"errorBorder": "Color de borde de squigglies de error en el editor.",
	"warningForeground": "Color de primer plano de squigglies de advertencia en el editor.",
	"warningBorder": "Color de borde de squigglies de advertencia en el editor.",
	"overviewRulerRangeHighlight": "Color de marcador de regla de información general para intervalos resaltados.",
	"overviewRuleError": "Color de marcador de regla de información general para errores. ",
	"overviewRuleWarning": "Color de marcador de regla de información general para advertencias.",
	"overviewRuleInfo": "Color de marcador de regla de información general para mensajes informativos. "
}