/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"activeVersion": "En cours",
	"channelName": "TypeScript",
	"later": "Plus tard",
	"learnMore": "En savoir plus",
	"noBundledServerFound": "Le tsserver de VSCode a été supprimé par une autre application, par exemple un outil de détection de virus mal configuré. Réinstallez VS Code.",
	"noServerFound": "Le chemin {0} ne pointe pas vers une installation tsserver valide. Utilisation par défaut de la version TypeScript groupée.",
	"openTsServerLog.openFileFailedFailed": "Impossible d'ouvrir le fichier journal du serveur TS",
	"reloadBlurb": "Recharger la fenêtre pour appliquer les changements",
	"reloadTitle": "Recharger",
	"selectTsVersion": "Sélectionner la version TypeScript utilisée pour les fonctionnalités de langage JavaScript et TypeScript",
	"serverCouldNotBeStarted": "Impossible de démarrer le serveur de langage TypeScript. Message d'erreur : {0}",
	"serverDied": "Le service de langage TypeScript s'est subitement arrêté 5 fois au cours des 5 dernières minutes.",
	"serverDiedAfterStart": "Le service de langage TypeScript s'est subitement arrêté 5 fois juste après avoir démarré. Il n'y aura pas d'autres redémarrages.",
	"serverDiedReportIssue": "Signaler un problème",
	"tsserverLogReloadBlurb": "Recharger VS Code pour appliquer le changement de 'typescript.tsserver.log'",
	"typescript.openTsServerLog.enableAndReloadOption": "Activer la journalisation et recharger VS Code",
	"typescript.openTsServerLog.loggingNotEnabled": "La journalisation du serveur TS est désactivée. Définissez 'typescript.tsserver.log', puis rechargez VS Code pour activer la journalisation",
	"typescript.openTsServerLog.noLogFile": "Le serveur TS n'a pas démarré la journalisation.",
	"typescript.openTsServerLog.notSupported": "La journalisation du serveur TS nécessite TS 2.2.2+",
	"useVSCodeVersionOption": "Utiliser la version de VSCode",
	"useWorkspaceVersionOption": "Utiliser la version de l'espace de travail",
	"versionNumber.custom": "personnalisé"
}