/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"ShowAccessibilityHelpAction": "Hilfe zur Barrierefreiheit anzeigen",
	"experimentalScreenReaderOptsOn": "Experimentelle Sprachausgabeunterstützung ist aufgrund des Einstellungsschlüssels \"editor.experimentalScreenReader\" aktiviert.",
	"experimentalScreenReaderSessionOff": "Experimentelle Sprachausgabeunterstützung ist deaktiviert. Aktivieren sie diese Option für diese Sitzung, indem Sie {0} drücken, oder aktivieren Sie sie für alle Sitzungen, indem Sie die Einstellung \"editor.experimentalScreenReader\" auf \"true\" festlegen.",
	"experimentalScreenReaderSessionOffNoKb": "Experimentelle Sprachausgabeunterstützung ist deaktiviert. Der Befehl kann {0} zurzeit nicht durch eine Tastenbindung ausgelöst werden. Aktivieren Sie diese Option für alle Sitzungen, indem Sie die Einstellung \"editor.experimentalScreenReader\" auf \"true\" festlegen.",
	"experimentalScreenReaderSessionOn": "Experimentelle Sprachausgabeunterstützung ist für diese Sitzung aktiviert. Schalten Sie dieses Verhalten durch Drücken von {0} um.",
	"experimentalScreenReaderSessionOnNoKb": "Experimentelle Sprachausgabeunterstützung ist für diese Sitzung aktiviert. Der Befehl kann {0} zurzeit nicht durch eine Tastenbindung ausgelöst werden.",
	"introMsg": "Vielen Dank, dass Sie die experimentellen Optionen für Barrierefreiheit von VS Code testen.",
	"outroMsg": "Sie können diese QuickInfo schließen und durch Drücken von ESC zum Editor zurückkehren.",
	"status": "Status:",
	"tabFocusModeOffMsg": "Durch Drücken der TAB-TASTE in diesem Editor wird das Tabstoppzeichen eingefügt. Schalten Sie dieses Verhalten um, indem Sie {0} drücken.",
	"tabFocusModeOffMsgNoKb": "Durch Drücken der TAB-TASTE in diesem Editor wird der Fokus in das nächste Element verschoben, das den Fokus erhalten kann. Der Befehl {0} kann zurzeit nicht durch eine Tastenbindung ausgelöst werden.",
	"tabFocusModeOnMsg": "Durch Drücken der TAB-TASTE in diesem Editor wird der Fokus in das nächste Element verschoben, das den Fokus erhalten kann. Schalten Sie dieses Verhalten um, indem Sie {0} drücken.",
	"tabFocusModeOnMsgNoKb": "Durch Drücken der TAB-TASTE in diesem Editor wird der Fokus in das nächste Element verschoben, das den Fokus erhalten kann. Der Befehl {0} kann zurzeit nicht durch eine Tastenbindung ausgelöst werden."
}